AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*
** ###################################################################
**     Processors:          MIMXRT1052CVL5A
**                          MIMXRT1052DVL6A
**
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    IMXRT1050RM Rev.C, 08/2017
**     Version:             rev. 0.1, 2017-01-10
**     Build:               b180126
**
**     Abstract:
**         This header file implements peripheral memory map for MIMXRT1052
**         processor.
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2018 NXP
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2017-01-10)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file MIMXRT1052.h
 * @version 0.1
 * @date 2017-01-10
 * @brief Peripheral memory map for MIMXRT1052
 *
 * This header file implements peripheral memory map for MIMXRT1052 processor.
 */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MIMXRT1052)  /* Check if memory map has not been already included */
#define MCU_MIMXRT1052

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error MIMXRT1052 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0000U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0001U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum {
  INT_Initial_Stack_Pointer    = 0,                /**< Initial Stack Pointer */
  INT_Initial_Program_Counter  = 1,                /**< Initial Program Counter */
  INT_NMI                      = 2,                /**< Non-maskable Interrupt (NMI) */
  INT_Hard_Fault               = 3,                /**< Hard Fault */
  INT_Reserved0                = 4,                /**< Reserved interrupt */
  INT_Reserved1                = 5,                /**< Reserved interrupt */
  INT_Reserved2                = 6,                /**< Reserved interrupt */
  INT_Reserved3                = 7,                /**< Reserved interrupt */
  INT_Reserved4                = 8,                /**< Reserved interrupt */
  INT_Reserved5                = 9,                /**< Reserved interrupt */
  INT_Reserved6                = 10,               /**< Reserved interrupt */
  INT_SVCall                   = 11,               /**< Supervisor call (SVCall) */
  INT_Reserved7                = 12,               /**< Reserved interrupt */
  INT_Reserved8                = 13,               /**< Reserved interrupt */
  INT_PendableSrvReq           = 14,               /**< Pendable request for system service (PendableSrvReq) */
  INT_SysTick                  = 15,               /**< System tick timer (SysTick) */
  INT_DMA0_DMA16               = 16,               /**< DMA channel 0/16 transfer complete */
  INT_DMA1_DMA17               = 17,               /**< DMA channel 1/17 transfer complete */
  INT_DMA2_DMA18               = 18,               /**< DMA channel 2/18 transfer complete */
  INT_DMA3_DMA19               = 19,               /**< DMA channel 3/19 transfer complete */
  INT_DMA4_DMA20               = 20,               /**< DMA channel 4/20 transfer complete */
  INT_DMA5_DMA21               = 21,               /**< DMA channel 5/21 transfer complete */
  INT_DMA6_DMA22               = 22,               /**< DMA channel 6/22 transfer complete */
  INT_DMA7_DMA23               = 23,               /**< DMA channel 7/23 transfer complete */
  INT_DMA8_DMA24               = 24,               /**< DMA channel 8/24 transfer complete */
  INT_DMA9_DMA25               = 25,               /**< DMA channel 9/25 transfer complete */
  INT_DMA10_DMA26              = 26,               /**< DMA channel 10/26 transfer complete */
  INT_DMA11_DMA27              = 27,               /**< DMA channel 11/27 transfer complete */
  INT_DMA12_DMA28              = 28,               /**< DMA channel 12/28 transfer complete */
  INT_DMA13_DMA29              = 29,               /**< DMA channel 13/29 transfer complete */
  INT_DMA14_DMA30              = 30,               /**< DMA channel 14/30 transfer complete */
  INT_DMA15_DMA31              = 31,               /**< DMA channel 15/31 transfer complete */
  INT_DMA_ERROR                = 32,               /**< DMA error interrupt channels 0-15 / 16-31 */
  INT_CTI0_ERROR               = 33,               /**< CTI0_Error */
  INT_CTI1_ERROR               = 34,               /**< CTI1_Error */
  INT_CORE                     = 35,               /**< CorePlatform exception IRQ */
  INT_LPUART1                  = 36,               /**< LPUART1 TX interrupt and RX interrupt */
  INT_LPUART2                  = 37,               /**< LPUART2 TX interrupt and RX interrupt */
  INT_LPUART3                  = 38,               /**< LPUART3 TX interrupt and RX interrupt */
  INT_LPUART4                  = 39,               /**< LPUART4 TX interrupt and RX interrupt */
  INT_LPUART5                  = 40,               /**< LPUART5 TX interrupt and RX interrupt */
  INT_LPUART6                  = 41,               /**< LPUART6 TX interrupt and RX interrupt */
  INT_LPUART7                  = 42,               /**< LPUART7 TX interrupt and RX interrupt */
  INT_LPUART8                  = 43,               /**< LPUART8 TX interrupt and RX interrupt */
  INT_LPI2C1                   = 44,               /**< LPI2C1 interrupt */
  INT_LPI2C2                   = 45,               /**< LPI2C2 interrupt */
  INT_LPI2C3                   = 46,               /**< LPI2C3 interrupt */
  INT_LPI2C4                   = 47,               /**< LPI2C4 interrupt */
  INT_LPSPI1                   = 48,               /**< LPSPI1 single interrupt vector for all sources */
  INT_LPSPI2                   = 49,               /**< LPSPI2 single interrupt vector for all sources */
  INT_LPSPI3                   = 50,               /**< LPSPI3 single interrupt vector for all sources */
  INT_LPSPI4                   = 51,               /**< LPSPI4  single interrupt vector for all sources */
  INT_CAN1                     = 52,               /**< CAN1 interrupt */
  INT_CAN2                     = 53,               /**< CAN2 interrupt */
  INT_FLEXRAM                  = 54,               /**< FlexRAM address out of range Or access hit IRQ */
  INT_KPP                      = 55,               /**< Keypad nterrupt */
  INT_TSC_DIG                  = 56,               /**< TSC interrupt */
  INT_GPR_IRQ                  = 57,               /**< GPR interrupt */
  INT_LCDIF                    = 58,               /**< LCDIF interrupt */
  INT_CSI                      = 59,               /**< CSI interrupt */
  INT_PXP                      = 60,               /**< PXP interrupt */
  INT_WDOG2                    = 61,               /**< WDOG2 interrupt */
  INT_SNVS_HP_WRAPPER          = 62,               /**< SRTC Consolidated Interrupt. Non TZ */
  INT_SNVS_HP_WRAPPER_TZ       = 63,               /**< SRTC Security Interrupt. TZ */
  INT_SNVS_LP_WRAPPER          = 64,               /**< ON-OFF button press shorter than 5 secs (pulse event) */
  INT_CSU                      = 65,               /**< CSU interrupt */
  INT_DCP                      = 66,               /**< DCP_IRQ interrupt */
  INT_DCP_VMI                  = 67,               /**< DCP_VMI_IRQ interrupt */
  INT_Reserved68               = 68,               /**< Reserved interrupt */
  INT_TRNG                     = 69,               /**< TRNG interrupt */
  INT_SJC                      = 70,               /**< SJC interrupt */
  INT_BEE                      = 71,               /**< BEE interrupt */
  INT_SAI1                     = 72,               /**< SAI1 interrupt */
  INT_SAI2                     = 73,               /**< SAI1 interrupt */
  INT_SAI3_RX                  = 74,               /**< SAI3 interrupt */
  INT_SAI3_TX                  = 75,               /**< SAI3 interrupt */
  INT_SPDIF                    = 76,               /**< SPDIF interrupt */
  INT_ANATOP_EVENT0            = 77,               /**< ANATOP interrupt */
  INT_ANATOP_EVENT1            = 78,               /**< ANATOP interrupt */
  INT_ANATOP_TAMP_LOW_HIGH     = 79,               /**< ANATOP interrupt */
  INT_ANATOP_TEMP_PANIC        = 80,               /**< ANATOP interrupt */
  INT_USB_PHY1                 = 81,               /**< USBPHY (UTMI0), Interrupt */
  INT_USB_PHY2                 = 82,               /**< USBPHY (UTMI0), Interrupt */
  INT_ADC1                     = 83,               /**< ADC1 interrupt */
  INT_ADC2                     = 84,               /**< ADC2 interrupt */
  INT_DCDC                     = 85,               /**< DCDC interrupt */
  INT_Reserved86               = 86,               /**< Reserved interrupt */
  INT_Reserved87               = 87,               /**< Reserved interrupt */
  INT_GPIO1_INT0               = 88,               /**< Active HIGH Interrupt from INT0 from GPIO */
  INT_GPIO1_INT1               = 89,               /**< Active HIGH Interrupt from INT1 from GPIO */
  INT_GPIO1_INT2               = 90,               /**< Active HIGH Interrupt from INT2 from GPIO */
  INT_GPIO1_INT3               = 91,               /**< Active HIGH Interrupt from INT3 from GPIO */
  INT_GPIO1_INT4               = 92,               /**< Active HIGH Interrupt from INT4 from GPIO */
  INT_GPIO1_INT5               = 93,               /**< Active HIGH Interrupt from INT5 from GPIO */
  INT_GPIO1_INT6               = 94,               /**< Active HIGH Interrupt from INT6 from GPIO */
  INT_GPIO1_INT7               = 95,               /**< Active HIGH Interrupt from INT7 from GPIO */
  INT_GPIO1_Combined_0_15      = 96,               /**< Combined interrupt indication for GPIO1 signal 0 throughout 15 */
  INT_GPIO1_Combined_16_31     = 97,               /**< Combined interrupt indication for GPIO1 signal 16 throughout 31 */
  INT_GPIO2_Combined_0_15      = 98,               /**< Combined interrupt indication for GPIO2 signal 0 throughout 15 */
  INT_GPIO2_Combined_16_31     = 99,               /**< Combined interrupt indication for GPIO2 signal 16 throughout 31 */
  INT_GPIO3_Combined_0_15      = 100,              /**< Combined interrupt indication for GPIO3 signal 0 throughout 15 */
  INT_GPIO3_Combined_16_31     = 101,              /**< Combined interrupt indication for GPIO3 signal 16 throughout 31 */
  INT_GPIO4_Combined_0_15      = 102,              /**< Combined interrupt indication for GPIO4 signal 0 throughout 15 */
  INT_GPIO4_Combined_16_31     = 103,              /**< Combined interrupt indication for GPIO4 signal 16 throughout 31 */
  INT_GPIO5_Combined_0_15      = 104,              /**< Combined interrupt indication for GPIO5 signal 0 throughout 15 */
  INT_GPIO5_Combined_16_31     = 105,              /**< Combined interrupt indication for GPIO5 signal 16 throughout 31 */
  INT_FLEXIO1                  = 106,              /**< FLEXIO1 interrupt */
  INT_FLEXIO2                  = 107,              /**< FLEXIO2 interrupt */
  INT_WDOG1                    = 108,              /**< WDOG1 interrupt */
  INT_RTWDOG                   = 109,              /**< RTWDOG interrupt */
  INT_EWM                      = 110,              /**< EWM interrupt */
  INT_CCM_1                    = 111,              /**< CCM IRQ1 interrupt */
  INT_CCM_2                    = 112,              /**< CCM IRQ2 interrupt */
  INT_GPC                      = 113,              /**< GPC interrupt */
  INT_SRC                      = 114,              /**< SRC interrupt */
  INT_Reserved115              = 115,              /**< Reserved interrupt */
  INT_GPT1                     = 116,              /**< GPT1 interrupt */
  INT_GPT2                     = 117,              /**< GPT2 interrupt */
  INT_PWM1_0                   = 118,              /**< PWM1 capture 0, compare 0, or reload 0 interrupt */
  INT_PWM1_1                   = 119,              /**< PWM1 capture 1, compare 1, or reload 0 interrupt */
  INT_PWM1_2                   = 120,              /**< PWM1 capture 2, compare 2, or reload 0 interrupt */
  INT_PWM1_3                   = 121,              /**< PWM1 capture 3, compare 3, or reload 0 interrupt */
  INT_PWM1_FAULT               = 122,              /**< PWM1 fault or reload error interrupt */
  INT_Reserved123              = 123,              /**< Reserved interrupt */
  INT_FLEXSPI                  = 124,              /**< FlexSPI0 interrupt */
  INT_SEMC                     = 125,              /**< Reserved interrupt */
  INT_USDHC1                   = 126,              /**< USDHC1 interrupt */
  INT_USDHC2                   = 127,              /**< USDHC2 interrupt */
  INT_USB_OTG2                 = 128,              /**< USBO2 USB OTG2 */
  INT_USB_OTG1                 = 129,              /**< USBO2 USB OTG1 */
  INT_ENET                     = 130,              /**< ENET interrupt */
  INT_ENET_1588_Timer          = 131,              /**< ENET_1588_Timer interrupt */
  INT_XBAR1_IRQ_0_1            = 132,              /**< XBAR1 interrupt */
  INT_XBAR1_IRQ_2_3            = 133,              /**< XBAR1 interrupt */
  INT_ADC_ETC_IRQ0             = 134,              /**< ADCETC IRQ0 interrupt */
  INT_ADC_ETC_IRQ1             = 135,              /**< ADCETC IRQ1 interrupt */
  INT_ADC_ETC_IRQ2             = 136,              /**< ADCETC IRQ2 interrupt */
  INT_ADC_ETC_ERROR_IRQ        = 137,              /**< ADCETC Error IRQ interrupt */
  INT_PIT                      = 138,              /**< PIT interrupt */
  INT_ACMP1                    = 139,              /**< ACMP interrupt */
  INT_ACMP2                    = 140,              /**< ACMP interrupt */
  INT_ACMP3                    = 141,              /**< ACMP interrupt */
  INT_ACMP4                    = 142,              /**< ACMP interrupt */
  INT_Reserved143              = 143,              /**< Reserved interrupt */
  INT_Reserved144              = 144,              /**< Reserved interrupt */
  INT_ENC1                     = 145,              /**< ENC1 interrupt */
  INT_ENC2                     = 146,              /**< ENC2 interrupt */
  INT_ENC3                     = 147,              /**< ENC3 interrupt */
  INT_ENC4                     = 148,              /**< ENC4 interrupt */
  INT_TMR1                     = 149,              /**< TMR1 interrupt */
  INT_TMR2                     = 150,              /**< TMR2 interrupt */
  INT_TMR3                     = 151,              /**< TMR3 interrupt */
  INT_TMR4                     = 152,              /**< TMR4 interrupt */
  INT_PWM2_0                   = 153,              /**< PWM2 capture 0, compare 0, or reload 0 interrupt */
  INT_PWM2_1                   = 154,              /**< PWM2 capture 1, compare 1, or reload 0 interrupt */
  INT_PWM2_2                   = 155,              /**< PWM2 capture 2, compare 2, or reload 0 interrupt */
  INT_PWM2_3                   = 156,              /**< PWM2 capture 3, compare 3, or reload 0 interrupt */
  INT_PWM2_FAULT               = 157,              /**< PWM2 fault or reload error interrupt */
  INT_PWM3_0                   = 158,              /**< PWM3 capture 0, compare 0, or reload 0 interrupt */
  INT_PWM3_1                   = 159,              /**< PWM3 capture 1, compare 1, or reload 0 interrupt */
  INT_PWM3_2                   = 160,              /**< PWM3 capture 2, compare 2, or reload 0 interrupt */
  INT_PWM3_3                   = 161,              /**< PWM3 capture 3, compare 3, or reload 0 interrupt */
  INT_PWM3_FAULT               = 162,              /**< PWM3 fault or reload error interrupt */
  INT_PWM4_0                   = 163,              /**< PWM4 capture 0, compare 0, or reload 0 interrupt */
  INT_PWM4_1                   = 164,              /**< PWM4 capture 1, compare 1, or reload 0 interrupt */
  INT_PWM4_2                   = 165,              /**< PWM4 capture 2, compare 2, or reload 0 interrupt */
  INT_PWM4_3                   = 166,              /**< PWM4 capture 3, compare 3, or reload 0 interrupt */
  INT_PWM4_FAULT               = 167,              /**< PWM4 fault or reload error interrupt */
  INT_Reserved168              = 168,              /**< Reserved interrupt */
  INT_Reserved169              = 169,              /**< Reserved interrupt */
  INT_Reserved170              = 170,              /**< Reserved interrupt */
  INT_Reserved171              = 171,              /**< Reserved interrupt */
  INT_Reserved172              = 172,              /**< Reserved interrupt */
  INT_Reserved173              = 173,              /**< Reserved interrupt */
  INT_SJC_ARM_DEBUG            = 174,              /**< SJC ARM debug interrupt */
  INT_NMI_WAKEUP               = 175               /**< NMI wake up */
} IRQInterruptIndex;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Peripheral type defines
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_defines Peripheral type defines
 * @{
 */


