AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name TRIGn_RESULT_1_0 - ETC_TRIG Result Data 1/0 Register */
#define ADC_ETC_TRIGn_RESULT_1_0_DATA0_MASK      (0xFFFU)
#define ADC_ETC_TRIGn_RESULT_1_0_DATA0_SHIFT     (0U)
#define ADC_ETC_TRIGn_RESULT_1_0_DATA0(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_1_0_DATA0_SHIFT)) & ADC_ETC_TRIGn_RESULT_1_0_DATA0_MASK)
#define ADC_ETC_TRIGn_RESULT_1_0_DATA1_MASK      (0xFFF0000U)
#define ADC_ETC_TRIGn_RESULT_1_0_DATA1_SHIFT     (16U)
#define ADC_ETC_TRIGn_RESULT_1_0_DATA1(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_1_0_DATA1_SHIFT)) & ADC_ETC_TRIGn_RESULT_1_0_DATA1_MASK)

/* The count of ADC_ETC_TRIGn_RESULT_1_0 */
#define ADC_ETC_TRIGn_RESULT_1_0_COUNT           (8U)

/*! @name TRIGn_RESULT_3_2 - ETC_TRIG Result Data 3/2 Register */
#define ADC_ETC_TRIGn_RESULT_3_2_DATA2_MASK      (0xFFFU)
#define ADC_ETC_TRIGn_RESULT_3_2_DATA2_SHIFT     (0U)
#define ADC_ETC_TRIGn_RESULT_3_2_DATA2(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_3_2_DATA2_SHIFT)) & ADC_ETC_TRIGn_RESULT_3_2_DATA2_MASK)
#define ADC_ETC_TRIGn_RESULT_3_2_DATA3_MASK      (0xFFF0000U)
#define ADC_ETC_TRIGn_RESULT_3_2_DATA3_SHIFT     (16U)
#define ADC_ETC_TRIGn_RESULT_3_2_DATA3(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_3_2_DATA3_SHIFT)) & ADC_ETC_TRIGn_RESULT_3_2_DATA3_MASK)

/* The count of ADC_ETC_TRIGn_RESULT_3_2 */
#define ADC_ETC_TRIGn_RESULT_3_2_COUNT           (8U)

/*! @name TRIGn_RESULT_5_4 - ETC_TRIG Result Data 5/4 Register */
#define ADC_ETC_TRIGn_RESULT_5_4_DATA4_MASK      (0xFFFU)
#define ADC_ETC_TRIGn_RESULT_5_4_DATA4_SHIFT     (0U)
#define ADC_ETC_TRIGn_RESULT_5_4_DATA4(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_5_4_DATA4_SHIFT)) & ADC_ETC_TRIGn_RESULT_5_4_DATA4_MASK)
#define ADC_ETC_TRIGn_RESULT_5_4_DATA5_MASK      (0xFFF0000U)
#define ADC_ETC_TRIGn_RESULT_5_4_DATA5_SHIFT     (16U)
#define ADC_ETC_TRIGn_RESULT_5_4_DATA5(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_5_4_DATA5_SHIFT)) & ADC_ETC_TRIGn_RESULT_5_4_DATA5_MASK)

/* The count of ADC_ETC_TRIGn_RESULT_5_4 */
#define ADC_ETC_TRIGn_RESULT_5_4_COUNT           (8U)

/*! @name TRIGn_RESULT_7_6 - ETC_TRIG Result Data 7/6 Register */
#define ADC_ETC_TRIGn_RESULT_7_6_DATA6_MASK      (0xFFFU)
#define ADC_ETC_TRIGn_RESULT_7_6_DATA6_SHIFT     (0U)
#define ADC_ETC_TRIGn_RESULT_7_6_DATA6(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_7_6_DATA6_SHIFT)) & ADC_ETC_TRIGn_RESULT_7_6_DATA6_MASK)
#define ADC_ETC_TRIGn_RESULT_7_6_DATA7_MASK      (0xFFF0000U)
#define ADC_ETC_TRIGn_RESULT_7_6_DATA7_SHIFT     (16U)
#define ADC_ETC_TRIGn_RESULT_7_6_DATA7(x)        (((uint32_t)(((uint32_t)(x)) << ADC_ETC_TRIGn_RESULT_7_6_DATA7_SHIFT)) & ADC_ETC_TRIGn_RESULT_7_6_DATA7_MASK)

/* The count of ADC_ETC_TRIGn_RESULT_7_6 */
#define ADC_ETC_TRIGn_RESULT_7_6_COUNT           (8U)


/*!
 * @}
 */ /* end of group ADC_ETC_Register_Masks */


/* ADC_ETC - Peripheral instance base addresses */
/** Peripheral ADC_ETC base pointer */
#define ADC_ETC_BASE_PTR                         ((ADC_ETC_MemMapPtr)0x403B0000u)
/** Array initializer of ADC_ETC peripheral base pointers */
#define ADC_ETC_BASE_PTRS                        { ADC_ETC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- ADC_ETC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_ETC_Register_Accessor_Macros ADC_ETC - Register accessor macros
 * @{
 */


/* ADC_ETC - Register instance definitions */
/* ADC_ETC */
#define ADC_ETC_CTRL                             ADC_ETC_CTRL_REG(ADC_ETC_BASE_PTR)
#define ADC_ETC_DONE0_1_IRQ                      ADC_ETC_DONE0_1_IRQ_REG(ADC_ETC_BASE_PTR)
#define ADC_ETC_DONE2_ERR_IRQ                    ADC_ETC_DONE2_ERR_IRQ_REG(ADC_ETC_BASE_PTR)
#define ADC_ETC_DMA_CTRL                         ADC_ETC_DMA_CTRL_REG(ADC_ETC_BASE_PTR)
#define ADC_ETC_TRIG0_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG0_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,0)
#define ADC_ETC_TRIG1_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG1_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,1)
#define ADC_ETC_TRIG2_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG2_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,2)
#define ADC_ETC_TRIG3_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG3_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,3)
#define ADC_ETC_TRIG4_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG4_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,4)
#define ADC_ETC_TRIG5_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG5_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,5)
#define ADC_ETC_TRIG6_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG6_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,6)
#define ADC_ETC_TRIG7_CTRL                       ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_COUNTER                    ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_CHAIN_1_0                  ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_CHAIN_3_2                  ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_CHAIN_5_4                  ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_CHAIN_7_6                  ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_RESULT_1_0                 ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_RESULT_3_2                 ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_RESULT_5_4                 ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,7)
#define ADC_ETC_TRIG7_RESULT_7_6                 ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,7)

