AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* ADC_ETC - Register array accessors */
#define ADC_ETC_TRIGn_CTRL(index)                ADC_ETC_TRIGn_CTRL_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_COUNTER(index)             ADC_ETC_TRIGn_COUNTER_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_CHAIN_1_0(index)           ADC_ETC_TRIGn_CHAIN_1_0_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_CHAIN_3_2(index)           ADC_ETC_TRIGn_CHAIN_3_2_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_CHAIN_5_4(index)           ADC_ETC_TRIGn_CHAIN_5_4_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_CHAIN_7_6(index)           ADC_ETC_TRIGn_CHAIN_7_6_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_RESULT_1_0(index)          ADC_ETC_TRIGn_RESULT_1_0_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_RESULT_3_2(index)          ADC_ETC_TRIGn_RESULT_3_2_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_RESULT_5_4(index)          ADC_ETC_TRIGn_RESULT_5_4_REG(ADC_ETC_BASE_PTR,index)
#define ADC_ETC_TRIGn_RESULT_7_6(index)          ADC_ETC_TRIGn_RESULT_7_6_REG(ADC_ETC_BASE_PTR,index)

/*!
 * @}
 */ /* end of group ADC_ETC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group ADC_ETC_Peripheral */


/* ----------------------------------------------------------------------------
   -- AIPSTZ
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPSTZ_Peripheral AIPSTZ
 * @{
 */

/** AIPSTZ - Peripheral register structure */
typedef struct AIPSTZ_MemMap {
  uint32_t MPR;                                    /**< Master Priviledge Registers, offset: 0x0 */
  uint8_t RESERVED_0[60];
  uint32_t OPACR;                                  /**< Off-Platform Peripheral Access Control Registers, offset: 0x40 */
  uint32_t OPACR1;                                 /**< Off-Platform Peripheral Access Control Registers, offset: 0x44 */
  uint32_t OPACR2;                                 /**< Off-Platform Peripheral Access Control Registers, offset: 0x48 */
  uint32_t OPACR3;                                 /**< Off-Platform Peripheral Access Control Registers, offset: 0x4C */
  uint32_t OPACR4;                                 /**< Off-Platform Peripheral Access Control Registers, offset: 0x50 */
} volatile *AIPSTZ_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- AIPSTZ - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPSTZ_Register_Accessor_Macros AIPSTZ - Register accessor macros
 * @{
 */


/* AIPSTZ - Register accessors */
#define AIPSTZ_MPR_REG(base)                     ((base)->MPR)
#define AIPSTZ_OPACR_REG(base)                   ((base)->OPACR)
#define AIPSTZ_OPACR1_REG(base)                  ((base)->OPACR1)
#define AIPSTZ_OPACR2_REG(base)                  ((base)->OPACR2)
#define AIPSTZ_OPACR3_REG(base)                  ((base)->OPACR3)
#define AIPSTZ_OPACR4_REG(base)                  ((base)->OPACR4)

/*!
 * @}
 */ /* end of group AIPSTZ_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- AIPSTZ Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPSTZ_Register_Masks AIPSTZ Register Masks
 * @{
 */

/*! @name MPR - Master Priviledge Registers */
#define AIPSTZ_MPR_MPROT5_MASK                   (0xF00U)
#define AIPSTZ_MPR_MPROT5_SHIFT                  (8U)
#define AIPSTZ_MPR_MPROT5(x)                     (((uint32_t)(((uint32_t)(x)) << AIPSTZ_MPR_MPROT5_SHIFT)) & AIPSTZ_MPR_MPROT5_MASK)
#define AIPSTZ_MPR_MPROT3_MASK                   (0xF0000U)
#define AIPSTZ_MPR_MPROT3_SHIFT                  (16U)
#define AIPSTZ_MPR_MPROT3(x)                     (((uint32_t)(((uint32_t)(x)) << AIPSTZ_MPR_MPROT3_SHIFT)) & AIPSTZ_MPR_MPROT3_MASK)
#define AIPSTZ_MPR_MPROT2_MASK                   (0xF00000U)
#define AIPSTZ_MPR_MPROT2_SHIFT                  (20U)
#define AIPSTZ_MPR_MPROT2(x)                     (((uint32_t)(((uint32_t)(x)) << AIPSTZ_MPR_MPROT2_SHIFT)) & AIPSTZ_MPR_MPROT2_MASK)
#define AIPSTZ_MPR_MPROT1_MASK                   (0xF000000U)
#define AIPSTZ_MPR_MPROT1_SHIFT                  (24U)
#define AIPSTZ_MPR_MPROT1(x)                     (((uint32_t)(((uint32_t)(x)) << AIPSTZ_MPR_MPROT1_SHIFT)) & AIPSTZ_MPR_MPROT1_MASK)
#define AIPSTZ_MPR_MPROT0_MASK                   (0xF0000000U)
#define AIPSTZ_MPR_MPROT0_SHIFT                  (28U)
#define AIPSTZ_MPR_MPROT0(x)                     (((uint32_t)(((uint32_t)(x)) << AIPSTZ_MPR_MPROT0_SHIFT)) & AIPSTZ_MPR_MPROT0_MASK)

/*! @name OPACR - Off-Platform Peripheral Access Control Registers */
#define AIPSTZ_OPACR_OPAC7_MASK                  (0xFU)
#define AIPSTZ_OPACR_OPAC7_SHIFT                 (0U)
#define AIPSTZ_OPACR_OPAC7(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC7_SHIFT)) & AIPSTZ_OPACR_OPAC7_MASK)
#define AIPSTZ_OPACR_OPAC6_MASK                  (0xF0U)
#define AIPSTZ_OPACR_OPAC6_SHIFT                 (4U)
#define AIPSTZ_OPACR_OPAC6(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC6_SHIFT)) & AIPSTZ_OPACR_OPAC6_MASK)
#define AIPSTZ_OPACR_OPAC5_MASK                  (0xF00U)
#define AIPSTZ_OPACR_OPAC5_SHIFT                 (8U)
#define AIPSTZ_OPACR_OPAC5(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC5_SHIFT)) & AIPSTZ_OPACR_OPAC5_MASK)
#define AIPSTZ_OPACR_OPAC4_MASK                  (0xF000U)
#define AIPSTZ_OPACR_OPAC4_SHIFT                 (12U)
#define AIPSTZ_OPACR_OPAC4(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC4_SHIFT)) & AIPSTZ_OPACR_OPAC4_MASK)
#define AIPSTZ_OPACR_OPAC3_MASK                  (0xF0000U)
#define AIPSTZ_OPACR_OPAC3_SHIFT                 (16U)
#define AIPSTZ_OPACR_OPAC3(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC3_SHIFT)) & AIPSTZ_OPACR_OPAC3_MASK)
#define AIPSTZ_OPACR_OPAC2_MASK                  (0xF00000U)
#define AIPSTZ_OPACR_OPAC2_SHIFT                 (20U)
#define AIPSTZ_OPACR_OPAC2(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC2_SHIFT)) & AIPSTZ_OPACR_OPAC2_MASK)
#define AIPSTZ_OPACR_OPAC1_MASK                  (0xF000000U)
#define AIPSTZ_OPACR_OPAC1_SHIFT                 (24U)
#define AIPSTZ_OPACR_OPAC1(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC1_SHIFT)) & AIPSTZ_OPACR_OPAC1_MASK)
#define AIPSTZ_OPACR_OPAC0_MASK                  (0xF0000000U)
#define AIPSTZ_OPACR_OPAC0_SHIFT                 (28U)
#define AIPSTZ_OPACR_OPAC0(x)                    (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR_OPAC0_SHIFT)) & AIPSTZ_OPACR_OPAC0_MASK)

/*! @name OPACR1 - Off-Platform Peripheral Access Control Registers */
#define AIPSTZ_OPACR1_OPAC15_MASK                (0xFU)
#define AIPSTZ_OPACR1_OPAC15_SHIFT               (0U)
#define AIPSTZ_OPACR1_OPAC15(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC15_SHIFT)) & AIPSTZ_OPACR1_OPAC15_MASK)
#define AIPSTZ_OPACR1_OPAC14_MASK                (0xF0U)
#define AIPSTZ_OPACR1_OPAC14_SHIFT               (4U)
#define AIPSTZ_OPACR1_OPAC14(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC14_SHIFT)) & AIPSTZ_OPACR1_OPAC14_MASK)
#define AIPSTZ_OPACR1_OPAC13_MASK                (0xF00U)
#define AIPSTZ_OPACR1_OPAC13_SHIFT               (8U)
#define AIPSTZ_OPACR1_OPAC13(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC13_SHIFT)) & AIPSTZ_OPACR1_OPAC13_MASK)
#define AIPSTZ_OPACR1_OPAC12_MASK                (0xF000U)
#define AIPSTZ_OPACR1_OPAC12_SHIFT               (12U)
#define AIPSTZ_OPACR1_OPAC12(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC12_SHIFT)) & AIPSTZ_OPACR1_OPAC12_MASK)
#define AIPSTZ_OPACR1_OPAC11_MASK                (0xF0000U)
#define AIPSTZ_OPACR1_OPAC11_SHIFT               (16U)
#define AIPSTZ_OPACR1_OPAC11(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC11_SHIFT)) & AIPSTZ_OPACR1_OPAC11_MASK)
#define AIPSTZ_OPACR1_OPAC10_MASK                (0xF00000U)
#define AIPSTZ_OPACR1_OPAC10_SHIFT               (20U)
#define AIPSTZ_OPACR1_OPAC10(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC10_SHIFT)) & AIPSTZ_OPACR1_OPAC10_MASK)
#define AIPSTZ_OPACR1_OPAC9_MASK                 (0xF000000U)
#define AIPSTZ_OPACR1_OPAC9_SHIFT                (24U)
#define AIPSTZ_OPACR1_OPAC9(x)                   (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC9_SHIFT)) & AIPSTZ_OPACR1_OPAC9_MASK)
#define AIPSTZ_OPACR1_OPAC8_MASK                 (0xF0000000U)
#define AIPSTZ_OPACR1_OPAC8_SHIFT                (28U)
#define AIPSTZ_OPACR1_OPAC8(x)                   (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR1_OPAC8_SHIFT)) & AIPSTZ_OPACR1_OPAC8_MASK)

/*! @name OPACR2 - Off-Platform Peripheral Access Control Registers */
#define AIPSTZ_OPACR2_OPAC23_MASK                (0xFU)
#define AIPSTZ_OPACR2_OPAC23_SHIFT               (0U)
#define AIPSTZ_OPACR2_OPAC23(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC23_SHIFT)) & AIPSTZ_OPACR2_OPAC23_MASK)
#define AIPSTZ_OPACR2_OPAC22_MASK                (0xF0U)
#define AIPSTZ_OPACR2_OPAC22_SHIFT               (4U)
#define AIPSTZ_OPACR2_OPAC22(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC22_SHIFT)) & AIPSTZ_OPACR2_OPAC22_MASK)
#define AIPSTZ_OPACR2_OPAC21_MASK                (0xF00U)
#define AIPSTZ_OPACR2_OPAC21_SHIFT               (8U)
#define AIPSTZ_OPACR2_OPAC21(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC21_SHIFT)) & AIPSTZ_OPACR2_OPAC21_MASK)
#define AIPSTZ_OPACR2_OPAC20_MASK                (0xF000U)
#define AIPSTZ_OPACR2_OPAC20_SHIFT               (12U)
#define AIPSTZ_OPACR2_OPAC20(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC20_SHIFT)) & AIPSTZ_OPACR2_OPAC20_MASK)
#define AIPSTZ_OPACR2_OPAC19_MASK                (0xF0000U)
#define AIPSTZ_OPACR2_OPAC19_SHIFT               (16U)
#define AIPSTZ_OPACR2_OPAC19(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC19_SHIFT)) & AIPSTZ_OPACR2_OPAC19_MASK)
#define AIPSTZ_OPACR2_OPAC18_MASK                (0xF00000U)
#define AIPSTZ_OPACR2_OPAC18_SHIFT               (20U)
#define AIPSTZ_OPACR2_OPAC18(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC18_SHIFT)) & AIPSTZ_OPACR2_OPAC18_MASK)
#define AIPSTZ_OPACR2_OPAC17_MASK                (0xF000000U)
#define AIPSTZ_OPACR2_OPAC17_SHIFT               (24U)
#define AIPSTZ_OPACR2_OPAC17(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC17_SHIFT)) & AIPSTZ_OPACR2_OPAC17_MASK)
#define AIPSTZ_OPACR2_OPAC16_MASK                (0xF0000000U)
#define AIPSTZ_OPACR2_OPAC16_SHIFT               (28U)
#define AIPSTZ_OPACR2_OPAC16(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR2_OPAC16_SHIFT)) & AIPSTZ_OPACR2_OPAC16_MASK)

/*! @name OPACR3 - Off-Platform Peripheral Access Control Registers */
#define AIPSTZ_OPACR3_OPAC31_MASK                (0xFU)
#define AIPSTZ_OPACR3_OPAC31_SHIFT               (0U)
#define AIPSTZ_OPACR3_OPAC31(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC31_SHIFT)) & AIPSTZ_OPACR3_OPAC31_MASK)
#define AIPSTZ_OPACR3_OPAC30_MASK                (0xF0U)
#define AIPSTZ_OPACR3_OPAC30_SHIFT               (4U)
#define AIPSTZ_OPACR3_OPAC30(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC30_SHIFT)) & AIPSTZ_OPACR3_OPAC30_MASK)
#define AIPSTZ_OPACR3_OPAC29_MASK                (0xF00U)
#define AIPSTZ_OPACR3_OPAC29_SHIFT               (8U)
#define AIPSTZ_OPACR3_OPAC29(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC29_SHIFT)) & AIPSTZ_OPACR3_OPAC29_MASK)
#define AIPSTZ_OPACR3_OPAC28_MASK                (0xF000U)
#define AIPSTZ_OPACR3_OPAC28_SHIFT               (12U)
#define AIPSTZ_OPACR3_OPAC28(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC28_SHIFT)) & AIPSTZ_OPACR3_OPAC28_MASK)
#define AIPSTZ_OPACR3_OPAC27_MASK                (0xF0000U)
#define AIPSTZ_OPACR3_OPAC27_SHIFT               (16U)
#define AIPSTZ_OPACR3_OPAC27(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC27_SHIFT)) & AIPSTZ_OPACR3_OPAC27_MASK)
#define AIPSTZ_OPACR3_OPAC26_MASK                (0xF00000U)
#define AIPSTZ_OPACR3_OPAC26_SHIFT               (20U)
#define AIPSTZ_OPACR3_OPAC26(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC26_SHIFT)) & AIPSTZ_OPACR3_OPAC26_MASK)
#define AIPSTZ_OPACR3_OPAC25_MASK                (0xF000000U)
#define AIPSTZ_OPACR3_OPAC25_SHIFT               (24U)
#define AIPSTZ_OPACR3_OPAC25(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC25_SHIFT)) & AIPSTZ_OPACR3_OPAC25_MASK)
#define AIPSTZ_OPACR3_OPAC24_MASK                (0xF0000000U)
#define AIPSTZ_OPACR3_OPAC24_SHIFT               (28U)
#define AIPSTZ_OPACR3_OPAC24(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR3_OPAC24_SHIFT)) & AIPSTZ_OPACR3_OPAC24_MASK)

/*! @name OPACR4 - Off-Platform Peripheral Access Control Registers */
#define AIPSTZ_OPACR4_OPAC33_MASK                (0xF000000U)
#define AIPSTZ_OPACR4_OPAC33_SHIFT               (24U)
#define AIPSTZ_OPACR4_OPAC33(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR4_OPAC33_SHIFT)) & AIPSTZ_OPACR4_OPAC33_MASK)
#define AIPSTZ_OPACR4_OPAC32_MASK                (0xF0000000U)
#define AIPSTZ_OPACR4_OPAC32_SHIFT               (28U)
#define AIPSTZ_OPACR4_OPAC32(x)                  (((uint32_t)(((uint32_t)(x)) << AIPSTZ_OPACR4_OPAC32_SHIFT)) & AIPSTZ_OPACR4_OPAC32_MASK)


/*!
 * @}
 */ /* end of group AIPSTZ_Register_Masks */


/* AIPSTZ - Peripheral instance base addresses */
/** Peripheral AIPSTZ1 base pointer */
#define AIPSTZ1_BASE_PTR                         ((AIPSTZ_MemMapPtr)0x4007C000u)
/** Peripheral AIPSTZ2 base pointer */
#define AIPSTZ2_BASE_PTR                         ((AIPSTZ_MemMapPtr)0x4017C000u)
/** Peripheral AIPSTZ3 base pointer */
#define AIPSTZ3_BASE_PTR                         ((AIPSTZ_MemMapPtr)0x4027C000u)
/** Peripheral AIPSTZ4 base pointer */
#define AIPSTZ4_BASE_PTR                         ((AIPSTZ_MemMapPtr)0x4037C000u)
/** Array initializer of AIPSTZ peripheral base pointers */
#define AIPSTZ_BASE_PTRS                         { AIPSTZ1_BASE_PTR, AIPSTZ2_BASE_PTR, AIPSTZ3_BASE_PTR, AIPSTZ4_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- AIPSTZ - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPSTZ_Register_Accessor_Macros AIPSTZ - Register accessor macros
 * @{
 */


/* AIPSTZ - Register instance definitions */
/* AIPSTZ1 */
#define AIPSTZ1_MPR                              AIPSTZ_MPR_REG(AIPSTZ1_BASE_PTR)
#define AIPSTZ1_OPACR                            AIPSTZ_OPACR_REG(AIPSTZ1_BASE_PTR)
#define AIPSTZ1_OPACR1                           AIPSTZ_OPACR1_REG(AIPSTZ1_BASE_PTR)
#define AIPSTZ1_OPACR2                           AIPSTZ_OPACR2_REG(AIPSTZ1_BASE_PTR)
#define AIPSTZ1_OPACR3                           AIPSTZ_OPACR3_REG(AIPSTZ1_BASE_PTR)
#define AIPSTZ1_OPACR4                           AIPSTZ_OPACR4_REG(AIPSTZ1_BASE_PTR)
/* AIPSTZ2 */
#define AIPSTZ2_MPR                              AIPSTZ_MPR_REG(AIPSTZ2_BASE_PTR)
#define AIPSTZ2_OPACR                            AIPSTZ_OPACR_REG(AIPSTZ2_BASE_PTR)
#define AIPSTZ2_OPACR1                           AIPSTZ_OPACR1_REG(AIPSTZ2_BASE_PTR)
#define AIPSTZ2_OPACR2                           AIPSTZ_OPACR2_REG(AIPSTZ2_BASE_PTR)
#define AIPSTZ2_OPACR3                           AIPSTZ_OPACR3_REG(AIPSTZ2_BASE_PTR)
#define AIPSTZ2_OPACR4                           AIPSTZ_OPACR4_REG(AIPSTZ2_BASE_PTR)
/* AIPSTZ3 */
#define AIPSTZ3_MPR                              AIPSTZ_MPR_REG(AIPSTZ3_BASE_PTR)
#define AIPSTZ3_OPACR                            AIPSTZ_OPACR_REG(AIPSTZ3_BASE_PTR)
#define AIPSTZ3_OPACR1                           AIPSTZ_OPACR1_REG(AIPSTZ3_BASE_PTR)
#define AIPSTZ3_OPACR2                           AIPSTZ_OPACR2_REG(AIPSTZ3_BASE_PTR)
#define AIPSTZ3_OPACR3                           AIPSTZ_OPACR3_REG(AIPSTZ3_BASE_PTR)
#define AIPSTZ3_OPACR4                           AIPSTZ_OPACR4_REG(AIPSTZ3_BASE_PTR)
/* AIPSTZ4 */
#define AIPSTZ4_MPR                              AIPSTZ_MPR_REG(AIPSTZ4_BASE_PTR)
#define AIPSTZ4_OPACR                            AIPSTZ_OPACR_REG(AIPSTZ4_BASE_PTR)
#define AIPSTZ4_OPACR1                           AIPSTZ_OPACR1_REG(AIPSTZ4_BASE_PTR)
#define AIPSTZ4_OPACR2                           AIPSTZ_OPACR2_REG(AIPSTZ4_BASE_PTR)
#define AIPSTZ4_OPACR3                           AIPSTZ_OPACR3_REG(AIPSTZ4_BASE_PTR)
#define AIPSTZ4_OPACR4                           AIPSTZ_OPACR4_REG(AIPSTZ4_BASE_PTR)

/*!
 * @}
 */ /* end of group AIPSTZ_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group AIPSTZ_Peripheral */


/* ----------------------------------------------------------------------------
   -- AOI
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AOI_Peripheral AOI
 * @{
 */

/** AOI - Peripheral register structure */
typedef struct AOI_MemMap {
  struct {                                         /* offset: 0x0, array step: 0x4 */
    uint16_t BFCRT01;                                /**< Boolean Function Term 0 and 1 Configuration Register for EVENTn, array offset: 0x0, array step: 0x4 */
    uint16_t BFCRT23;                                /**< Boolean Function Term 2 and 3 Configuration Register for EVENTn, array offset: 0x2, array step: 0x4 */
  } BFCRT[4];
} volatile *AOI_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- AOI - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AOI_Register_Accessor_Macros AOI - Register accessor macros
 * @{
 */


