AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name WORD0 - Message Buffer 0 WORD0 Register..Message Buffer 63 WORD0 Register */
#define CAN_WORD0_DATA_BYTE_3_MASK               (0xFFU)
#define CAN_WORD0_DATA_BYTE_3_SHIFT              (0U)
#define CAN_WORD0_DATA_BYTE_3(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD0_DATA_BYTE_3_SHIFT)) & CAN_WORD0_DATA_BYTE_3_MASK)
#define CAN_WORD0_DATA_BYTE_2_MASK               (0xFF00U)
#define CAN_WORD0_DATA_BYTE_2_SHIFT              (8U)
#define CAN_WORD0_DATA_BYTE_2(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD0_DATA_BYTE_2_SHIFT)) & CAN_WORD0_DATA_BYTE_2_MASK)
#define CAN_WORD0_DATA_BYTE_1_MASK               (0xFF0000U)
#define CAN_WORD0_DATA_BYTE_1_SHIFT              (16U)
#define CAN_WORD0_DATA_BYTE_1(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD0_DATA_BYTE_1_SHIFT)) & CAN_WORD0_DATA_BYTE_1_MASK)
#define CAN_WORD0_DATA_BYTE_0_MASK               (0xFF000000U)
#define CAN_WORD0_DATA_BYTE_0_SHIFT              (24U)
#define CAN_WORD0_DATA_BYTE_0(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD0_DATA_BYTE_0_SHIFT)) & CAN_WORD0_DATA_BYTE_0_MASK)

/* The count of CAN_WORD0 */
#define CAN_WORD0_COUNT                          (64U)

/*! @name WORD1 - Message Buffer 0 WORD1 Register..Message Buffer 63 WORD1 Register */
#define CAN_WORD1_DATA_BYTE_7_MASK               (0xFFU)
#define CAN_WORD1_DATA_BYTE_7_SHIFT              (0U)
#define CAN_WORD1_DATA_BYTE_7(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD1_DATA_BYTE_7_SHIFT)) & CAN_WORD1_DATA_BYTE_7_MASK)
#define CAN_WORD1_DATA_BYTE_6_MASK               (0xFF00U)
#define CAN_WORD1_DATA_BYTE_6_SHIFT              (8U)
#define CAN_WORD1_DATA_BYTE_6(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD1_DATA_BYTE_6_SHIFT)) & CAN_WORD1_DATA_BYTE_6_MASK)
#define CAN_WORD1_DATA_BYTE_5_MASK               (0xFF0000U)
#define CAN_WORD1_DATA_BYTE_5_SHIFT              (16U)
#define CAN_WORD1_DATA_BYTE_5(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD1_DATA_BYTE_5_SHIFT)) & CAN_WORD1_DATA_BYTE_5_MASK)
#define CAN_WORD1_DATA_BYTE_4_MASK               (0xFF000000U)
#define CAN_WORD1_DATA_BYTE_4_SHIFT              (24U)
#define CAN_WORD1_DATA_BYTE_4(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_WORD1_DATA_BYTE_4_SHIFT)) & CAN_WORD1_DATA_BYTE_4_MASK)

/* The count of CAN_WORD1 */
#define CAN_WORD1_COUNT                          (64U)

/*! @name RXIMR - Rx Individual Mask Registers */
#define CAN_RXIMR_MI_MASK                        (0xFFFFFFFFU)
#define CAN_RXIMR_MI_SHIFT                       (0U)
#define CAN_RXIMR_MI(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_RXIMR_MI_SHIFT)) & CAN_RXIMR_MI_MASK)

/* The count of CAN_RXIMR */
#define CAN_RXIMR_COUNT                          (64U)

/*! @name GFWR - Glitch Filter Width Registers */
#define CAN_GFWR_GFWR_MASK                       (0xFFU)
#define CAN_GFWR_GFWR_SHIFT                      (0U)
#define CAN_GFWR_GFWR(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_GFWR_GFWR_SHIFT)) & CAN_GFWR_GFWR_MASK)


/*!
 * @}
 */ /* end of group CAN_Register_Masks */


/* CAN - Peripheral instance base addresses */
/** Peripheral CAN1 base pointer */
#define CAN1_BASE_PTR                            ((CAN_MemMapPtr)0x401D0000u)
/** Peripheral CAN2 base pointer */
#define CAN2_BASE_PTR                            ((CAN_MemMapPtr)0x401D4000u)
/** Array initializer of CAN peripheral base pointers */
#define CAN_BASE_PTRS                            { CAN1_BASE_PTR, CAN2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- CAN - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Register_Accessor_Macros CAN - Register accessor macros
 * @{
 */


/* CAN - Register instance definitions */
/* CAN1 */
#define FLEXCAN1_MCR                             CAN_MCR_REG(CAN1_BASE_PTR)
#define FLEXCAN1_CTRL1                           CAN_CTRL1_REG(CAN1_BASE_PTR)
#define FLEXCAN1_TIMER                           CAN_TIMER_REG(CAN1_BASE_PTR)
#define FLEXCAN1_RXMGMASK                        CAN_RXMGMASK_REG(CAN1_BASE_PTR)
#define FLEXCAN1_RX14MASK                        CAN_RX14MASK_REG(CAN1_BASE_PTR)
#define FLEXCAN1_RX15MASK                        CAN_RX15MASK_REG(CAN1_BASE_PTR)
#define FLEXCAN1_ECR                             CAN_ECR_REG(CAN1_BASE_PTR)
#define FLEXCAN1_ESR1                            CAN_ESR1_REG(CAN1_BASE_PTR)
#define FLEXCAN1_IMASK2                          CAN_IMASK2_REG(CAN1_BASE_PTR)
#define FLEXCAN1_IMASK1                          CAN_IMASK1_REG(CAN1_BASE_PTR)
#define FLEXCAN1_IFLAG2                          CAN_IFLAG2_REG(CAN1_BASE_PTR)
#define FLEXCAN1_IFLAG1                          CAN_IFLAG1_REG(CAN1_BASE_PTR)
#define FLEXCAN1_CTRL2                           CAN_CTRL2_REG(CAN1_BASE_PTR)
#define FLEXCAN1_ESR2                            CAN_ESR2_REG(CAN1_BASE_PTR)
#define FLEXCAN1_CRCR                            CAN_CRCR_REG(CAN1_BASE_PTR)
#define FLEXCAN1_RXFGMASK                        CAN_RXFGMASK_REG(CAN1_BASE_PTR)
#define FLEXCAN1_RXFIR                           CAN_RXFIR_REG(CAN1_BASE_PTR)
#define FLEXCAN1_CS0                             CAN_CS_REG(CAN1_BASE_PTR,0)
#define FLEXCAN1_ID0                             CAN_ID_REG(CAN1_BASE_PTR,0)
#define FLEXCAN1_WORD00                          CAN_WORD0_REG(CAN1_BASE_PTR,0)
#define FLEXCAN1_WORD10                          CAN_WORD1_REG(CAN1_BASE_PTR,0)
#define FLEXCAN1_CS1                             CAN_CS_REG(CAN1_BASE_PTR,1)
#define FLEXCAN1_ID1                             CAN_ID_REG(CAN1_BASE_PTR,1)
#define FLEXCAN1_WORD01                          CAN_WORD0_REG(CAN1_BASE_PTR,1)
#define FLEXCAN1_WORD11                          CAN_WORD1_REG(CAN1_BASE_PTR,1)
#define FLEXCAN1_CS2                             CAN_CS_REG(CAN1_BASE_PTR,2)
#define FLEXCAN1_ID2                             CAN_ID_REG(CAN1_BASE_PTR,2)
#define FLEXCAN1_WORD02                          CAN_WORD0_REG(CAN1_BASE_PTR,2)
#define FLEXCAN1_WORD12                          CAN_WORD1_REG(CAN1_BASE_PTR,2)
#define FLEXCAN1_CS3                             CAN_CS_REG(CAN1_BASE_PTR,3)
#define FLEXCAN1_ID3                             CAN_ID_REG(CAN1_BASE_PTR,3)
#define FLEXCAN1_WORD03                          CAN_WORD0_REG(CAN1_BASE_PTR,3)
#define FLEXCAN1_WORD13                          CAN_WORD1_REG(CAN1_BASE_PTR,3)
#define FLEXCAN1_CS4                             CAN_CS_REG(CAN1_BASE_PTR,4)
#define FLEXCAN1_ID4                             CAN_ID_REG(CAN1_BASE_PTR,4)
#define FLEXCAN1_WORD04                          CAN_WORD0_REG(CAN1_BASE_PTR,4)
#define FLEXCAN1_WORD14                          CAN_WORD1_REG(CAN1_BASE_PTR,4)
#define FLEXCAN1_CS5                             CAN_CS_REG(CAN1_BASE_PTR,5)
#define FLEXCAN1_ID5                             CAN_ID_REG(CAN1_BASE_PTR,5)
#define FLEXCAN1_WORD05                          CAN_WORD0_REG(CAN1_BASE_PTR,5)
#define FLEXCAN1_WORD15                          CAN_WORD1_REG(CAN1_BASE_PTR,5)
#define FLEXCAN1_CS6                             CAN_CS_REG(CAN1_BASE_PTR,6)
#define FLEXCAN1_ID6                             CAN_ID_REG(CAN1_BASE_PTR,6)
#define FLEXCAN1_WORD06                          CAN_WORD0_REG(CAN1_BASE_PTR,6)
#define FLEXCAN1_WORD16                          CAN_WORD1_REG(CAN1_BASE_PTR,6)
#define FLEXCAN1_CS7                             CAN_CS_REG(CAN1_BASE_PTR,7)
#define FLEXCAN1_ID7                             CAN_ID_REG(CAN1_BASE_PTR,7)
#define FLEXCAN1_WORD07                          CAN_WORD0_REG(CAN1_BASE_PTR,7)
#define FLEXCAN1_WORD17                          CAN_WORD1_REG(CAN1_BASE_PTR,7)
#define FLEXCAN1_CS8                             CAN_CS_REG(CAN1_BASE_PTR,8)
#define FLEXCAN1_ID8                             CAN_ID_REG(CAN1_BASE_PTR,8)
#define FLEXCAN1_WORD08                          CAN_WORD0_REG(CAN1_BASE_PTR,8)
#define FLEXCAN1_WORD18                          CAN_WORD1_REG(CAN1_BASE_PTR,8)
#define FLEXCAN1_CS9                             CAN_CS_REG(CAN1_BASE_PTR,9)
#define FLEXCAN1_ID9                             CAN_ID_REG(CAN1_BASE_PTR,9)
#define FLEXCAN1_WORD09                          CAN_WORD0_REG(CAN1_BASE_PTR,9)
#define FLEXCAN1_WORD19                          CAN_WORD1_REG(CAN1_BASE_PTR,9)
#define FLEXCAN1_CS10                            CAN_CS_REG(CAN1_BASE_PTR,10)
#define FLEXCAN1_ID10                            CAN_ID_REG(CAN1_BASE_PTR,10)
#define FLEXCAN1_WORD010                         CAN_WORD0_REG(CAN1_BASE_PTR,10)
#define FLEXCAN1_WORD110                         CAN_WORD1_REG(CAN1_BASE_PTR,10)
#define FLEXCAN1_CS11                            CAN_CS_REG(CAN1_BASE_PTR,11)
#define FLEXCAN1_ID11                            CAN_ID_REG(CAN1_BASE_PTR,11)
#define FLEXCAN1_WORD011                         CAN_WORD0_REG(CAN1_BASE_PTR,11)
#define FLEXCAN1_WORD111                         CAN_WORD1_REG(CAN1_BASE_PTR,11)
#define FLEXCAN1_CS12                            CAN_CS_REG(CAN1_BASE_PTR,12)
#define FLEXCAN1_ID12                            CAN_ID_REG(CAN1_BASE_PTR,12)
#define FLEXCAN1_WORD012                         CAN_WORD0_REG(CAN1_BASE_PTR,12)
#define FLEXCAN1_WORD112                         CAN_WORD1_REG(CAN1_BASE_PTR,12)
#define FLEXCAN1_CS13                            CAN_CS_REG(CAN1_BASE_PTR,13)
#define FLEXCAN1_ID13                            CAN_ID_REG(CAN1_BASE_PTR,13)
#define FLEXCAN1_WORD013                         CAN_WORD0_REG(CAN1_BASE_PTR,13)
#define FLEXCAN1_WORD113                         CAN_WORD1_REG(CAN1_BASE_PTR,13)
#define FLEXCAN1_CS14                            CAN_CS_REG(CAN1_BASE_PTR,14)
#define FLEXCAN1_ID14                            CAN_ID_REG(CAN1_BASE_PTR,14)
#define FLEXCAN1_WORD014                         CAN_WORD0_REG(CAN1_BASE_PTR,14)
#define FLEXCAN1_WORD114                         CAN_WORD1_REG(CAN1_BASE_PTR,14)
#define FLEXCAN1_CS15                            CAN_CS_REG(CAN1_BASE_PTR,15)
#define FLEXCAN1_ID15                            CAN_ID_REG(CAN1_BASE_PTR,15)
#define FLEXCAN1_WORD015                         CAN_WORD0_REG(CAN1_BASE_PTR,15)
#define FLEXCAN1_WORD115                         CAN_WORD1_REG(CAN1_BASE_PTR,15)
#define FLEXCAN1_CS16                            CAN_CS_REG(CAN1_BASE_PTR,16)
#define FLEXCAN1_ID16                            CAN_ID_REG(CAN1_BASE_PTR,16)
#define FLEXCAN1_WORD016                         CAN_WORD0_REG(CAN1_BASE_PTR,16)
#define FLEXCAN1_WORD116                         CAN_WORD1_REG(CAN1_BASE_PTR,16)
#define FLEXCAN1_CS17                            CAN_CS_REG(CAN1_BASE_PTR,17)
#define FLEXCAN1_ID17                            CAN_ID_REG(CAN1_BASE_PTR,17)
#define FLEXCAN1_WORD017                         CAN_WORD0_REG(CAN1_BASE_PTR,17)
#define FLEXCAN1_WORD117                         CAN_WORD1_REG(CAN1_BASE_PTR,17)
#define FLEXCAN1_CS18                            CAN_CS_REG(CAN1_BASE_PTR,18)
#define FLEXCAN1_ID18                            CAN_ID_REG(CAN1_BASE_PTR,18)
#define FLEXCAN1_WORD018                         CAN_WORD0_REG(CAN1_BASE_PTR,18)
#define FLEXCAN1_WORD118                         CAN_WORD1_REG(CAN1_BASE_PTR,18)
#define FLEXCAN1_CS19                            CAN_CS_REG(CAN1_BASE_PTR,19)
#define FLEXCAN1_ID19                            CAN_ID_REG(CAN1_BASE_PTR,19)
#define FLEXCAN1_WORD019                         CAN_WORD0_REG(CAN1_BASE_PTR,19)
#define FLEXCAN1_WORD119                         CAN_WORD1_REG(CAN1_BASE_PTR,19)
#define FLEXCAN1_CS20                            CAN_CS_REG(CAN1_BASE_PTR,20)
#define FLEXCAN1_ID20                            CAN_ID_REG(CAN1_BASE_PTR,20)
#define FLEXCAN1_WORD020                         CAN_WORD0_REG(CAN1_BASE_PTR,20)
#define FLEXCAN1_WORD120                         CAN_WORD1_REG(CAN1_BASE_PTR,20)
#define FLEXCAN1_CS21                            CAN_CS_REG(CAN1_BASE_PTR,21)
#define FLEXCAN1_ID21                            CAN_ID_REG(CAN1_BASE_PTR,21)
#define FLEXCAN1_WORD021                         CAN_WORD0_REG(CAN1_BASE_PTR,21)
#define FLEXCAN1_WORD121                         CAN_WORD1_REG(CAN1_BASE_PTR,21)
#define FLEXCAN1_CS22                            CAN_CS_REG(CAN1_BASE_PTR,22)
#define FLEXCAN1_ID22                            CAN_ID_REG(CAN1_BASE_PTR,22)
#define FLEXCAN1_WORD022                         CAN_WORD0_REG(CAN1_BASE_PTR,22)
#define FLEXCAN1_WORD122                         CAN_WORD1_REG(CAN1_BASE_PTR,22)
#define FLEXCAN1_CS23                            CAN_CS_REG(CAN1_BASE_PTR,23)
#define FLEXCAN1_ID23                            CAN_ID_REG(CAN1_BASE_PTR,23)
#define FLEXCAN1_WORD023                         CAN_WORD0_REG(CAN1_BASE_PTR,23)
#define FLEXCAN1_WORD123                         CAN_WORD1_REG(CAN1_BASE_PTR,23)
#define FLEXCAN1_CS24                            CAN_CS_REG(CAN1_BASE_PTR,24)
#define FLEXCAN1_ID24                            CAN_ID_REG(CAN1_BASE_PTR,24)
#define FLEXCAN1_WORD024                         CAN_WORD0_REG(CAN1_BASE_PTR,24)
#define FLEXCAN1_WORD124                         CAN_WORD1_REG(CAN1_BASE_PTR,24)
#define FLEXCAN1_CS25                            CAN_CS_REG(CAN1_BASE_PTR,25)
#define FLEXCAN1_ID25                            CAN_ID_REG(CAN1_BASE_PTR,25)
#define FLEXCAN1_WORD025                         CAN_WORD0_REG(CAN1_BASE_PTR,25)
#define FLEXCAN1_WORD125                         CAN_WORD1_REG(CAN1_BASE_PTR,25)
#define FLEXCAN1_CS26                            CAN_CS_REG(CAN1_BASE_PTR,26)
#define FLEXCAN1_ID26                            CAN_ID_REG(CAN1_BASE_PTR,26)
#define FLEXCAN1_WORD026                         CAN_WORD0_REG(CAN1_BASE_PTR,26)
#define FLEXCAN1_WORD126                         CAN_WORD1_REG(CAN1_BASE_PTR,26)
#define FLEXCAN1_CS27                            CAN_CS_REG(CAN1_BASE_PTR,27)
#define FLEXCAN1_ID27                            CAN_ID_REG(CAN1_BASE_PTR,27)
#define FLEXCAN1_WORD027                         CAN_WORD0_REG(CAN1_BASE_PTR,27)
#define FLEXCAN1_WORD127                         CAN_WORD1_REG(CAN1_BASE_PTR,27)
#define FLEXCAN1_CS28                            CAN_CS_REG(CAN1_BASE_PTR,28)
#define FLEXCAN1_ID28                            CAN_ID_REG(CAN1_BASE_PTR,28)
#define FLEXCAN1_WORD028                         CAN_WORD0_REG(CAN1_BASE_PTR,28)
#define FLEXCAN1_WORD128                         CAN_WORD1_REG(CAN1_BASE_PTR,28)
#define FLEXCAN1_CS29                            CAN_CS_REG(CAN1_BASE_PTR,29)
#define FLEXCAN1_ID29                            CAN_ID_REG(CAN1_BASE_PTR,29)
#define FLEXCAN1_WORD029                         CAN_WORD0_REG(CAN1_BASE_PTR,29)
#define FLEXCAN1_WORD129                         CAN_WORD1_REG(CAN1_BASE_PTR,29)
#define FLEXCAN1_CS30                            CAN_CS_REG(CAN1_BASE_PTR,30)
#define FLEXCAN1_ID30                            CAN_ID_REG(CAN1_BASE_PTR,30)
#define FLEXCAN1_WORD030                         CAN_WORD0_REG(CAN1_BASE_PTR,30)
#define FLEXCAN1_WORD130                         CAN_WORD1_REG(CAN1_BASE_PTR,30)
#define FLEXCAN1_CS31                            CAN_CS_REG(CAN1_BASE_PTR,31)
#define FLEXCAN1_ID31                            CAN_ID_REG(CAN1_BASE_PTR,31)
#define FLEXCAN1_WORD031                         CAN_WORD0_REG(CAN1_BASE_PTR,31)
#define FLEXCAN1_WORD131                         CAN_WORD1_REG(CAN1_BASE_PTR,31)
#define FLEXCAN1_CS32                            CAN_CS_REG(CAN1_BASE_PTR,32)
#define FLEXCAN1_ID32                            CAN_ID_REG(CAN1_BASE_PTR,32)
#define FLEXCAN1_WORD032                         CAN_WORD0_REG(CAN1_BASE_PTR,32)
#define FLEXCAN1_WORD132                         CAN_WORD1_REG(CAN1_BASE_PTR,32)
#define FLEXCAN1_CS33                            CAN_CS_REG(CAN1_BASE_PTR,33)
#define FLEXCAN1_ID33                            CAN_ID_REG(CAN1_BASE_PTR,33)
#define FLEXCAN1_WORD033                         CAN_WORD0_REG(CAN1_BASE_PTR,33)
#define FLEXCAN1_WORD133                         CAN_WORD1_REG(CAN1_BASE_PTR,33)
#define FLEXCAN1_CS34                            CAN_CS_REG(CAN1_BASE_PTR,34)
#define FLEXCAN1_ID34                            CAN_ID_REG(CAN1_BASE_PTR,34)
#define FLEXCAN1_WORD034                         CAN_WORD0_REG(CAN1_BASE_PTR,34)
#define FLEXCAN1_WORD134                         CAN_WORD1_REG(CAN1_BASE_PTR,34)
#define FLEXCAN1_CS35                            CAN_CS_REG(CAN1_BASE_PTR,35)
#define FLEXCAN1_ID35                            CAN_ID_REG(CAN1_BASE_PTR,35)
#define FLEXCAN1_WORD035                         CAN_WORD0_REG(CAN1_BASE_PTR,35)
#define FLEXCAN1_WORD135                         CAN_WORD1_REG(CAN1_BASE_PTR,35)
#define FLEXCAN1_CS36                            CAN_CS_REG(CAN1_BASE_PTR,36)
#define FLEXCAN1_ID36                            CAN_ID_REG(CAN1_BASE_PTR,36)
#define FLEXCAN1_WORD036                         CAN_WORD0_REG(CAN1_BASE_PTR,36)
#define FLEXCAN1_WORD136                         CAN_WORD1_REG(CAN1_BASE_PTR,36)
#define FLEXCAN1_CS37                            CAN_CS_REG(CAN1_BASE_PTR,37)
#define FLEXCAN1_ID37                            CAN_ID_REG(CAN1_BASE_PTR,37)
#define FLEXCAN1_WORD037                         CAN_WORD0_REG(CAN1_BASE_PTR,37)
#define FLEXCAN1_WORD137                         CAN_WORD1_REG(CAN1_BASE_PTR,37)
#define FLEXCAN1_CS38                            CAN_CS_REG(CAN1_BASE_PTR,38)
#define FLEXCAN1_ID38                            CAN_ID_REG(CAN1_BASE_PTR,38)
#define FLEXCAN1_WORD038                         CAN_WORD0_REG(CAN1_BASE_PTR,38)
#define FLEXCAN1_WORD138                         CAN_WORD1_REG(CAN1_BASE_PTR,38)
#define FLEXCAN1_CS39                            CAN_CS_REG(CAN1_BASE_PTR,39)
#define FLEXCAN1_ID39                            CAN_ID_REG(CAN1_BASE_PTR,39)
#define FLEXCAN1_WORD039                         CAN_WORD0_REG(CAN1_BASE_PTR,39)
#define FLEXCAN1_WORD139                         CAN_WORD1_REG(CAN1_BASE_PTR,39)
#define FLEXCAN1_CS40                            CAN_CS_REG(CAN1_BASE_PTR,40)
#define FLEXCAN1_ID40                            CAN_ID_REG(CAN1_BASE_PTR,40)
#define FLEXCAN1_WORD040                         CAN_WORD0_REG(CAN1_BASE_PTR,40)
#define FLEXCAN1_WORD140                         CAN_WORD1_REG(CAN1_BASE_PTR,40)
#define FLEXCAN1_CS41                            CAN_CS_REG(CAN1_BASE_PTR,41)
#define FLEXCAN1_ID41                            CAN_ID_REG(CAN1_BASE_PTR,41)
#define FLEXCAN1_WORD041                         CAN_WORD0_REG(CAN1_BASE_PTR,41)
#define FLEXCAN1_WORD141                         CAN_WORD1_REG(CAN1_BASE_PTR,41)
#define FLEXCAN1_CS42                            CAN_CS_REG(CAN1_BASE_PTR,42)
#define FLEXCAN1_ID42                            CAN_ID_REG(CAN1_BASE_PTR,42)
#define FLEXCAN1_WORD042                         CAN_WORD0_REG(CAN1_BASE_PTR,42)
#define FLEXCAN1_WORD142                         CAN_WORD1_REG(CAN1_BASE_PTR,42)
#define FLEXCAN1_CS43                            CAN_CS_REG(CAN1_BASE_PTR,43)
#define FLEXCAN1_ID43                            CAN_ID_REG(CAN1_BASE_PTR,43)
#define FLEXCAN1_WORD043                         CAN_WORD0_REG(CAN1_BASE_PTR,43)
#define FLEXCAN1_WORD143                         CAN_WORD1_REG(CAN1_BASE_PTR,43)
#define FLEXCAN1_CS44                            CAN_CS_REG(CAN1_BASE_PTR,44)
#define FLEXCAN1_ID44                            CAN_ID_REG(CAN1_BASE_PTR,44)
#define FLEXCAN1_WORD044                         CAN_WORD0_REG(CAN1_BASE_PTR,44)
#define FLEXCAN1_WORD144                         CAN_WORD1_REG(CAN1_BASE_PTR,44)
#define FLEXCAN1_CS45                            CAN_CS_REG(CAN1_BASE_PTR,45)
#define FLEXCAN1_ID45                            CAN_ID_REG(CAN1_BASE_PTR,45)
#define FLEXCAN1_WORD045                         CAN_WORD0_REG(CAN1_BASE_PTR,45)
#define FLEXCAN1_WORD145                         CAN_WORD1_REG(CAN1_BASE_PTR,45)
#define FLEXCAN1_CS46                            CAN_CS_REG(CAN1_BASE_PTR,46)
#define FLEXCAN1_ID46                            CAN_ID_REG(CAN1_BASE_PTR,46)
#define FLEXCAN1_WORD046                         CAN_WORD0_REG(CAN1_BASE_PTR,46)
#define FLEXCAN1_WORD146                         CAN_WORD1_REG(CAN1_BASE_PTR,46)
#define FLEXCAN1_CS47                            CAN_CS_REG(CAN1_BASE_PTR,47)
#define FLEXCAN1_ID47                            CAN_ID_REG(CAN1_BASE_PTR,47)
#define FLEXCAN1_WORD047                         CAN_WORD0_REG(CAN1_BASE_PTR,47)
#define FLEXCAN1_WORD147                         CAN_WORD1_REG(CAN1_BASE_PTR,47)
#define FLEXCAN1_CS48                            CAN_CS_REG(CAN1_BASE_PTR,48)
#define FLEXCAN1_ID48                            CAN_ID_REG(CAN1_BASE_PTR,48)
#define FLEXCAN1_WORD048                         CAN_WORD0_REG(CAN1_BASE_PTR,48)
#define FLEXCAN1_WORD148                         CAN_WORD1_REG(CAN1_BASE_PTR,48)
#define FLEXCAN1_CS49                            CAN_CS_REG(CAN1_BASE_PTR,49)
#define FLEXCAN1_ID49                            CAN_ID_REG(CAN1_BASE_PTR,49)
#define FLEXCAN1_WORD049                         CAN_WORD0_REG(CAN1_BASE_PTR,49)
#define FLEXCAN1_WORD149                         CAN_WORD1_REG(CAN1_BASE_PTR,49)
#define FLEXCAN1_CS50                            CAN_CS_REG(CAN1_BASE_PTR,50)
#define FLEXCAN1_ID50                            CAN_ID_REG(CAN1_BASE_PTR,50)
#define FLEXCAN1_WORD050                         CAN_WORD0_REG(CAN1_BASE_PTR,50)
#define FLEXCAN1_WORD150                         CAN_WORD1_REG(CAN1_BASE_PTR,50)
#define FLEXCAN1_CS51                            CAN_CS_REG(CAN1_BASE_PTR,51)
#define FLEXCAN1_ID51                            CAN_ID_REG(CAN1_BASE_PTR,51)
#define FLEXCAN1_WORD051                         CAN_WORD0_REG(CAN1_BASE_PTR,51)
#define FLEXCAN1_WORD151                         CAN_WORD1_REG(CAN1_BASE_PTR,51)
#define FLEXCAN1_CS52                            CAN_CS_REG(CAN1_BASE_PTR,52)
#define FLEXCAN1_ID52                            CAN_ID_REG(CAN1_BASE_PTR,52)
#define FLEXCAN1_WORD052                         CAN_WORD0_REG(CAN1_BASE_PTR,52)
#define FLEXCAN1_WORD152                         CAN_WORD1_REG(CAN1_BASE_PTR,52)
#define FLEXCAN1_CS53                            CAN_CS_REG(CAN1_BASE_PTR,53)
#define FLEXCAN1_ID53                            CAN_ID_REG(CAN1_BASE_PTR,53)
#define FLEXCAN1_WORD053                         CAN_WORD0_REG(CAN1_BASE_PTR,53)
#define FLEXCAN1_WORD153                         CAN_WORD1_REG(CAN1_BASE_PTR,53)
#define FLEXCAN1_CS54                            CAN_CS_REG(CAN1_BASE_PTR,54)
#define FLEXCAN1_ID54                            CAN_ID_REG(CAN1_BASE_PTR,54)
#define FLEXCAN1_WORD054                         CAN_WORD0_REG(CAN1_BASE_PTR,54)
#define FLEXCAN1_WORD154                         CAN_WORD1_REG(CAN1_BASE_PTR,54)
#define FLEXCAN1_CS55                            CAN_CS_REG(CAN1_BASE_PTR,55)
#define FLEXCAN1_ID55                            CAN_ID_REG(CAN1_BASE_PTR,55)
#define FLEXCAN1_WORD055                         CAN_WORD0_REG(CAN1_BASE_PTR,55)
#define FLEXCAN1_WORD155                         CAN_WORD1_REG(CAN1_BASE_PTR,55)
#define FLEXCAN1_CS56                            CAN_CS_REG(CAN1_BASE_PTR,56)
#define FLEXCAN1_ID56                            CAN_ID_REG(CAN1_BASE_PTR,56)
#define FLEXCAN1_WORD056                         CAN_WORD0_REG(CAN1_BASE_PTR,56)
#define FLEXCAN1_WORD156                         CAN_WORD1_REG(CAN1_BASE_PTR,56)
#define FLEXCAN1_CS57                            CAN_CS_REG(CAN1_BASE_PTR,57)
#define FLEXCAN1_ID57                            CAN_ID_REG(CAN1_BASE_PTR,57)
#define FLEXCAN1_WORD057                         CAN_WORD0_REG(CAN1_BASE_PTR,57)
#define FLEXCAN1_WORD157                         CAN_WORD1_REG(CAN1_BASE_PTR,57)
#define FLEXCAN1_CS58                            CAN_CS_REG(CAN1_BASE_PTR,58)
#define FLEXCAN1_ID58                            CAN_ID_REG(CAN1_BASE_PTR,58)
#define FLEXCAN1_WORD058                         CAN_WORD0_REG(CAN1_BASE_PTR,58)
#define FLEXCAN1_WORD158                         CAN_WORD1_REG(CAN1_BASE_PTR,58)
