AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
#define FLEXCAN1_CS59                            CAN_CS_REG(CAN1_BASE_PTR,59)
#define FLEXCAN1_ID59                            CAN_ID_REG(CAN1_BASE_PTR,59)
#define FLEXCAN1_WORD059                         CAN_WORD0_REG(CAN1_BASE_PTR,59)
#define FLEXCAN1_WORD159                         CAN_WORD1_REG(CAN1_BASE_PTR,59)
#define FLEXCAN1_CS60                            CAN_CS_REG(CAN1_BASE_PTR,60)
#define FLEXCAN1_ID60                            CAN_ID_REG(CAN1_BASE_PTR,60)
#define FLEXCAN1_WORD060                         CAN_WORD0_REG(CAN1_BASE_PTR,60)
#define FLEXCAN1_WORD160                         CAN_WORD1_REG(CAN1_BASE_PTR,60)
#define FLEXCAN1_CS61                            CAN_CS_REG(CAN1_BASE_PTR,61)
#define FLEXCAN1_ID61                            CAN_ID_REG(CAN1_BASE_PTR,61)
#define FLEXCAN1_WORD061                         CAN_WORD0_REG(CAN1_BASE_PTR,61)
#define FLEXCAN1_WORD161                         CAN_WORD1_REG(CAN1_BASE_PTR,61)
#define FLEXCAN1_CS62                            CAN_CS_REG(CAN1_BASE_PTR,62)
#define FLEXCAN1_ID62                            CAN_ID_REG(CAN1_BASE_PTR,62)
#define FLEXCAN1_WORD062                         CAN_WORD0_REG(CAN1_BASE_PTR,62)
#define FLEXCAN1_WORD162                         CAN_WORD1_REG(CAN1_BASE_PTR,62)
#define FLEXCAN1_CS63                            CAN_CS_REG(CAN1_BASE_PTR,63)
#define FLEXCAN1_ID63                            CAN_ID_REG(CAN1_BASE_PTR,63)
#define FLEXCAN1_WORD063                         CAN_WORD0_REG(CAN1_BASE_PTR,63)
#define FLEXCAN1_WORD163                         CAN_WORD1_REG(CAN1_BASE_PTR,63)
#define FLEXCAN1_RXIMR0                          CAN_RXIMR_REG(CAN1_BASE_PTR,0)
#define FLEXCAN1_RXIMR1                          CAN_RXIMR_REG(CAN1_BASE_PTR,1)
#define FLEXCAN1_RXIMR2                          CAN_RXIMR_REG(CAN1_BASE_PTR,2)
#define FLEXCAN1_RXIMR3                          CAN_RXIMR_REG(CAN1_BASE_PTR,3)
#define FLEXCAN1_RXIMR4                          CAN_RXIMR_REG(CAN1_BASE_PTR,4)
#define FLEXCAN1_RXIMR5                          CAN_RXIMR_REG(CAN1_BASE_PTR,5)
#define FLEXCAN1_RXIMR6                          CAN_RXIMR_REG(CAN1_BASE_PTR,6)
#define FLEXCAN1_RXIMR7                          CAN_RXIMR_REG(CAN1_BASE_PTR,7)
#define FLEXCAN1_RXIMR8                          CAN_RXIMR_REG(CAN1_BASE_PTR,8)
#define FLEXCAN1_RXIMR9                          CAN_RXIMR_REG(CAN1_BASE_PTR,9)
#define FLEXCAN1_RXIMR10                         CAN_RXIMR_REG(CAN1_BASE_PTR,10)
#define FLEXCAN1_RXIMR11                         CAN_RXIMR_REG(CAN1_BASE_PTR,11)
#define FLEXCAN1_RXIMR12                         CAN_RXIMR_REG(CAN1_BASE_PTR,12)
#define FLEXCAN1_RXIMR13                         CAN_RXIMR_REG(CAN1_BASE_PTR,13)
#define FLEXCAN1_RXIMR14                         CAN_RXIMR_REG(CAN1_BASE_PTR,14)
#define FLEXCAN1_RXIMR15                         CAN_RXIMR_REG(CAN1_BASE_PTR,15)
#define FLEXCAN1_RXIMR16                         CAN_RXIMR_REG(CAN1_BASE_PTR,16)
#define FLEXCAN1_RXIMR17                         CAN_RXIMR_REG(CAN1_BASE_PTR,17)
#define FLEXCAN1_RXIMR18                         CAN_RXIMR_REG(CAN1_BASE_PTR,18)
#define FLEXCAN1_RXIMR19                         CAN_RXIMR_REG(CAN1_BASE_PTR,19)
#define FLEXCAN1_RXIMR20                         CAN_RXIMR_REG(CAN1_BASE_PTR,20)
#define FLEXCAN1_RXIMR21                         CAN_RXIMR_REG(CAN1_BASE_PTR,21)
#define FLEXCAN1_RXIMR22                         CAN_RXIMR_REG(CAN1_BASE_PTR,22)
#define FLEXCAN1_RXIMR23                         CAN_RXIMR_REG(CAN1_BASE_PTR,23)
#define FLEXCAN1_RXIMR24                         CAN_RXIMR_REG(CAN1_BASE_PTR,24)
#define FLEXCAN1_RXIMR25                         CAN_RXIMR_REG(CAN1_BASE_PTR,25)
#define FLEXCAN1_RXIMR26                         CAN_RXIMR_REG(CAN1_BASE_PTR,26)
#define FLEXCAN1_RXIMR27                         CAN_RXIMR_REG(CAN1_BASE_PTR,27)
#define FLEXCAN1_RXIMR28                         CAN_RXIMR_REG(CAN1_BASE_PTR,28)
#define FLEXCAN1_RXIMR29                         CAN_RXIMR_REG(CAN1_BASE_PTR,29)
#define FLEXCAN1_RXIMR30                         CAN_RXIMR_REG(CAN1_BASE_PTR,30)
#define FLEXCAN1_RXIMR31                         CAN_RXIMR_REG(CAN1_BASE_PTR,31)
#define FLEXCAN1_RXIMR32                         CAN_RXIMR_REG(CAN1_BASE_PTR,32)
#define FLEXCAN1_RXIMR33                         CAN_RXIMR_REG(CAN1_BASE_PTR,33)
#define FLEXCAN1_RXIMR34                         CAN_RXIMR_REG(CAN1_BASE_PTR,34)
#define FLEXCAN1_RXIMR35                         CAN_RXIMR_REG(CAN1_BASE_PTR,35)
#define FLEXCAN1_RXIMR36                         CAN_RXIMR_REG(CAN1_BASE_PTR,36)
#define FLEXCAN1_RXIMR37                         CAN_RXIMR_REG(CAN1_BASE_PTR,37)
#define FLEXCAN1_RXIMR38                         CAN_RXIMR_REG(CAN1_BASE_PTR,38)
#define FLEXCAN1_RXIMR39                         CAN_RXIMR_REG(CAN1_BASE_PTR,39)
#define FLEXCAN1_RXIMR40                         CAN_RXIMR_REG(CAN1_BASE_PTR,40)
#define FLEXCAN1_RXIMR41                         CAN_RXIMR_REG(CAN1_BASE_PTR,41)
#define FLEXCAN1_RXIMR42                         CAN_RXIMR_REG(CAN1_BASE_PTR,42)
#define FLEXCAN1_RXIMR43                         CAN_RXIMR_REG(CAN1_BASE_PTR,43)
#define FLEXCAN1_RXIMR44                         CAN_RXIMR_REG(CAN1_BASE_PTR,44)
#define FLEXCAN1_RXIMR45                         CAN_RXIMR_REG(CAN1_BASE_PTR,45)
#define FLEXCAN1_RXIMR46                         CAN_RXIMR_REG(CAN1_BASE_PTR,46)
#define FLEXCAN1_RXIMR47                         CAN_RXIMR_REG(CAN1_BASE_PTR,47)
#define FLEXCAN1_RXIMR48                         CAN_RXIMR_REG(CAN1_BASE_PTR,48)
#define FLEXCAN1_RXIMR49                         CAN_RXIMR_REG(CAN1_BASE_PTR,49)
#define FLEXCAN1_RXIMR50                         CAN_RXIMR_REG(CAN1_BASE_PTR,50)
#define FLEXCAN1_RXIMR51                         CAN_RXIMR_REG(CAN1_BASE_PTR,51)
#define FLEXCAN1_RXIMR52                         CAN_RXIMR_REG(CAN1_BASE_PTR,52)
#define FLEXCAN1_RXIMR53                         CAN_RXIMR_REG(CAN1_BASE_PTR,53)
#define FLEXCAN1_RXIMR54                         CAN_RXIMR_REG(CAN1_BASE_PTR,54)
#define FLEXCAN1_RXIMR55                         CAN_RXIMR_REG(CAN1_BASE_PTR,55)
#define FLEXCAN1_RXIMR56                         CAN_RXIMR_REG(CAN1_BASE_PTR,56)
#define FLEXCAN1_RXIMR57                         CAN_RXIMR_REG(CAN1_BASE_PTR,57)
#define FLEXCAN1_RXIMR58                         CAN_RXIMR_REG(CAN1_BASE_PTR,58)
#define FLEXCAN1_RXIMR59                         CAN_RXIMR_REG(CAN1_BASE_PTR,59)
#define FLEXCAN1_RXIMR60                         CAN_RXIMR_REG(CAN1_BASE_PTR,60)
#define FLEXCAN1_RXIMR61                         CAN_RXIMR_REG(CAN1_BASE_PTR,61)
#define FLEXCAN1_RXIMR62                         CAN_RXIMR_REG(CAN1_BASE_PTR,62)
#define FLEXCAN1_RXIMR63                         CAN_RXIMR_REG(CAN1_BASE_PTR,63)
#define FLEXCAN1_GFWR                            CAN_GFWR_REG(CAN1_BASE_PTR)
/* CAN2 */
#define FLEXCAN2_MCR                             CAN_MCR_REG(CAN2_BASE_PTR)
#define FLEXCAN2_CTRL1                           CAN_CTRL1_REG(CAN2_BASE_PTR)
#define FLEXCAN2_TIMER                           CAN_TIMER_REG(CAN2_BASE_PTR)
#define FLEXCAN2_RXMGMASK                        CAN_RXMGMASK_REG(CAN2_BASE_PTR)
#define FLEXCAN2_RX14MASK                        CAN_RX14MASK_REG(CAN2_BASE_PTR)
#define FLEXCAN2_RX15MASK                        CAN_RX15MASK_REG(CAN2_BASE_PTR)
#define FLEXCAN2_ECR                             CAN_ECR_REG(CAN2_BASE_PTR)
#define FLEXCAN2_ESR1                            CAN_ESR1_REG(CAN2_BASE_PTR)
#define FLEXCAN2_IMASK2                          CAN_IMASK2_REG(CAN2_BASE_PTR)
#define FLEXCAN2_IMASK1                          CAN_IMASK1_REG(CAN2_BASE_PTR)
#define FLEXCAN2_IFLAG2                          CAN_IFLAG2_REG(CAN2_BASE_PTR)
#define FLEXCAN2_IFLAG1                          CAN_IFLAG1_REG(CAN2_BASE_PTR)
#define FLEXCAN2_CTRL2                           CAN_CTRL2_REG(CAN2_BASE_PTR)
#define FLEXCAN2_ESR2                            CAN_ESR2_REG(CAN2_BASE_PTR)
#define FLEXCAN2_CRCR                            CAN_CRCR_REG(CAN2_BASE_PTR)
#define FLEXCAN2_RXFGMASK                        CAN_RXFGMASK_REG(CAN2_BASE_PTR)
#define FLEXCAN2_RXFIR                           CAN_RXFIR_REG(CAN2_BASE_PTR)
#define FLEXCAN2_CS0                             CAN_CS_REG(CAN2_BASE_PTR,0)
#define FLEXCAN2_ID0                             CAN_ID_REG(CAN2_BASE_PTR,0)
#define FLEXCAN2_WORD00                          CAN_WORD0_REG(CAN2_BASE_PTR,0)
#define FLEXCAN2_WORD10                          CAN_WORD1_REG(CAN2_BASE_PTR,0)
#define FLEXCAN2_CS1                             CAN_CS_REG(CAN2_BASE_PTR,1)
#define FLEXCAN2_ID1                             CAN_ID_REG(CAN2_BASE_PTR,1)
#define FLEXCAN2_WORD01                          CAN_WORD0_REG(CAN2_BASE_PTR,1)
#define FLEXCAN2_WORD11                          CAN_WORD1_REG(CAN2_BASE_PTR,1)
#define FLEXCAN2_CS2                             CAN_CS_REG(CAN2_BASE_PTR,2)
#define FLEXCAN2_ID2                             CAN_ID_REG(CAN2_BASE_PTR,2)
#define FLEXCAN2_WORD02                          CAN_WORD0_REG(CAN2_BASE_PTR,2)
#define FLEXCAN2_WORD12                          CAN_WORD1_REG(CAN2_BASE_PTR,2)
#define FLEXCAN2_CS3                             CAN_CS_REG(CAN2_BASE_PTR,3)
#define FLEXCAN2_ID3                             CAN_ID_REG(CAN2_BASE_PTR,3)
#define FLEXCAN2_WORD03                          CAN_WORD0_REG(CAN2_BASE_PTR,3)
#define FLEXCAN2_WORD13                          CAN_WORD1_REG(CAN2_BASE_PTR,3)
#define FLEXCAN2_CS4                             CAN_CS_REG(CAN2_BASE_PTR,4)
#define FLEXCAN2_ID4                             CAN_ID_REG(CAN2_BASE_PTR,4)
#define FLEXCAN2_WORD04                          CAN_WORD0_REG(CAN2_BASE_PTR,4)
#define FLEXCAN2_WORD14                          CAN_WORD1_REG(CAN2_BASE_PTR,4)
#define FLEXCAN2_CS5                             CAN_CS_REG(CAN2_BASE_PTR,5)
#define FLEXCAN2_ID5                             CAN_ID_REG(CAN2_BASE_PTR,5)
#define FLEXCAN2_WORD05                          CAN_WORD0_REG(CAN2_BASE_PTR,5)
#define FLEXCAN2_WORD15                          CAN_WORD1_REG(CAN2_BASE_PTR,5)
#define FLEXCAN2_CS6                             CAN_CS_REG(CAN2_BASE_PTR,6)
#define FLEXCAN2_ID6                             CAN_ID_REG(CAN2_BASE_PTR,6)
#define FLEXCAN2_WORD06                          CAN_WORD0_REG(CAN2_BASE_PTR,6)
#define FLEXCAN2_WORD16                          CAN_WORD1_REG(CAN2_BASE_PTR,6)
#define FLEXCAN2_CS7                             CAN_CS_REG(CAN2_BASE_PTR,7)
#define FLEXCAN2_ID7                             CAN_ID_REG(CAN2_BASE_PTR,7)
#define FLEXCAN2_WORD07                          CAN_WORD0_REG(CAN2_BASE_PTR,7)
#define FLEXCAN2_WORD17                          CAN_WORD1_REG(CAN2_BASE_PTR,7)
#define FLEXCAN2_CS8                             CAN_CS_REG(CAN2_BASE_PTR,8)
#define FLEXCAN2_ID8                             CAN_ID_REG(CAN2_BASE_PTR,8)
#define FLEXCAN2_WORD08                          CAN_WORD0_REG(CAN2_BASE_PTR,8)
#define FLEXCAN2_WORD18                          CAN_WORD1_REG(CAN2_BASE_PTR,8)
#define FLEXCAN2_CS9                             CAN_CS_REG(CAN2_BASE_PTR,9)
#define FLEXCAN2_ID9                             CAN_ID_REG(CAN2_BASE_PTR,9)
#define FLEXCAN2_WORD09                          CAN_WORD0_REG(CAN2_BASE_PTR,9)
#define FLEXCAN2_WORD19                          CAN_WORD1_REG(CAN2_BASE_PTR,9)
#define FLEXCAN2_CS10                            CAN_CS_REG(CAN2_BASE_PTR,10)
#define FLEXCAN2_ID10                            CAN_ID_REG(CAN2_BASE_PTR,10)
#define FLEXCAN2_WORD010                         CAN_WORD0_REG(CAN2_BASE_PTR,10)
#define FLEXCAN2_WORD110                         CAN_WORD1_REG(CAN2_BASE_PTR,10)
#define FLEXCAN2_CS11                            CAN_CS_REG(CAN2_BASE_PTR,11)
#define FLEXCAN2_ID11                            CAN_ID_REG(CAN2_BASE_PTR,11)
#define FLEXCAN2_WORD011                         CAN_WORD0_REG(CAN2_BASE_PTR,11)
#define FLEXCAN2_WORD111                         CAN_WORD1_REG(CAN2_BASE_PTR,11)
#define FLEXCAN2_CS12                            CAN_CS_REG(CAN2_BASE_PTR,12)
#define FLEXCAN2_ID12                            CAN_ID_REG(CAN2_BASE_PTR,12)
#define FLEXCAN2_WORD012                         CAN_WORD0_REG(CAN2_BASE_PTR,12)
#define FLEXCAN2_WORD112                         CAN_WORD1_REG(CAN2_BASE_PTR,12)
#define FLEXCAN2_CS13                            CAN_CS_REG(CAN2_BASE_PTR,13)
#define FLEXCAN2_ID13                            CAN_ID_REG(CAN2_BASE_PTR,13)
#define FLEXCAN2_WORD013                         CAN_WORD0_REG(CAN2_BASE_PTR,13)
#define FLEXCAN2_WORD113                         CAN_WORD1_REG(CAN2_BASE_PTR,13)
#define FLEXCAN2_CS14                            CAN_CS_REG(CAN2_BASE_PTR,14)
#define FLEXCAN2_ID14                            CAN_ID_REG(CAN2_BASE_PTR,14)
#define FLEXCAN2_WORD014                         CAN_WORD0_REG(CAN2_BASE_PTR,14)
#define FLEXCAN2_WORD114                         CAN_WORD1_REG(CAN2_BASE_PTR,14)
#define FLEXCAN2_CS15                            CAN_CS_REG(CAN2_BASE_PTR,15)
#define FLEXCAN2_ID15                            CAN_ID_REG(CAN2_BASE_PTR,15)
#define FLEXCAN2_WORD015                         CAN_WORD0_REG(CAN2_BASE_PTR,15)
#define FLEXCAN2_WORD115                         CAN_WORD1_REG(CAN2_BASE_PTR,15)
#define FLEXCAN2_CS16                            CAN_CS_REG(CAN2_BASE_PTR,16)
#define FLEXCAN2_ID16                            CAN_ID_REG(CAN2_BASE_PTR,16)
#define FLEXCAN2_WORD016                         CAN_WORD0_REG(CAN2_BASE_PTR,16)
#define FLEXCAN2_WORD116                         CAN_WORD1_REG(CAN2_BASE_PTR,16)
#define FLEXCAN2_CS17                            CAN_CS_REG(CAN2_BASE_PTR,17)
#define FLEXCAN2_ID17                            CAN_ID_REG(CAN2_BASE_PTR,17)
#define FLEXCAN2_WORD017                         CAN_WORD0_REG(CAN2_BASE_PTR,17)
#define FLEXCAN2_WORD117                         CAN_WORD1_REG(CAN2_BASE_PTR,17)
#define FLEXCAN2_CS18                            CAN_CS_REG(CAN2_BASE_PTR,18)
#define FLEXCAN2_ID18                            CAN_ID_REG(CAN2_BASE_PTR,18)
#define FLEXCAN2_WORD018                         CAN_WORD0_REG(CAN2_BASE_PTR,18)
#define FLEXCAN2_WORD118                         CAN_WORD1_REG(CAN2_BASE_PTR,18)
#define FLEXCAN2_CS19                            CAN_CS_REG(CAN2_BASE_PTR,19)
#define FLEXCAN2_ID19                            CAN_ID_REG(CAN2_BASE_PTR,19)
#define FLEXCAN2_WORD019                         CAN_WORD0_REG(CAN2_BASE_PTR,19)
#define FLEXCAN2_WORD119                         CAN_WORD1_REG(CAN2_BASE_PTR,19)
#define FLEXCAN2_CS20                            CAN_CS_REG(CAN2_BASE_PTR,20)
#define FLEXCAN2_ID20                            CAN_ID_REG(CAN2_BASE_PTR,20)
#define FLEXCAN2_WORD020                         CAN_WORD0_REG(CAN2_BASE_PTR,20)
#define FLEXCAN2_WORD120                         CAN_WORD1_REG(CAN2_BASE_PTR,20)
#define FLEXCAN2_CS21                            CAN_CS_REG(CAN2_BASE_PTR,21)
#define FLEXCAN2_ID21                            CAN_ID_REG(CAN2_BASE_PTR,21)
#define FLEXCAN2_WORD021                         CAN_WORD0_REG(CAN2_BASE_PTR,21)
#define FLEXCAN2_WORD121                         CAN_WORD1_REG(CAN2_BASE_PTR,21)
#define FLEXCAN2_CS22                            CAN_CS_REG(CAN2_BASE_PTR,22)
#define FLEXCAN2_ID22                            CAN_ID_REG(CAN2_BASE_PTR,22)
#define FLEXCAN2_WORD022                         CAN_WORD0_REG(CAN2_BASE_PTR,22)
#define FLEXCAN2_WORD122                         CAN_WORD1_REG(CAN2_BASE_PTR,22)
#define FLEXCAN2_CS23                            CAN_CS_REG(CAN2_BASE_PTR,23)
#define FLEXCAN2_ID23                            CAN_ID_REG(CAN2_BASE_PTR,23)
#define FLEXCAN2_WORD023                         CAN_WORD0_REG(CAN2_BASE_PTR,23)
#define FLEXCAN2_WORD123                         CAN_WORD1_REG(CAN2_BASE_PTR,23)
#define FLEXCAN2_CS24                            CAN_CS_REG(CAN2_BASE_PTR,24)
#define FLEXCAN2_ID24                            CAN_ID_REG(CAN2_BASE_PTR,24)
#define FLEXCAN2_WORD024                         CAN_WORD0_REG(CAN2_BASE_PTR,24)
#define FLEXCAN2_WORD124                         CAN_WORD1_REG(CAN2_BASE_PTR,24)
#define FLEXCAN2_CS25                            CAN_CS_REG(CAN2_BASE_PTR,25)
#define FLEXCAN2_ID25                            CAN_ID_REG(CAN2_BASE_PTR,25)
#define FLEXCAN2_WORD025                         CAN_WORD0_REG(CAN2_BASE_PTR,25)
#define FLEXCAN2_WORD125                         CAN_WORD1_REG(CAN2_BASE_PTR,25)
#define FLEXCAN2_CS26                            CAN_CS_REG(CAN2_BASE_PTR,26)
#define FLEXCAN2_ID26                            CAN_ID_REG(CAN2_BASE_PTR,26)
#define FLEXCAN2_WORD026                         CAN_WORD0_REG(CAN2_BASE_PTR,26)
#define FLEXCAN2_WORD126                         CAN_WORD1_REG(CAN2_BASE_PTR,26)
#define FLEXCAN2_CS27                            CAN_CS_REG(CAN2_BASE_PTR,27)
#define FLEXCAN2_ID27                            CAN_ID_REG(CAN2_BASE_PTR,27)
#define FLEXCAN2_WORD027                         CAN_WORD0_REG(CAN2_BASE_PTR,27)
#define FLEXCAN2_WORD127                         CAN_WORD1_REG(CAN2_BASE_PTR,27)
#define FLEXCAN2_CS28                            CAN_CS_REG(CAN2_BASE_PTR,28)
#define FLEXCAN2_ID28                            CAN_ID_REG(CAN2_BASE_PTR,28)
#define FLEXCAN2_WORD028                         CAN_WORD0_REG(CAN2_BASE_PTR,28)
#define FLEXCAN2_WORD128                         CAN_WORD1_REG(CAN2_BASE_PTR,28)
#define FLEXCAN2_CS29                            CAN_CS_REG(CAN2_BASE_PTR,29)
#define FLEXCAN2_ID29                            CAN_ID_REG(CAN2_BASE_PTR,29)
#define FLEXCAN2_WORD029                         CAN_WORD0_REG(CAN2_BASE_PTR,29)
#define FLEXCAN2_WORD129                         CAN_WORD1_REG(CAN2_BASE_PTR,29)
#define FLEXCAN2_CS30                            CAN_CS_REG(CAN2_BASE_PTR,30)
#define FLEXCAN2_ID30                            CAN_ID_REG(CAN2_BASE_PTR,30)
#define FLEXCAN2_WORD030                         CAN_WORD0_REG(CAN2_BASE_PTR,30)
#define FLEXCAN2_WORD130                         CAN_WORD1_REG(CAN2_BASE_PTR,30)
#define FLEXCAN2_CS31                            CAN_CS_REG(CAN2_BASE_PTR,31)
#define FLEXCAN2_ID31                            CAN_ID_REG(CAN2_BASE_PTR,31)
#define FLEXCAN2_WORD031                         CAN_WORD0_REG(CAN2_BASE_PTR,31)
#define FLEXCAN2_WORD131                         CAN_WORD1_REG(CAN2_BASE_PTR,31)
#define FLEXCAN2_CS32                            CAN_CS_REG(CAN2_BASE_PTR,32)
#define FLEXCAN2_ID32                            CAN_ID_REG(CAN2_BASE_PTR,32)
#define FLEXCAN2_WORD032                         CAN_WORD0_REG(CAN2_BASE_PTR,32)
#define FLEXCAN2_WORD132                         CAN_WORD1_REG(CAN2_BASE_PTR,32)
#define FLEXCAN2_CS33                            CAN_CS_REG(CAN2_BASE_PTR,33)
#define FLEXCAN2_ID33                            CAN_ID_REG(CAN2_BASE_PTR,33)
#define FLEXCAN2_WORD033                         CAN_WORD0_REG(CAN2_BASE_PTR,33)
#define FLEXCAN2_WORD133                         CAN_WORD1_REG(CAN2_BASE_PTR,33)
#define FLEXCAN2_CS34                            CAN_CS_REG(CAN2_BASE_PTR,34)
#define FLEXCAN2_ID34                            CAN_ID_REG(CAN2_BASE_PTR,34)
#define FLEXCAN2_WORD034                         CAN_WORD0_REG(CAN2_BASE_PTR,34)
#define FLEXCAN2_WORD134                         CAN_WORD1_REG(CAN2_BASE_PTR,34)
#define FLEXCAN2_CS35                            CAN_CS_REG(CAN2_BASE_PTR,35)
#define FLEXCAN2_ID35                            CAN_ID_REG(CAN2_BASE_PTR,35)
#define FLEXCAN2_WORD035                         CAN_WORD0_REG(CAN2_BASE_PTR,35)
#define FLEXCAN2_WORD135                         CAN_WORD1_REG(CAN2_BASE_PTR,35)
#define FLEXCAN2_CS36                            CAN_CS_REG(CAN2_BASE_PTR,36)
#define FLEXCAN2_ID36                            CAN_ID_REG(CAN2_BASE_PTR,36)
#define FLEXCAN2_WORD036                         CAN_WORD0_REG(CAN2_BASE_PTR,36)
#define FLEXCAN2_WORD136                         CAN_WORD1_REG(CAN2_BASE_PTR,36)
#define FLEXCAN2_CS37                            CAN_CS_REG(CAN2_BASE_PTR,37)
#define FLEXCAN2_ID37                            CAN_ID_REG(CAN2_BASE_PTR,37)
#define FLEXCAN2_WORD037                         CAN_WORD0_REG(CAN2_BASE_PTR,37)
#define FLEXCAN2_WORD137                         CAN_WORD1_REG(CAN2_BASE_PTR,37)
#define FLEXCAN2_CS38                            CAN_CS_REG(CAN2_BASE_PTR,38)
#define FLEXCAN2_ID38                            CAN_ID_REG(CAN2_BASE_PTR,38)
#define FLEXCAN2_WORD038                         CAN_WORD0_REG(CAN2_BASE_PTR,38)
#define FLEXCAN2_WORD138                         CAN_WORD1_REG(CAN2_BASE_PTR,38)
#define FLEXCAN2_CS39                            CAN_CS_REG(CAN2_BASE_PTR,39)
#define FLEXCAN2_ID39                            CAN_ID_REG(CAN2_BASE_PTR,39)
#define FLEXCAN2_WORD039                         CAN_WORD0_REG(CAN2_BASE_PTR,39)
#define FLEXCAN2_WORD139                         CAN_WORD1_REG(CAN2_BASE_PTR,39)
#define FLEXCAN2_CS40                            CAN_CS_REG(CAN2_BASE_PTR,40)
#define FLEXCAN2_ID40                            CAN_ID_REG(CAN2_BASE_PTR,40)
#define FLEXCAN2_WORD040                         CAN_WORD0_REG(CAN2_BASE_PTR,40)
#define FLEXCAN2_WORD140                         CAN_WORD1_REG(CAN2_BASE_PTR,40)
#define FLEXCAN2_CS41                            CAN_CS_REG(CAN2_BASE_PTR,41)
#define FLEXCAN2_ID41                            CAN_ID_REG(CAN2_BASE_PTR,41)
#define FLEXCAN2_WORD041                         CAN_WORD0_REG(CAN2_BASE_PTR,41)
#define FLEXCAN2_WORD141                         CAN_WORD1_REG(CAN2_BASE_PTR,41)
#define FLEXCAN2_CS42                            CAN_CS_REG(CAN2_BASE_PTR,42)
#define FLEXCAN2_ID42                            CAN_ID_REG(CAN2_BASE_PTR,42)
#define FLEXCAN2_WORD042                         CAN_WORD0_REG(CAN2_BASE_PTR,42)
#define FLEXCAN2_WORD142                         CAN_WORD1_REG(CAN2_BASE_PTR,42)
#define FLEXCAN2_CS43                            CAN_CS_REG(CAN2_BASE_PTR,43)
#define FLEXCAN2_ID43                            CAN_ID_REG(CAN2_BASE_PTR,43)
#define FLEXCAN2_WORD043                         CAN_WORD0_REG(CAN2_BASE_PTR,43)
#define FLEXCAN2_WORD143                         CAN_WORD1_REG(CAN2_BASE_PTR,43)
#define FLEXCAN2_CS44                            CAN_CS_REG(CAN2_BASE_PTR,44)
#define FLEXCAN2_ID44                            CAN_ID_REG(CAN2_BASE_PTR,44)
#define FLEXCAN2_WORD044                         CAN_WORD0_REG(CAN2_BASE_PTR,44)
#define FLEXCAN2_WORD144                         CAN_WORD1_REG(CAN2_BASE_PTR,44)
#define FLEXCAN2_CS45                            CAN_CS_REG(CAN2_BASE_PTR,45)
#define FLEXCAN2_ID45                            CAN_ID_REG(CAN2_BASE_PTR,45)
#define FLEXCAN2_WORD045                         CAN_WORD0_REG(CAN2_BASE_PTR,45)
#define FLEXCAN2_WORD145                         CAN_WORD1_REG(CAN2_BASE_PTR,45)
#define FLEXCAN2_CS46                            CAN_CS_REG(CAN2_BASE_PTR,46)
#define FLEXCAN2_ID46                            CAN_ID_REG(CAN2_BASE_PTR,46)
#define FLEXCAN2_WORD046                         CAN_WORD0_REG(CAN2_BASE_PTR,46)
#define FLEXCAN2_WORD146                         CAN_WORD1_REG(CAN2_BASE_PTR,46)
#define FLEXCAN2_CS47                            CAN_CS_REG(CAN2_BASE_PTR,47)
#define FLEXCAN2_ID47                            CAN_ID_REG(CAN2_BASE_PTR,47)
#define FLEXCAN2_WORD047                         CAN_WORD0_REG(CAN2_BASE_PTR,47)
#define FLEXCAN2_WORD147                         CAN_WORD1_REG(CAN2_BASE_PTR,47)
#define FLEXCAN2_CS48                            CAN_CS_REG(CAN2_BASE_PTR,48)
#define FLEXCAN2_ID48                            CAN_ID_REG(CAN2_BASE_PTR,48)
#define FLEXCAN2_WORD048                         CAN_WORD0_REG(CAN2_BASE_PTR,48)
#define FLEXCAN2_WORD148                         CAN_WORD1_REG(CAN2_BASE_PTR,48)
#define FLEXCAN2_CS49                            CAN_CS_REG(CAN2_BASE_PTR,49)
#define FLEXCAN2_ID49                            CAN_ID_REG(CAN2_BASE_PTR,49)
#define FLEXCAN2_WORD049                         CAN_WORD0_REG(CAN2_BASE_PTR,49)
