AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
#define FLEXCAN2_WORD149                         CAN_WORD1_REG(CAN2_BASE_PTR,49)
#define FLEXCAN2_CS50                            CAN_CS_REG(CAN2_BASE_PTR,50)
#define FLEXCAN2_ID50                            CAN_ID_REG(CAN2_BASE_PTR,50)
#define FLEXCAN2_WORD050                         CAN_WORD0_REG(CAN2_BASE_PTR,50)
#define FLEXCAN2_WORD150                         CAN_WORD1_REG(CAN2_BASE_PTR,50)
#define FLEXCAN2_CS51                            CAN_CS_REG(CAN2_BASE_PTR,51)
#define FLEXCAN2_ID51                            CAN_ID_REG(CAN2_BASE_PTR,51)
#define FLEXCAN2_WORD051                         CAN_WORD0_REG(CAN2_BASE_PTR,51)
#define FLEXCAN2_WORD151                         CAN_WORD1_REG(CAN2_BASE_PTR,51)
#define FLEXCAN2_CS52                            CAN_CS_REG(CAN2_BASE_PTR,52)
#define FLEXCAN2_ID52                            CAN_ID_REG(CAN2_BASE_PTR,52)
#define FLEXCAN2_WORD052                         CAN_WORD0_REG(CAN2_BASE_PTR,52)
#define FLEXCAN2_WORD152                         CAN_WORD1_REG(CAN2_BASE_PTR,52)
#define FLEXCAN2_CS53                            CAN_CS_REG(CAN2_BASE_PTR,53)
#define FLEXCAN2_ID53                            CAN_ID_REG(CAN2_BASE_PTR,53)
#define FLEXCAN2_WORD053                         CAN_WORD0_REG(CAN2_BASE_PTR,53)
#define FLEXCAN2_WORD153                         CAN_WORD1_REG(CAN2_BASE_PTR,53)
#define FLEXCAN2_CS54                            CAN_CS_REG(CAN2_BASE_PTR,54)
#define FLEXCAN2_ID54                            CAN_ID_REG(CAN2_BASE_PTR,54)
#define FLEXCAN2_WORD054                         CAN_WORD0_REG(CAN2_BASE_PTR,54)
#define FLEXCAN2_WORD154                         CAN_WORD1_REG(CAN2_BASE_PTR,54)
#define FLEXCAN2_CS55                            CAN_CS_REG(CAN2_BASE_PTR,55)
#define FLEXCAN2_ID55                            CAN_ID_REG(CAN2_BASE_PTR,55)
#define FLEXCAN2_WORD055                         CAN_WORD0_REG(CAN2_BASE_PTR,55)
#define FLEXCAN2_WORD155                         CAN_WORD1_REG(CAN2_BASE_PTR,55)
#define FLEXCAN2_CS56                            CAN_CS_REG(CAN2_BASE_PTR,56)
#define FLEXCAN2_ID56                            CAN_ID_REG(CAN2_BASE_PTR,56)
#define FLEXCAN2_WORD056                         CAN_WORD0_REG(CAN2_BASE_PTR,56)
#define FLEXCAN2_WORD156                         CAN_WORD1_REG(CAN2_BASE_PTR,56)
#define FLEXCAN2_CS57                            CAN_CS_REG(CAN2_BASE_PTR,57)
#define FLEXCAN2_ID57                            CAN_ID_REG(CAN2_BASE_PTR,57)
#define FLEXCAN2_WORD057                         CAN_WORD0_REG(CAN2_BASE_PTR,57)
#define FLEXCAN2_WORD157                         CAN_WORD1_REG(CAN2_BASE_PTR,57)
#define FLEXCAN2_CS58                            CAN_CS_REG(CAN2_BASE_PTR,58)
#define FLEXCAN2_ID58                            CAN_ID_REG(CAN2_BASE_PTR,58)
#define FLEXCAN2_WORD058                         CAN_WORD0_REG(CAN2_BASE_PTR,58)
#define FLEXCAN2_WORD158                         CAN_WORD1_REG(CAN2_BASE_PTR,58)
#define FLEXCAN2_CS59                            CAN_CS_REG(CAN2_BASE_PTR,59)
#define FLEXCAN2_ID59                            CAN_ID_REG(CAN2_BASE_PTR,59)
#define FLEXCAN2_WORD059                         CAN_WORD0_REG(CAN2_BASE_PTR,59)
#define FLEXCAN2_WORD159                         CAN_WORD1_REG(CAN2_BASE_PTR,59)
#define FLEXCAN2_CS60                            CAN_CS_REG(CAN2_BASE_PTR,60)
#define FLEXCAN2_ID60                            CAN_ID_REG(CAN2_BASE_PTR,60)
#define FLEXCAN2_WORD060                         CAN_WORD0_REG(CAN2_BASE_PTR,60)
#define FLEXCAN2_WORD160                         CAN_WORD1_REG(CAN2_BASE_PTR,60)
#define FLEXCAN2_CS61                            CAN_CS_REG(CAN2_BASE_PTR,61)
#define FLEXCAN2_ID61                            CAN_ID_REG(CAN2_BASE_PTR,61)
#define FLEXCAN2_WORD061                         CAN_WORD0_REG(CAN2_BASE_PTR,61)
#define FLEXCAN2_WORD161                         CAN_WORD1_REG(CAN2_BASE_PTR,61)
#define FLEXCAN2_CS62                            CAN_CS_REG(CAN2_BASE_PTR,62)
#define FLEXCAN2_ID62                            CAN_ID_REG(CAN2_BASE_PTR,62)
#define FLEXCAN2_WORD062                         CAN_WORD0_REG(CAN2_BASE_PTR,62)
#define FLEXCAN2_WORD162                         CAN_WORD1_REG(CAN2_BASE_PTR,62)
#define FLEXCAN2_CS63                            CAN_CS_REG(CAN2_BASE_PTR,63)
#define FLEXCAN2_ID63                            CAN_ID_REG(CAN2_BASE_PTR,63)
#define FLEXCAN2_WORD063                         CAN_WORD0_REG(CAN2_BASE_PTR,63)
#define FLEXCAN2_WORD163                         CAN_WORD1_REG(CAN2_BASE_PTR,63)
#define FLEXCAN2_RXIMR0                          CAN_RXIMR_REG(CAN2_BASE_PTR,0)
#define FLEXCAN2_RXIMR1                          CAN_RXIMR_REG(CAN2_BASE_PTR,1)
#define FLEXCAN2_RXIMR2                          CAN_RXIMR_REG(CAN2_BASE_PTR,2)
#define FLEXCAN2_RXIMR3                          CAN_RXIMR_REG(CAN2_BASE_PTR,3)
#define FLEXCAN2_RXIMR4                          CAN_RXIMR_REG(CAN2_BASE_PTR,4)
#define FLEXCAN2_RXIMR5                          CAN_RXIMR_REG(CAN2_BASE_PTR,5)
#define FLEXCAN2_RXIMR6                          CAN_RXIMR_REG(CAN2_BASE_PTR,6)
#define FLEXCAN2_RXIMR7                          CAN_RXIMR_REG(CAN2_BASE_PTR,7)
#define FLEXCAN2_RXIMR8                          CAN_RXIMR_REG(CAN2_BASE_PTR,8)
#define FLEXCAN2_RXIMR9                          CAN_RXIMR_REG(CAN2_BASE_PTR,9)
#define FLEXCAN2_RXIMR10                         CAN_RXIMR_REG(CAN2_BASE_PTR,10)
#define FLEXCAN2_RXIMR11                         CAN_RXIMR_REG(CAN2_BASE_PTR,11)
#define FLEXCAN2_RXIMR12                         CAN_RXIMR_REG(CAN2_BASE_PTR,12)
#define FLEXCAN2_RXIMR13                         CAN_RXIMR_REG(CAN2_BASE_PTR,13)
#define FLEXCAN2_RXIMR14                         CAN_RXIMR_REG(CAN2_BASE_PTR,14)
#define FLEXCAN2_RXIMR15                         CAN_RXIMR_REG(CAN2_BASE_PTR,15)
#define FLEXCAN2_RXIMR16                         CAN_RXIMR_REG(CAN2_BASE_PTR,16)
#define FLEXCAN2_RXIMR17                         CAN_RXIMR_REG(CAN2_BASE_PTR,17)
#define FLEXCAN2_RXIMR18                         CAN_RXIMR_REG(CAN2_BASE_PTR,18)
#define FLEXCAN2_RXIMR19                         CAN_RXIMR_REG(CAN2_BASE_PTR,19)
#define FLEXCAN2_RXIMR20                         CAN_RXIMR_REG(CAN2_BASE_PTR,20)
#define FLEXCAN2_RXIMR21                         CAN_RXIMR_REG(CAN2_BASE_PTR,21)
#define FLEXCAN2_RXIMR22                         CAN_RXIMR_REG(CAN2_BASE_PTR,22)
#define FLEXCAN2_RXIMR23                         CAN_RXIMR_REG(CAN2_BASE_PTR,23)
#define FLEXCAN2_RXIMR24                         CAN_RXIMR_REG(CAN2_BASE_PTR,24)
#define FLEXCAN2_RXIMR25                         CAN_RXIMR_REG(CAN2_BASE_PTR,25)
#define FLEXCAN2_RXIMR26                         CAN_RXIMR_REG(CAN2_BASE_PTR,26)
#define FLEXCAN2_RXIMR27                         CAN_RXIMR_REG(CAN2_BASE_PTR,27)
#define FLEXCAN2_RXIMR28                         CAN_RXIMR_REG(CAN2_BASE_PTR,28)
#define FLEXCAN2_RXIMR29                         CAN_RXIMR_REG(CAN2_BASE_PTR,29)
#define FLEXCAN2_RXIMR30                         CAN_RXIMR_REG(CAN2_BASE_PTR,30)
#define FLEXCAN2_RXIMR31                         CAN_RXIMR_REG(CAN2_BASE_PTR,31)
#define FLEXCAN2_RXIMR32                         CAN_RXIMR_REG(CAN2_BASE_PTR,32)
#define FLEXCAN2_RXIMR33                         CAN_RXIMR_REG(CAN2_BASE_PTR,33)
#define FLEXCAN2_RXIMR34                         CAN_RXIMR_REG(CAN2_BASE_PTR,34)
#define FLEXCAN2_RXIMR35                         CAN_RXIMR_REG(CAN2_BASE_PTR,35)
#define FLEXCAN2_RXIMR36                         CAN_RXIMR_REG(CAN2_BASE_PTR,36)
#define FLEXCAN2_RXIMR37                         CAN_RXIMR_REG(CAN2_BASE_PTR,37)
#define FLEXCAN2_RXIMR38                         CAN_RXIMR_REG(CAN2_BASE_PTR,38)
#define FLEXCAN2_RXIMR39                         CAN_RXIMR_REG(CAN2_BASE_PTR,39)
#define FLEXCAN2_RXIMR40                         CAN_RXIMR_REG(CAN2_BASE_PTR,40)
#define FLEXCAN2_RXIMR41                         CAN_RXIMR_REG(CAN2_BASE_PTR,41)
#define FLEXCAN2_RXIMR42                         CAN_RXIMR_REG(CAN2_BASE_PTR,42)
#define FLEXCAN2_RXIMR43                         CAN_RXIMR_REG(CAN2_BASE_PTR,43)
#define FLEXCAN2_RXIMR44                         CAN_RXIMR_REG(CAN2_BASE_PTR,44)
#define FLEXCAN2_RXIMR45                         CAN_RXIMR_REG(CAN2_BASE_PTR,45)
#define FLEXCAN2_RXIMR46                         CAN_RXIMR_REG(CAN2_BASE_PTR,46)
#define FLEXCAN2_RXIMR47                         CAN_RXIMR_REG(CAN2_BASE_PTR,47)
#define FLEXCAN2_RXIMR48                         CAN_RXIMR_REG(CAN2_BASE_PTR,48)
#define FLEXCAN2_RXIMR49                         CAN_RXIMR_REG(CAN2_BASE_PTR,49)
#define FLEXCAN2_RXIMR50                         CAN_RXIMR_REG(CAN2_BASE_PTR,50)
#define FLEXCAN2_RXIMR51                         CAN_RXIMR_REG(CAN2_BASE_PTR,51)
#define FLEXCAN2_RXIMR52                         CAN_RXIMR_REG(CAN2_BASE_PTR,52)
#define FLEXCAN2_RXIMR53                         CAN_RXIMR_REG(CAN2_BASE_PTR,53)
#define FLEXCAN2_RXIMR54                         CAN_RXIMR_REG(CAN2_BASE_PTR,54)
#define FLEXCAN2_RXIMR55                         CAN_RXIMR_REG(CAN2_BASE_PTR,55)
#define FLEXCAN2_RXIMR56                         CAN_RXIMR_REG(CAN2_BASE_PTR,56)
#define FLEXCAN2_RXIMR57                         CAN_RXIMR_REG(CAN2_BASE_PTR,57)
#define FLEXCAN2_RXIMR58                         CAN_RXIMR_REG(CAN2_BASE_PTR,58)
#define FLEXCAN2_RXIMR59                         CAN_RXIMR_REG(CAN2_BASE_PTR,59)
#define FLEXCAN2_RXIMR60                         CAN_RXIMR_REG(CAN2_BASE_PTR,60)
#define FLEXCAN2_RXIMR61                         CAN_RXIMR_REG(CAN2_BASE_PTR,61)
#define FLEXCAN2_RXIMR62                         CAN_RXIMR_REG(CAN2_BASE_PTR,62)
#define FLEXCAN2_RXIMR63                         CAN_RXIMR_REG(CAN2_BASE_PTR,63)
#define FLEXCAN2_GFWR                            CAN_GFWR_REG(CAN2_BASE_PTR)

