AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name REG3 - DCDC Register 3 */
#define DCDC_REG3_TRG_MASK                       (0x1FU)
#define DCDC_REG3_TRG_SHIFT                      (0U)
#define DCDC_REG3_TRG(x)                         (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_TRG_SHIFT)) & DCDC_REG3_TRG_MASK)
#define DCDC_REG3_TARGET_LP_MASK                 (0x700U)
#define DCDC_REG3_TARGET_LP_SHIFT                (8U)
#define DCDC_REG3_TARGET_LP(x)                   (((uint32_t)(((uint32_t)(x)) << DCDC_REG3_TARGET_LP_SHIFT)) & DCDC_REG3_TARGET_LP_MASK)
#define DCDC_REG3_MINPWR_DC_HALFCLK_MASK         (0x1000000U)
#define DCDC_REG3_MINPWR_DC_HALFCLK_SHIFT        (24U)
#define DCDC_REG3_MISC_DELAY_TIMING_MASK         (0x8000000U)
#define DCDC_REG3_MISC_DELAY_TIMING_SHIFT        (27U)
#define DCDC_REG3_MISC_DISABLEFET_LOGIC_MASK     (0x10000000U)
#define DCDC_REG3_MISC_DISABLEFET_LOGIC_SHIFT    (28U)
#define DCDC_REG3_DISABLE_STEP_MASK              (0x40000000U)
#define DCDC_REG3_DISABLE_STEP_SHIFT             (30U)


/*!
 * @}
 */ /* end of group DCDC_Register_Masks */


/* DCDC - Peripheral instance base addresses */
/** Peripheral DCDC base pointer */
#define DCDC_BASE_PTR                            ((DCDC_MemMapPtr)0x40080000u)
/** Array initializer of DCDC peripheral base pointers */
#define DCDC_BASE_PTRS                           { DCDC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- DCDC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCDC_Register_Accessor_Macros DCDC - Register accessor macros
 * @{
 */


/* DCDC - Register instance definitions */
/* DCDC */
#define DCDC_REG0                                DCDC_REG0_REG(DCDC_BASE_PTR)
#define DCDC_REG1                                DCDC_REG1_REG(DCDC_BASE_PTR)
#define DCDC_REG2                                DCDC_REG2_REG(DCDC_BASE_PTR)
#define DCDC_REG3                                DCDC_REG3_REG(DCDC_BASE_PTR)

/*!
 * @}
 */ /* end of group DCDC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DCDC_Peripheral */


/* ----------------------------------------------------------------------------
   -- DCP
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCP_Peripheral DCP
 * @{
 */

/** DCP - Peripheral register structure */
typedef struct DCP_MemMap {
  uint32_t CTRL;                                   /**< DCP control register 0, offset: 0x0 */
  uint8_t RESERVED_0[12];
  uint32_t STAT;                                   /**< DCP status register, offset: 0x10 */
  uint8_t RESERVED_1[12];
  uint32_t CHANNELCTRL;                            /**< DCP channel control register, offset: 0x20 */
  uint8_t RESERVED_2[12];
  uint32_t CAPABILITY0;                            /**< DCP capability 0 register, offset: 0x30 */
  uint8_t RESERVED_3[12];
  uint32_t CAPABILITY1;                            /**< DCP capability 1 register, offset: 0x40 */
  uint8_t RESERVED_4[12];
  uint32_t CONTEXT;                                /**< DCP context buffer pointer, offset: 0x50 */
  uint8_t RESERVED_5[12];
  uint32_t KEY;                                    /**< DCP key index, offset: 0x60 */
  uint8_t RESERVED_6[12];
  uint32_t KEYDATA;                                /**< DCP key data, offset: 0x70 */
  uint8_t RESERVED_7[12];
  uint32_t PACKET0;                                /**< DCP work packet 0 status register, offset: 0x80 */
  uint8_t RESERVED_8[12];
  uint32_t PACKET1;                                /**< DCP work packet 1 status register, offset: 0x90 */
  uint8_t RESERVED_9[12];
  uint32_t PACKET2;                                /**< DCP work packet 2 status register, offset: 0xA0 */
  uint8_t RESERVED_10[12];
  uint32_t PACKET3;                                /**< DCP work packet 3 status register, offset: 0xB0 */
  uint8_t RESERVED_11[12];
  uint32_t PACKET4;                                /**< DCP work packet 4 status register, offset: 0xC0 */
  uint8_t RESERVED_12[12];
  uint32_t PACKET5;                                /**< DCP work packet 5 status register, offset: 0xD0 */
  uint8_t RESERVED_13[12];
  uint32_t PACKET6;                                /**< DCP work packet 6 status register, offset: 0xE0 */
  uint8_t RESERVED_14[28];
  uint32_t CH0CMDPTR;                              /**< DCP channel 0 command pointer address register, offset: 0x100 */
  uint8_t RESERVED_15[12];
  uint32_t CH0SEMA;                                /**< DCP channel 0 semaphore register, offset: 0x110 */
  uint8_t RESERVED_16[12];
  uint32_t CH0STAT;                                /**< DCP channel 0 status register, offset: 0x120 */
  uint8_t RESERVED_17[12];
  uint32_t CH0OPTS;                                /**< DCP channel 0 options register, offset: 0x130 */
  uint8_t RESERVED_18[12];
  uint32_t CH1CMDPTR;                              /**< DCP channel 1 command pointer address register, offset: 0x140 */
  uint8_t RESERVED_19[12];
  uint32_t CH1SEMA;                                /**< DCP channel 1 semaphore register, offset: 0x150 */
  uint8_t RESERVED_20[12];
  uint32_t CH1STAT;                                /**< DCP channel 1 status register, offset: 0x160 */
  uint8_t RESERVED_21[12];
  uint32_t CH1OPTS;                                /**< DCP channel 1 options register, offset: 0x170 */
  uint8_t RESERVED_22[12];
  uint32_t CH2CMDPTR;                              /**< DCP channel 2 command pointer address register, offset: 0x180 */
  uint8_t RESERVED_23[12];
  uint32_t CH2SEMA;                                /**< DCP channel 2 semaphore register, offset: 0x190 */
  uint8_t RESERVED_24[12];
  uint32_t CH2STAT;                                /**< DCP channel 2 status register, offset: 0x1A0 */
  uint8_t RESERVED_25[12];
  uint32_t CH2OPTS;                                /**< DCP channel 2 options register, offset: 0x1B0 */
  uint8_t RESERVED_26[12];
  uint32_t CH3CMDPTR;                              /**< DCP channel 3 command pointer address register, offset: 0x1C0 */
  uint8_t RESERVED_27[12];
  uint32_t CH3SEMA;                                /**< DCP channel 3 semaphore register, offset: 0x1D0 */
  uint8_t RESERVED_28[12];
  uint32_t CH3STAT;                                /**< DCP channel 3 status register, offset: 0x1E0 */
  uint8_t RESERVED_29[12];
  uint32_t CH3OPTS;                                /**< DCP channel 3 options register, offset: 0x1F0 */
  uint8_t RESERVED_30[524];
  uint32_t DBGSELECT;                              /**< DCP debug select register, offset: 0x400 */
  uint8_t RESERVED_31[12];
  uint32_t DBGDATA;                                /**< DCP debug data register, offset: 0x410 */
  uint8_t RESERVED_32[12];
  uint32_t PAGETABLE;                              /**< DCP page table register, offset: 0x420 */
  uint8_t RESERVED_33[12];
  uint32_t VERSION;                                /**< DCP version register, offset: 0x430 */
} volatile *DCP_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- DCP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCP_Register_Accessor_Macros DCP - Register accessor macros
 * @{
 */


/* DCP - Register accessors */
#define DCP_CTRL_REG(base)                       ((base)->CTRL)
#define DCP_STAT_REG(base)                       ((base)->STAT)
#define DCP_CHANNELCTRL_REG(base)                ((base)->CHANNELCTRL)
#define DCP_CAPABILITY0_REG(base)                ((base)->CAPABILITY0)
#define DCP_CAPABILITY1_REG(base)                ((base)->CAPABILITY1)
#define DCP_CONTEXT_REG(base)                    ((base)->CONTEXT)
#define DCP_KEY_REG(base)                        ((base)->KEY)
#define DCP_KEYDATA_REG(base)                    ((base)->KEYDATA)
#define DCP_PACKET0_REG(base)                    ((base)->PACKET0)
#define DCP_PACKET1_REG(base)                    ((base)->PACKET1)
#define DCP_PACKET2_REG(base)                    ((base)->PACKET2)
#define DCP_PACKET3_REG(base)                    ((base)->PACKET3)
#define DCP_PACKET4_REG(base)                    ((base)->PACKET4)
#define DCP_PACKET5_REG(base)                    ((base)->PACKET5)
#define DCP_PACKET6_REG(base)                    ((base)->PACKET6)
#define DCP_CH0CMDPTR_REG(base)                  ((base)->CH0CMDPTR)
#define DCP_CH0SEMA_REG(base)                    ((base)->CH0SEMA)
#define DCP_CH0STAT_REG(base)                    ((base)->CH0STAT)
#define DCP_CH0OPTS_REG(base)                    ((base)->CH0OPTS)
#define DCP_CH1CMDPTR_REG(base)                  ((base)->CH1CMDPTR)
#define DCP_CH1SEMA_REG(base)                    ((base)->CH1SEMA)
#define DCP_CH1STAT_REG(base)                    ((base)->CH1STAT)
#define DCP_CH1OPTS_REG(base)                    ((base)->CH1OPTS)
#define DCP_CH2CMDPTR_REG(base)                  ((base)->CH2CMDPTR)
#define DCP_CH2SEMA_REG(base)                    ((base)->CH2SEMA)
#define DCP_CH2STAT_REG(base)                    ((base)->CH2STAT)
#define DCP_CH2OPTS_REG(base)                    ((base)->CH2OPTS)
#define DCP_CH3CMDPTR_REG(base)                  ((base)->CH3CMDPTR)
#define DCP_CH3SEMA_REG(base)                    ((base)->CH3SEMA)
#define DCP_CH3STAT_REG(base)                    ((base)->CH3STAT)
#define DCP_CH3OPTS_REG(base)                    ((base)->CH3OPTS)
#define DCP_DBGSELECT_REG(base)                  ((base)->DBGSELECT)
#define DCP_DBGDATA_REG(base)                    ((base)->DBGDATA)
#define DCP_PAGETABLE_REG(base)                  ((base)->PAGETABLE)
#define DCP_VERSION_REG(base)                    ((base)->VERSION)

/*!
 * @}
 */ /* end of group DCP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- DCP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCP_Register_Masks DCP Register Masks
 * @{
 */

/*! @name CTRL - DCP control register 0 */
#define DCP_CTRL_CHANNEL_INTERRUPT_ENABLE_MASK   (0xFFU)
#define DCP_CTRL_CHANNEL_INTERRUPT_ENABLE_SHIFT  (0U)
#define DCP_CTRL_CHANNEL_INTERRUPT_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << DCP_CTRL_CHANNEL_INTERRUPT_ENABLE_SHIFT)) & DCP_CTRL_CHANNEL_INTERRUPT_ENABLE_MASK)
#define DCP_CTRL_RSVD_CSC_INTERRUPT_ENABLE_MASK  (0x100U)
#define DCP_CTRL_RSVD_CSC_INTERRUPT_ENABLE_SHIFT (8U)
#define DCP_CTRL_ENABLE_CONTEXT_SWITCHING_MASK   (0x200000U)
#define DCP_CTRL_ENABLE_CONTEXT_SWITCHING_SHIFT  (21U)
#define DCP_CTRL_ENABLE_CONTEXT_CACHING_MASK     (0x400000U)
#define DCP_CTRL_ENABLE_CONTEXT_CACHING_SHIFT    (22U)
#define DCP_CTRL_GATHER_RESIDUAL_WRITES_MASK     (0x800000U)
#define DCP_CTRL_GATHER_RESIDUAL_WRITES_SHIFT    (23U)
#define DCP_CTRL_PRESENT_SHA_MASK                (0x10000000U)
#define DCP_CTRL_PRESENT_SHA_SHIFT               (28U)
#define DCP_CTRL_PRESENT_CRYPTO_MASK             (0x20000000U)
#define DCP_CTRL_PRESENT_CRYPTO_SHIFT            (29U)
#define DCP_CTRL_CLKGATE_MASK                    (0x40000000U)
#define DCP_CTRL_CLKGATE_SHIFT                   (30U)
#define DCP_CTRL_SFTRST_MASK                     (0x80000000U)
#define DCP_CTRL_SFTRST_SHIFT                    (31U)

/*! @name STAT - DCP status register */
#define DCP_STAT_IRQ_MASK                        (0xFU)
#define DCP_STAT_IRQ_SHIFT                       (0U)
#define DCP_STAT_IRQ(x)                          (((uint32_t)(((uint32_t)(x)) << DCP_STAT_IRQ_SHIFT)) & DCP_STAT_IRQ_MASK)
#define DCP_STAT_RSVD_IRQ_MASK                   (0x100U)
#define DCP_STAT_RSVD_IRQ_SHIFT                  (8U)
#define DCP_STAT_READY_CHANNELS_MASK             (0xFF0000U)
#define DCP_STAT_READY_CHANNELS_SHIFT            (16U)
#define DCP_STAT_READY_CHANNELS(x)               (((uint32_t)(((uint32_t)(x)) << DCP_STAT_READY_CHANNELS_SHIFT)) & DCP_STAT_READY_CHANNELS_MASK)
#define DCP_STAT_CUR_CHANNEL_MASK                (0xF000000U)
#define DCP_STAT_CUR_CHANNEL_SHIFT               (24U)
#define DCP_STAT_CUR_CHANNEL(x)                  (((uint32_t)(((uint32_t)(x)) << DCP_STAT_CUR_CHANNEL_SHIFT)) & DCP_STAT_CUR_CHANNEL_MASK)
#define DCP_STAT_OTP_KEY_READY_MASK              (0x10000000U)
#define DCP_STAT_OTP_KEY_READY_SHIFT             (28U)

/*! @name CHANNELCTRL - DCP channel control register */
#define DCP_CHANNELCTRL_ENABLE_CHANNEL_MASK      (0xFFU)
#define DCP_CHANNELCTRL_ENABLE_CHANNEL_SHIFT     (0U)
#define DCP_CHANNELCTRL_ENABLE_CHANNEL(x)        (((uint32_t)(((uint32_t)(x)) << DCP_CHANNELCTRL_ENABLE_CHANNEL_SHIFT)) & DCP_CHANNELCTRL_ENABLE_CHANNEL_MASK)
#define DCP_CHANNELCTRL_HIGH_PRIORITY_CHANNEL_MASK (0xFF00U)
#define DCP_CHANNELCTRL_HIGH_PRIORITY_CHANNEL_SHIFT (8U)
#define DCP_CHANNELCTRL_HIGH_PRIORITY_CHANNEL(x) (((uint32_t)(((uint32_t)(x)) << DCP_CHANNELCTRL_HIGH_PRIORITY_CHANNEL_SHIFT)) & DCP_CHANNELCTRL_HIGH_PRIORITY_CHANNEL_MASK)
#define DCP_CHANNELCTRL_CH0_IRQ_MERGED_MASK      (0x10000U)
#define DCP_CHANNELCTRL_CH0_IRQ_MERGED_SHIFT     (16U)
#define DCP_CHANNELCTRL_RSVD_MASK                (0xFFFE0000U)
#define DCP_CHANNELCTRL_RSVD_SHIFT               (17U)
#define DCP_CHANNELCTRL_RSVD(x)                  (((uint32_t)(((uint32_t)(x)) << DCP_CHANNELCTRL_RSVD_SHIFT)) & DCP_CHANNELCTRL_RSVD_MASK)

/*! @name CAPABILITY0 - DCP capability 0 register */
#define DCP_CAPABILITY0_NUM_KEYS_MASK            (0xFFU)
#define DCP_CAPABILITY0_NUM_KEYS_SHIFT           (0U)
#define DCP_CAPABILITY0_NUM_KEYS(x)              (((uint32_t)(((uint32_t)(x)) << DCP_CAPABILITY0_NUM_KEYS_SHIFT)) & DCP_CAPABILITY0_NUM_KEYS_MASK)
#define DCP_CAPABILITY0_NUM_CHANNELS_MASK        (0xF00U)
#define DCP_CAPABILITY0_NUM_CHANNELS_SHIFT       (8U)
#define DCP_CAPABILITY0_NUM_CHANNELS(x)          (((uint32_t)(((uint32_t)(x)) << DCP_CAPABILITY0_NUM_CHANNELS_SHIFT)) & DCP_CAPABILITY0_NUM_CHANNELS_MASK)
#define DCP_CAPABILITY0_RSVD_MASK                (0x1FFFF000U)
#define DCP_CAPABILITY0_RSVD_SHIFT               (12U)
#define DCP_CAPABILITY0_RSVD(x)                  (((uint32_t)(((uint32_t)(x)) << DCP_CAPABILITY0_RSVD_SHIFT)) & DCP_CAPABILITY0_RSVD_MASK)
#define DCP_CAPABILITY0_DISABLE_UNIQUE_KEY_MASK  (0x20000000U)
#define DCP_CAPABILITY0_DISABLE_UNIQUE_KEY_SHIFT (29U)
#define DCP_CAPABILITY0_DISABLE_DECRYPT_MASK     (0x80000000U)
#define DCP_CAPABILITY0_DISABLE_DECRYPT_SHIFT    (31U)

