AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name VERSION - DCP version register */
#define DCP_VERSION_STEP_MASK                    (0xFFFFU)
#define DCP_VERSION_STEP_SHIFT                   (0U)
#define DCP_VERSION_STEP(x)                      (((uint32_t)(((uint32_t)(x)) << DCP_VERSION_STEP_SHIFT)) & DCP_VERSION_STEP_MASK)
#define DCP_VERSION_MINOR_MASK                   (0xFF0000U)
#define DCP_VERSION_MINOR_SHIFT                  (16U)
#define DCP_VERSION_MINOR(x)                     (((uint32_t)(((uint32_t)(x)) << DCP_VERSION_MINOR_SHIFT)) & DCP_VERSION_MINOR_MASK)
#define DCP_VERSION_MAJOR_MASK                   (0xFF000000U)
#define DCP_VERSION_MAJOR_SHIFT                  (24U)
#define DCP_VERSION_MAJOR(x)                     (((uint32_t)(((uint32_t)(x)) << DCP_VERSION_MAJOR_SHIFT)) & DCP_VERSION_MAJOR_MASK)


/*!
 * @}
 */ /* end of group DCP_Register_Masks */


/* DCP - Peripheral instance base addresses */
/** Peripheral DCP base pointer */
#define DCP_BASE_PTR                             ((DCP_MemMapPtr)0x402FC000u)
/** Array initializer of DCP peripheral base pointers */
#define DCP_BASE_PTRS                            { DCP_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- DCP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCP_Register_Accessor_Macros DCP - Register accessor macros
 * @{
 */


/* DCP - Register instance definitions */
/* DCP */
#define DCP_CTRL                                 DCP_CTRL_REG(DCP_BASE_PTR)
#define DCP_STAT                                 DCP_STAT_REG(DCP_BASE_PTR)
#define DCP_CHANNELCTRL                          DCP_CHANNELCTRL_REG(DCP_BASE_PTR)
#define DCP_CAPABILITY0                          DCP_CAPABILITY0_REG(DCP_BASE_PTR)
#define DCP_CAPABILITY1                          DCP_CAPABILITY1_REG(DCP_BASE_PTR)
#define DCP_CONTEXT                              DCP_CONTEXT_REG(DCP_BASE_PTR)
#define DCP_KEY                                  DCP_KEY_REG(DCP_BASE_PTR)
#define DCP_KEYDATA                              DCP_KEYDATA_REG(DCP_BASE_PTR)
#define DCP_PACKET0                              DCP_PACKET0_REG(DCP_BASE_PTR)
#define DCP_PACKET1                              DCP_PACKET1_REG(DCP_BASE_PTR)
#define DCP_PACKET2                              DCP_PACKET2_REG(DCP_BASE_PTR)
#define DCP_PACKET3                              DCP_PACKET3_REG(DCP_BASE_PTR)
#define DCP_PACKET4                              DCP_PACKET4_REG(DCP_BASE_PTR)
#define DCP_PACKET5                              DCP_PACKET5_REG(DCP_BASE_PTR)
#define DCP_PACKET6                              DCP_PACKET6_REG(DCP_BASE_PTR)
#define DCP_CH0CMDPTR                            DCP_CH0CMDPTR_REG(DCP_BASE_PTR)
#define DCP_CH0SEMA                              DCP_CH0SEMA_REG(DCP_BASE_PTR)
#define DCP_CH0STAT                              DCP_CH0STAT_REG(DCP_BASE_PTR)
#define DCP_CH0OPTS                              DCP_CH0OPTS_REG(DCP_BASE_PTR)
#define DCP_CH1CMDPTR                            DCP_CH1CMDPTR_REG(DCP_BASE_PTR)
#define DCP_CH1SEMA                              DCP_CH1SEMA_REG(DCP_BASE_PTR)
#define DCP_CH1STAT                              DCP_CH1STAT_REG(DCP_BASE_PTR)
#define DCP_CH1OPTS                              DCP_CH1OPTS_REG(DCP_BASE_PTR)
#define DCP_CH2CMDPTR                            DCP_CH2CMDPTR_REG(DCP_BASE_PTR)
#define DCP_CH2SEMA                              DCP_CH2SEMA_REG(DCP_BASE_PTR)
#define DCP_CH2STAT                              DCP_CH2STAT_REG(DCP_BASE_PTR)
#define DCP_CH2OPTS                              DCP_CH2OPTS_REG(DCP_BASE_PTR)
#define DCP_CH3CMDPTR                            DCP_CH3CMDPTR_REG(DCP_BASE_PTR)
#define DCP_CH3SEMA                              DCP_CH3SEMA_REG(DCP_BASE_PTR)
#define DCP_CH3STAT                              DCP_CH3STAT_REG(DCP_BASE_PTR)
#define DCP_CH3OPTS                              DCP_CH3OPTS_REG(DCP_BASE_PTR)
#define DCP_DBGSELECT                            DCP_DBGSELECT_REG(DCP_BASE_PTR)
#define DCP_DBGDATA                              DCP_DBGDATA_REG(DCP_BASE_PTR)
#define DCP_PAGETABLE                            DCP_PAGETABLE_REG(DCP_BASE_PTR)
#define DCP_VERSION                              DCP_VERSION_REG(DCP_BASE_PTR)

/*!
 * @}
 */ /* end of group DCP_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DCP_Peripheral */


/* ----------------------------------------------------------------------------
   -- DMA
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral DMA
 * @{
 */

/** DMA - Peripheral register structure */
typedef struct DMA_MemMap {
  uint32_t CR;                                     /**< Control Register, offset: 0x0 */
  uint32_t ES;                                     /**< Error Status Register, offset: 0x4 */
  uint8_t RESERVED_0[4];
  uint32_t ERQ;                                    /**< Enable Request Register, offset: 0xC */
  uint8_t RESERVED_1[4];
  uint32_t EEI;                                    /**< Enable Error Interrupt Register, offset: 0x14 */
  uint8_t CEEI;                                    /**< Clear Enable Error Interrupt Register, offset: 0x18 */
  uint8_t SEEI;                                    /**< Set Enable Error Interrupt Register, offset: 0x19 */
  uint8_t CERQ;                                    /**< Clear Enable Request Register, offset: 0x1A */
  uint8_t SERQ;                                    /**< Set Enable Request Register, offset: 0x1B */
  uint8_t CDNE;                                    /**< Clear DONE Status Bit Register, offset: 0x1C */
  uint8_t SSRT;                                    /**< Set START Bit Register, offset: 0x1D */
  uint8_t CERR;                                    /**< Clear Error Register, offset: 0x1E */
  uint8_t CINT;                                    /**< Clear Interrupt Request Register, offset: 0x1F */
  uint8_t RESERVED_2[4];
  uint32_t INT;                                    /**< Interrupt Request Register, offset: 0x24 */
  uint8_t RESERVED_3[4];
  uint32_t ERR;                                    /**< Error Register, offset: 0x2C */
  uint8_t RESERVED_4[4];
  uint32_t HRS;                                    /**< Hardware Request Status Register, offset: 0x34 */
  uint8_t RESERVED_5[12];
  uint32_t EARS;                                   /**< Enable Asynchronous Request in Stop Register, offset: 0x44 */
  uint8_t RESERVED_6[184];
  uint8_t DCHPRI3;                                 /**< Channel n Priority Register, offset: 0x100 */
  uint8_t DCHPRI2;                                 /**< Channel n Priority Register, offset: 0x101 */
  uint8_t DCHPRI1;                                 /**< Channel n Priority Register, offset: 0x102 */
  uint8_t DCHPRI0;                                 /**< Channel n Priority Register, offset: 0x103 */
  uint8_t DCHPRI7;                                 /**< Channel n Priority Register, offset: 0x104 */
  uint8_t DCHPRI6;                                 /**< Channel n Priority Register, offset: 0x105 */
  uint8_t DCHPRI5;                                 /**< Channel n Priority Register, offset: 0x106 */
  uint8_t DCHPRI4;                                 /**< Channel n Priority Register, offset: 0x107 */
  uint8_t DCHPRI11;                                /**< Channel n Priority Register, offset: 0x108 */
  uint8_t DCHPRI10;                                /**< Channel n Priority Register, offset: 0x109 */
  uint8_t DCHPRI9;                                 /**< Channel n Priority Register, offset: 0x10A */
  uint8_t DCHPRI8;                                 /**< Channel n Priority Register, offset: 0x10B */
  uint8_t DCHPRI15;                                /**< Channel n Priority Register, offset: 0x10C */
  uint8_t DCHPRI14;                                /**< Channel n Priority Register, offset: 0x10D */
  uint8_t DCHPRI13;                                /**< Channel n Priority Register, offset: 0x10E */
  uint8_t DCHPRI12;                                /**< Channel n Priority Register, offset: 0x10F */
  uint8_t DCHPRI19;                                /**< Channel n Priority Register, offset: 0x110 */
  uint8_t DCHPRI18;                                /**< Channel n Priority Register, offset: 0x111 */
  uint8_t DCHPRI17;                                /**< Channel n Priority Register, offset: 0x112 */
  uint8_t DCHPRI16;                                /**< Channel n Priority Register, offset: 0x113 */
  uint8_t DCHPRI23;                                /**< Channel n Priority Register, offset: 0x114 */
  uint8_t DCHPRI22;                                /**< Channel n Priority Register, offset: 0x115 */
  uint8_t DCHPRI21;                                /**< Channel n Priority Register, offset: 0x116 */
  uint8_t DCHPRI20;                                /**< Channel n Priority Register, offset: 0x117 */
  uint8_t DCHPRI27;                                /**< Channel n Priority Register, offset: 0x118 */
  uint8_t DCHPRI26;                                /**< Channel n Priority Register, offset: 0x119 */
  uint8_t DCHPRI25;                                /**< Channel n Priority Register, offset: 0x11A */
  uint8_t DCHPRI24;                                /**< Channel n Priority Register, offset: 0x11B */
  uint8_t DCHPRI31;                                /**< Channel n Priority Register, offset: 0x11C */
  uint8_t DCHPRI30;                                /**< Channel n Priority Register, offset: 0x11D */
  uint8_t DCHPRI29;                                /**< Channel n Priority Register, offset: 0x11E */
  uint8_t DCHPRI28;                                /**< Channel n Priority Register, offset: 0x11F */
  uint8_t RESERVED_7[3808];
  struct {                                         /* offset: 0x1000, array step: 0x20 */
    uint32_t SADDR;                                  /**< TCD Source Address, array offset: 0x1000, array step: 0x20 */
    uint16_t SOFF;                                   /**< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20 */
    uint16_t ATTR;                                   /**< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20 */
    union {                                          /* offset: 0x1008, array step: 0x20 */
      uint32_t NBYTES_MLNO;                            /**< TCD Minor Byte Count (Minor Loop Mapping Disabled), array offset: 0x1008, array step: 0x20 */
      uint32_t NBYTES_MLOFFNO;                         /**< TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled), array offset: 0x1008, array step: 0x20 */
      uint32_t NBYTES_MLOFFYES;                        /**< TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled), array offset: 0x1008, array step: 0x20 */
    };
    uint32_t SLAST;                                  /**< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20 */
    uint32_t DADDR;                                  /**< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
    uint16_t DOFF;                                   /**< TCD Signed Destination Address Offset, array offset: 0x1014, array step: 0x20 */
    union {                                          /* offset: 0x1016, array step: 0x20 */
      uint16_t CITER_ELINKNO;                          /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x1016, array step: 0x20 */
      uint16_t CITER_ELINKYES;                         /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x1016, array step: 0x20 */
    };
    uint32_t DLAST_SGA;                              /**< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset: 0x1018, array step: 0x20 */
    uint16_t CSR;                                    /**< TCD Control and Status, array offset: 0x101C, array step: 0x20 */
    union {                                          /* offset: 0x101E, array step: 0x20 */
      uint16_t BITER_ELINKNO;                          /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x101E, array step: 0x20 */
      uint16_t BITER_ELINKYES;                         /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x101E, array step: 0x20 */
    };
  } TCD[32];
} volatile *DMA_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- DMA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Accessor_Macros DMA - Register accessor macros
 * @{
 */


