AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_BITER_ELINKYES_BITER_MASK            (0x1FFU)
#define DMA_BITER_ELINKYES_BITER_SHIFT           (0U)
#define DMA_BITER_ELINKYES_BITER(x)              (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_BITER_SHIFT)) & DMA_BITER_ELINKYES_BITER_MASK)
#define DMA_BITER_ELINKYES_LINKCH_MASK           (0x3E00U)
#define DMA_BITER_ELINKYES_LINKCH_SHIFT          (9U)
#define DMA_BITER_ELINKYES_LINKCH(x)             (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_BITER_ELINKYES_LINKCH_MASK)
#define DMA_BITER_ELINKYES_ELINK_MASK            (0x8000U)
#define DMA_BITER_ELINKYES_ELINK_SHIFT           (15U)

/* The count of DMA_BITER_ELINKYES */
#define DMA_BITER_ELINKYES_COUNT                 (32U)


/*!
 * @}
 */ /* end of group DMA_Register_Masks */


/* DMA - Peripheral instance base addresses */
/** Peripheral DMA0 base pointer */
#define DMA0_BASE_PTR                            ((DMA_MemMapPtr)0x400E8000u)
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { DMA0_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- DMA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Accessor_Macros DMA - Register accessor macros
 * @{
 */


/* DMA - Register instance definitions */
/* DMA0 */
#define DMA0_CR                                  DMA_CR_REG(DMA0_BASE_PTR)
#define DMA0_ES                                  DMA_ES_REG(DMA0_BASE_PTR)
#define DMA0_ERQ                                 DMA_ERQ_REG(DMA0_BASE_PTR)
#define DMA0_EEI                                 DMA_EEI_REG(DMA0_BASE_PTR)
#define DMA0_CEEI                                DMA_CEEI_REG(DMA0_BASE_PTR)
#define DMA0_SEEI                                DMA_SEEI_REG(DMA0_BASE_PTR)
#define DMA0_CERQ                                DMA_CERQ_REG(DMA0_BASE_PTR)
#define DMA0_SERQ                                DMA_SERQ_REG(DMA0_BASE_PTR)
#define DMA0_CDNE                                DMA_CDNE_REG(DMA0_BASE_PTR)
#define DMA0_SSRT                                DMA_SSRT_REG(DMA0_BASE_PTR)
#define DMA0_CERR                                DMA_CERR_REG(DMA0_BASE_PTR)
#define DMA0_CINT                                DMA_CINT_REG(DMA0_BASE_PTR)
#define DMA0_INT                                 DMA_INT_REG(DMA0_BASE_PTR)
#define DMA0_ERR                                 DMA_ERR_REG(DMA0_BASE_PTR)
#define DMA0_HRS                                 DMA_HRS_REG(DMA0_BASE_PTR)
#define DMA0_EARS                                DMA_EARS_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI3                             DMA_DCHPRI3_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI2                             DMA_DCHPRI2_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI1                             DMA_DCHPRI1_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI0                             DMA_DCHPRI0_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI7                             DMA_DCHPRI7_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI6                             DMA_DCHPRI6_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI5                             DMA_DCHPRI5_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI4                             DMA_DCHPRI4_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI11                            DMA_DCHPRI11_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI10                            DMA_DCHPRI10_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI9                             DMA_DCHPRI9_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI8                             DMA_DCHPRI8_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI15                            DMA_DCHPRI15_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI14                            DMA_DCHPRI14_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI13                            DMA_DCHPRI13_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI12                            DMA_DCHPRI12_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI19                            DMA_DCHPRI19_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI18                            DMA_DCHPRI18_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI17                            DMA_DCHPRI17_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI16                            DMA_DCHPRI16_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI23                            DMA_DCHPRI23_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI22                            DMA_DCHPRI22_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI21                            DMA_DCHPRI21_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI20                            DMA_DCHPRI20_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI27                            DMA_DCHPRI27_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI26                            DMA_DCHPRI26_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI25                            DMA_DCHPRI25_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI24                            DMA_DCHPRI24_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI31                            DMA_DCHPRI31_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI30                            DMA_DCHPRI30_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI29                            DMA_DCHPRI29_REG(DMA0_BASE_PTR)
#define DMA0_DCHPRI28                            DMA_DCHPRI28_REG(DMA0_BASE_PTR)
#define DMA0_TCD0_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD0_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,0)
#define DMA0_TCD1_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD1_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,1)
#define DMA0_TCD2_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD2_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,2)
#define DMA0_TCD3_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD3_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,3)
#define DMA0_TCD4_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD4_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,4)
#define DMA0_TCD5_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD5_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,5)
#define DMA0_TCD6_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD6_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,6)
#define DMA0_TCD7_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD7_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,7)
#define DMA0_TCD8_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD8_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,8)
#define DMA0_TCD9_SADDR                          DMA_SADDR_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_SOFF                           DMA_SOFF_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_ATTR                           DMA_ATTR_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_NBYTES_MLNO                    DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_NBYTES_MLOFFNO                 DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_NBYTES_MLOFFYES                DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_SLAST                          DMA_SLAST_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_DADDR                          DMA_DADDR_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_DOFF                           DMA_DOFF_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_CITER_ELINKNO                  DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_CITER_ELINKYES                 DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_DLASTSGA                       DMA_DLAST_SGA_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_CSR                            DMA_CSR_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_BITER_ELINKNO                  DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD9_BITER_ELINKYES                 DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,9)
#define DMA0_TCD10_SADDR                         DMA_SADDR_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_SOFF                          DMA_SOFF_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_ATTR                          DMA_ATTR_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_NBYTES_MLNO                   DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_NBYTES_MLOFFNO                DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_NBYTES_MLOFFYES               DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_SLAST                         DMA_SLAST_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_DADDR                         DMA_DADDR_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_DOFF                          DMA_DOFF_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_CITER_ELINKNO                 DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_CITER_ELINKYES                DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_DLASTSGA                      DMA_DLAST_SGA_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_CSR                           DMA_CSR_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_BITER_ELINKNO                 DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD10_BITER_ELINKYES                DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,10)
#define DMA0_TCD11_SADDR                         DMA_SADDR_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_SOFF                          DMA_SOFF_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_ATTR                          DMA_ATTR_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_NBYTES_MLNO                   DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_NBYTES_MLOFFNO                DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_NBYTES_MLOFFYES               DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_SLAST                         DMA_SLAST_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_DADDR                         DMA_DADDR_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_DOFF                          DMA_DOFF_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_CITER_ELINKNO                 DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_CITER_ELINKYES                DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_DLASTSGA                      DMA_DLAST_SGA_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_CSR                           DMA_CSR_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_BITER_ELINKNO                 DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD11_BITER_ELINKYES                DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,11)
#define DMA0_TCD12_SADDR                         DMA_SADDR_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_SOFF                          DMA_SOFF_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_ATTR                          DMA_ATTR_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_NBYTES_MLNO                   DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_NBYTES_MLOFFNO                DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_NBYTES_MLOFFYES               DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_SLAST                         DMA_SLAST_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_DADDR                         DMA_DADDR_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_DOFF                          DMA_DOFF_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_CITER_ELINKNO                 DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_CITER_ELINKYES                DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_DLASTSGA                      DMA_DLAST_SGA_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_CSR                           DMA_CSR_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_BITER_ELINKNO                 DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD12_BITER_ELINKYES                DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,12)
#define DMA0_TCD13_SADDR                         DMA_SADDR_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_SOFF                          DMA_SOFF_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_ATTR                          DMA_ATTR_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_NBYTES_MLNO                   DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_NBYTES_MLOFFNO                DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_NBYTES_MLOFFYES               DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_SLAST                         DMA_SLAST_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_DADDR                         DMA_DADDR_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_DOFF                          DMA_DOFF_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_CITER_ELINKNO                 DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_CITER_ELINKYES                DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_DLASTSGA                      DMA_DLAST_SGA_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_CSR                           DMA_CSR_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_BITER_ELINKNO                 DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD13_BITER_ELINKYES                DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,13)
#define DMA0_TCD14_SADDR                         DMA_SADDR_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_SOFF                          DMA_SOFF_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_ATTR                          DMA_ATTR_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_NBYTES_MLNO                   DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_NBYTES_MLOFFNO                DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_NBYTES_MLOFFYES               DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_SLAST                         DMA_SLAST_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_DADDR                         DMA_DADDR_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_DOFF                          DMA_DOFF_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_CITER_ELINKNO                 DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,14)
#define DMA0_TCD14_CITER_ELINKYES                DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,14)
