AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* DMA - Register array accessors */
#define DMA0_SADDR(index)                        DMA_SADDR_REG(DMA0_BASE_PTR,index)
#define DMA0_SOFF(index)                         DMA_SOFF_REG(DMA0_BASE_PTR,index)
#define DMA0_ATTR(index)                         DMA_ATTR_REG(DMA0_BASE_PTR,index)
#define DMA0_NBYTES_MLNO(index)                  DMA_NBYTES_MLNO_REG(DMA0_BASE_PTR,index)
#define DMA0_NBYTES_MLOFFNO(index)               DMA_NBYTES_MLOFFNO_REG(DMA0_BASE_PTR,index)
#define DMA0_NBYTES_MLOFFYES(index)              DMA_NBYTES_MLOFFYES_REG(DMA0_BASE_PTR,index)
#define DMA0_SLAST(index)                        DMA_SLAST_REG(DMA0_BASE_PTR,index)
#define DMA0_DADDR(index)                        DMA_DADDR_REG(DMA0_BASE_PTR,index)
#define DMA0_DOFF(index)                         DMA_DOFF_REG(DMA0_BASE_PTR,index)
#define DMA0_CITER_ELINKNO(index)                DMA_CITER_ELINKNO_REG(DMA0_BASE_PTR,index)
#define DMA0_CITER_ELINKYES(index)               DMA_CITER_ELINKYES_REG(DMA0_BASE_PTR,index)
#define DMA0_DLAST_SGA(index)                    DMA_DLAST_SGA_REG(DMA0_BASE_PTR,index)
#define DMA0_CSR(index)                          DMA_CSR_REG(DMA0_BASE_PTR,index)
#define DMA0_BITER_ELINKNO(index)                DMA_BITER_ELINKNO_REG(DMA0_BASE_PTR,index)
#define DMA0_BITER_ELINKYES(index)               DMA_BITER_ELINKYES_REG(DMA0_BASE_PTR,index)

/*!
 * @}
 */ /* end of group DMA_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DMA_Peripheral */


/* ----------------------------------------------------------------------------
   -- DMAMUX
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Peripheral DMAMUX
 * @{
 */

/** DMAMUX - Peripheral register structure */
typedef struct DMAMUX_MemMap {
  uint32_t CHCFG[32];                              /**< Channel 0 Configuration Register..Channel 31 Configuration Register, array offset: 0x0, array step: 0x4 */
} volatile *DMAMUX_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- DMAMUX - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Accessor_Macros DMAMUX - Register accessor macros
 * @{
 */


/* DMAMUX - Register accessors */
#define DMAMUX_CHCFG_REG(base,index)             ((base)->CHCFG[index])

/*!
 * @}
 */ /* end of group DMAMUX_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Masks DMAMUX Register Masks
 * @{
 */

/*! @name CHCFG - Channel 0 Configuration Register..Channel 31 Configuration Register */
#define DMAMUX_CHCFG_SOURCE_MASK                 (0x7FU)
#define DMAMUX_CHCFG_SOURCE_SHIFT                (0U)
#define DMAMUX_CHCFG_SOURCE(x)                   (((uint32_t)(((uint32_t)(x)) << DMAMUX_CHCFG_SOURCE_SHIFT)) & DMAMUX_CHCFG_SOURCE_MASK)
#define DMAMUX_CHCFG_A_ON_MASK                   (0x20000000U)
#define DMAMUX_CHCFG_A_ON_SHIFT                  (29U)
#define DMAMUX_CHCFG_TRIG_MASK                   (0x40000000U)
#define DMAMUX_CHCFG_TRIG_SHIFT                  (30U)
#define DMAMUX_CHCFG_ENBL_MASK                   (0x80000000U)
#define DMAMUX_CHCFG_ENBL_SHIFT                  (31U)

/* The count of DMAMUX_CHCFG */
#define DMAMUX_CHCFG_COUNT                       (32U)


/*!
 * @}
 */ /* end of group DMAMUX_Register_Masks */


/* DMAMUX - Peripheral instance base addresses */
/** Peripheral DMAMUX base pointer */
#define DMAMUX_BASE_PTR                          ((DMAMUX_MemMapPtr)0x400EC000u)
/** Array initializer of DMAMUX peripheral base pointers */
#define DMAMUX_BASE_PTRS                         { DMAMUX_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- DMAMUX - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Accessor_Macros DMAMUX - Register accessor macros
 * @{
 */


/* DMAMUX - Register instance definitions */
/* DMAMUX */
#define DMAMUX_CHCFG0                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,0)
#define DMAMUX_CHCFG1                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,1)
#define DMAMUX_CHCFG2                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,2)
#define DMAMUX_CHCFG3                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,3)
#define DMAMUX_CHCFG4                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,4)
#define DMAMUX_CHCFG5                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,5)
#define DMAMUX_CHCFG6                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,6)
#define DMAMUX_CHCFG7                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,7)
#define DMAMUX_CHCFG8                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,8)
#define DMAMUX_CHCFG9                            DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,9)
#define DMAMUX_CHCFG10                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,10)
#define DMAMUX_CHCFG11                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,11)
#define DMAMUX_CHCFG12                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,12)
#define DMAMUX_CHCFG13                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,13)
#define DMAMUX_CHCFG14                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,14)
#define DMAMUX_CHCFG15                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,15)
#define DMAMUX_CHCFG16                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,16)
#define DMAMUX_CHCFG17                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,17)
#define DMAMUX_CHCFG18                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,18)
#define DMAMUX_CHCFG19                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,19)
#define DMAMUX_CHCFG20                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,20)
#define DMAMUX_CHCFG21                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,21)
#define DMAMUX_CHCFG22                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,22)
#define DMAMUX_CHCFG23                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,23)
#define DMAMUX_CHCFG24                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,24)
#define DMAMUX_CHCFG25                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,25)
#define DMAMUX_CHCFG26                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,26)
#define DMAMUX_CHCFG27                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,27)
#define DMAMUX_CHCFG28                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,28)
#define DMAMUX_CHCFG29                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,29)
#define DMAMUX_CHCFG30                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,30)
#define DMAMUX_CHCFG31                           DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,31)

/* DMAMUX - Register array accessors */
#define DMAMUX_CHCFG(index)                      DMAMUX_CHCFG_REG(DMAMUX_BASE_PTR,index)

/*!
 * @}
 */ /* end of group DMAMUX_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DMAMUX_Peripheral */


/* ----------------------------------------------------------------------------
   -- ENC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENC_Peripheral ENC
 * @{
 */

/** ENC - Peripheral register structure */
typedef struct ENC_MemMap {
  uint16_t CTRL;                                   /**< Control Register, offset: 0x0 */
  uint16_t FILT;                                   /**< Input Filter Register, offset: 0x2 */
  uint16_t WTR;                                    /**< Watchdog Timeout Register, offset: 0x4 */
  uint16_t POSD;                                   /**< Position Difference Counter Register, offset: 0x6 */
  uint16_t POSDH;                                  /**< Position Difference Hold Register, offset: 0x8 */
  uint16_t REV;                                    /**< Revolution Counter Register, offset: 0xA */
  uint16_t REVH;                                   /**< Revolution Hold Register, offset: 0xC */
  uint16_t UPOS;                                   /**< Upper Position Counter Register, offset: 0xE */
  uint16_t LPOS;                                   /**< Lower Position Counter Register, offset: 0x10 */
  uint16_t UPOSH;                                  /**< Upper Position Hold Register, offset: 0x12 */
  uint16_t LPOSH;                                  /**< Lower Position Hold Register, offset: 0x14 */
  uint16_t UINIT;                                  /**< Upper Initialization Register, offset: 0x16 */
  uint16_t LINIT;                                  /**< Lower Initialization Register, offset: 0x18 */
  uint16_t IMR;                                    /**< Input Monitor Register, offset: 0x1A */
  uint16_t TST;                                    /**< Test Register, offset: 0x1C */
  uint16_t CTRL2;                                  /**< Control 2 Register, offset: 0x1E */
  uint16_t UMOD;                                   /**< Upper Modulus Register, offset: 0x20 */
  uint16_t LMOD;                                   /**< Lower Modulus Register, offset: 0x22 */
  uint16_t UCOMP;                                  /**< Upper Position Compare Register, offset: 0x24 */
  uint16_t LCOMP;                                  /**< Lower Position Compare Register, offset: 0x26 */
} volatile *ENC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- ENC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENC_Register_Accessor_Macros ENC - Register accessor macros
 * @{
 */


