AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name UINIT - Upper Initialization Register */
#define ENC_UINIT_INIT_MASK                      (0xFFFFU)
#define ENC_UINIT_INIT_SHIFT                     (0U)
#define ENC_UINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x)) << ENC_UINIT_INIT_SHIFT)) & ENC_UINIT_INIT_MASK)

/*! @name LINIT - Lower Initialization Register */
#define ENC_LINIT_INIT_MASK                      (0xFFFFU)
#define ENC_LINIT_INIT_SHIFT                     (0U)
#define ENC_LINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x)) << ENC_LINIT_INIT_SHIFT)) & ENC_LINIT_INIT_MASK)

/*! @name IMR - Input Monitor Register */
#define ENC_IMR_HOME_MASK                        (0x1U)
#define ENC_IMR_HOME_SHIFT                       (0U)
#define ENC_IMR_INDEX_MASK                       (0x2U)
#define ENC_IMR_INDEX_SHIFT                      (1U)
#define ENC_IMR_PHB_MASK                         (0x4U)
#define ENC_IMR_PHB_SHIFT                        (2U)
#define ENC_IMR_PHA_MASK                         (0x8U)
#define ENC_IMR_PHA_SHIFT                        (3U)
#define ENC_IMR_FHOM_MASK                        (0x10U)
#define ENC_IMR_FHOM_SHIFT                       (4U)
#define ENC_IMR_FIND_MASK                        (0x20U)
#define ENC_IMR_FIND_SHIFT                       (5U)
#define ENC_IMR_FPHB_MASK                        (0x40U)
#define ENC_IMR_FPHB_SHIFT                       (6U)
#define ENC_IMR_FPHA_MASK                        (0x80U)
#define ENC_IMR_FPHA_SHIFT                       (7U)

/*! @name TST - Test Register */
#define ENC_TST_TEST_COUNT_MASK                  (0xFFU)
#define ENC_TST_TEST_COUNT_SHIFT                 (0U)
#define ENC_TST_TEST_COUNT(x)                    (((uint16_t)(((uint16_t)(x)) << ENC_TST_TEST_COUNT_SHIFT)) & ENC_TST_TEST_COUNT_MASK)
#define ENC_TST_TEST_PERIOD_MASK                 (0x1F00U)
#define ENC_TST_TEST_PERIOD_SHIFT                (8U)
#define ENC_TST_TEST_PERIOD(x)                   (((uint16_t)(((uint16_t)(x)) << ENC_TST_TEST_PERIOD_SHIFT)) & ENC_TST_TEST_PERIOD_MASK)
#define ENC_TST_QDN_MASK                         (0x2000U)
#define ENC_TST_QDN_SHIFT                        (13U)
#define ENC_TST_TCE_MASK                         (0x4000U)
#define ENC_TST_TCE_SHIFT                        (14U)
#define ENC_TST_TEN_MASK                         (0x8000U)
#define ENC_TST_TEN_SHIFT                        (15U)

/*! @name CTRL2 - Control 2 Register */
#define ENC_CTRL2_UPDHLD_MASK                    (0x1U)
#define ENC_CTRL2_UPDHLD_SHIFT                   (0U)
#define ENC_CTRL2_UPDPOS_MASK                    (0x2U)
#define ENC_CTRL2_UPDPOS_SHIFT                   (1U)
#define ENC_CTRL2_MOD_MASK                       (0x4U)
#define ENC_CTRL2_MOD_SHIFT                      (2U)
#define ENC_CTRL2_DIR_MASK                       (0x8U)
#define ENC_CTRL2_DIR_SHIFT                      (3U)
#define ENC_CTRL2_RUIE_MASK                      (0x10U)
#define ENC_CTRL2_RUIE_SHIFT                     (4U)
#define ENC_CTRL2_RUIRQ_MASK                     (0x20U)
#define ENC_CTRL2_RUIRQ_SHIFT                    (5U)
#define ENC_CTRL2_ROIE_MASK                      (0x40U)
#define ENC_CTRL2_ROIE_SHIFT                     (6U)
#define ENC_CTRL2_ROIRQ_MASK                     (0x80U)
#define ENC_CTRL2_ROIRQ_SHIFT                    (7U)
#define ENC_CTRL2_REVMOD_MASK                    (0x100U)
#define ENC_CTRL2_REVMOD_SHIFT                   (8U)
#define ENC_CTRL2_OUTCTL_MASK                    (0x200U)
#define ENC_CTRL2_OUTCTL_SHIFT                   (9U)
#define ENC_CTRL2_SABIE_MASK                     (0x400U)
#define ENC_CTRL2_SABIE_SHIFT                    (10U)
#define ENC_CTRL2_SABIRQ_MASK                    (0x800U)
#define ENC_CTRL2_SABIRQ_SHIFT                   (11U)

/*! @name UMOD - Upper Modulus Register */
#define ENC_UMOD_MOD_MASK                        (0xFFFFU)
#define ENC_UMOD_MOD_SHIFT                       (0U)
#define ENC_UMOD_MOD(x)                          (((uint16_t)(((uint16_t)(x)) << ENC_UMOD_MOD_SHIFT)) & ENC_UMOD_MOD_MASK)

/*! @name LMOD - Lower Modulus Register */
#define ENC_LMOD_MOD_MASK                        (0xFFFFU)
#define ENC_LMOD_MOD_SHIFT                       (0U)
#define ENC_LMOD_MOD(x)                          (((uint16_t)(((uint16_t)(x)) << ENC_LMOD_MOD_SHIFT)) & ENC_LMOD_MOD_MASK)

/*! @name UCOMP - Upper Position Compare Register */
#define ENC_UCOMP_COMP_MASK                      (0xFFFFU)
#define ENC_UCOMP_COMP_SHIFT                     (0U)
#define ENC_UCOMP_COMP(x)                        (((uint16_t)(((uint16_t)(x)) << ENC_UCOMP_COMP_SHIFT)) & ENC_UCOMP_COMP_MASK)

/*! @name LCOMP - Lower Position Compare Register */
#define ENC_LCOMP_COMP_MASK                      (0xFFFFU)
#define ENC_LCOMP_COMP_SHIFT                     (0U)
#define ENC_LCOMP_COMP(x)                        (((uint16_t)(((uint16_t)(x)) << ENC_LCOMP_COMP_SHIFT)) & ENC_LCOMP_COMP_MASK)


/*!
 * @}
 */ /* end of group ENC_Register_Masks */


/* ENC - Peripheral instance base addresses */
/** Peripheral ENC1 base pointer */
#define ENC1_BASE_PTR                            ((ENC_MemMapPtr)0x403C8000u)
/** Peripheral ENC2 base pointer */
#define ENC2_BASE_PTR                            ((ENC_MemMapPtr)0x403CC000u)
/** Peripheral ENC3 base pointer */
#define ENC3_BASE_PTR                            ((ENC_MemMapPtr)0x403D0000u)
/** Peripheral ENC4 base pointer */
#define ENC4_BASE_PTR                            ((ENC_MemMapPtr)0x403D4000u)
/** Array initializer of ENC peripheral base pointers */
#define ENC_BASE_PTRS                            { ENC1_BASE_PTR, ENC2_BASE_PTR, ENC3_BASE_PTR, ENC4_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- ENC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENC_Register_Accessor_Macros ENC - Register accessor macros
 * @{
 */


/* ENC - Register instance definitions */
/* ENC1 */
#define ENC1_CTRL                                ENC_CTRL_REG(ENC1_BASE_PTR)
#define ENC1_FILT                                ENC_FILT_REG(ENC1_BASE_PTR)
#define ENC1_WTR                                 ENC_WTR_REG(ENC1_BASE_PTR)
#define ENC1_POSD                                ENC_POSD_REG(ENC1_BASE_PTR)
#define ENC1_POSDH                               ENC_POSDH_REG(ENC1_BASE_PTR)
#define ENC1_REV                                 ENC_REV_REG(ENC1_BASE_PTR)
#define ENC1_REVH                                ENC_REVH_REG(ENC1_BASE_PTR)
#define ENC1_UPOS                                ENC_UPOS_REG(ENC1_BASE_PTR)
#define ENC1_LPOS                                ENC_LPOS_REG(ENC1_BASE_PTR)
#define ENC1_UPOSH                               ENC_UPOSH_REG(ENC1_BASE_PTR)
#define ENC1_LPOSH                               ENC_LPOSH_REG(ENC1_BASE_PTR)
#define ENC1_UINIT                               ENC_UINIT_REG(ENC1_BASE_PTR)
#define ENC1_LINIT                               ENC_LINIT_REG(ENC1_BASE_PTR)
#define ENC1_IMR                                 ENC_IMR_REG(ENC1_BASE_PTR)
#define ENC1_TST                                 ENC_TST_REG(ENC1_BASE_PTR)
#define ENC1_CTRL2                               ENC_CTRL2_REG(ENC1_BASE_PTR)
#define ENC1_UMOD                                ENC_UMOD_REG(ENC1_BASE_PTR)
#define ENC1_LMOD                                ENC_LMOD_REG(ENC1_BASE_PTR)
#define ENC1_UCOMP                               ENC_UCOMP_REG(ENC1_BASE_PTR)
#define ENC1_LCOMP                               ENC_LCOMP_REG(ENC1_BASE_PTR)
/* ENC2 */
#define ENC2_CTRL                                ENC_CTRL_REG(ENC2_BASE_PTR)
#define ENC2_FILT                                ENC_FILT_REG(ENC2_BASE_PTR)
#define ENC2_WTR                                 ENC_WTR_REG(ENC2_BASE_PTR)
#define ENC2_POSD                                ENC_POSD_REG(ENC2_BASE_PTR)
#define ENC2_POSDH                               ENC_POSDH_REG(ENC2_BASE_PTR)
#define ENC2_REV                                 ENC_REV_REG(ENC2_BASE_PTR)
#define ENC2_REVH                                ENC_REVH_REG(ENC2_BASE_PTR)
#define ENC2_UPOS                                ENC_UPOS_REG(ENC2_BASE_PTR)
#define ENC2_LPOS                                ENC_LPOS_REG(ENC2_BASE_PTR)
#define ENC2_UPOSH                               ENC_UPOSH_REG(ENC2_BASE_PTR)
#define ENC2_LPOSH                               ENC_LPOSH_REG(ENC2_BASE_PTR)
#define ENC2_UINIT                               ENC_UINIT_REG(ENC2_BASE_PTR)
#define ENC2_LINIT                               ENC_LINIT_REG(ENC2_BASE_PTR)
#define ENC2_IMR                                 ENC_IMR_REG(ENC2_BASE_PTR)
#define ENC2_TST                                 ENC_TST_REG(ENC2_BASE_PTR)
#define ENC2_CTRL2                               ENC_CTRL2_REG(ENC2_BASE_PTR)
#define ENC2_UMOD                                ENC_UMOD_REG(ENC2_BASE_PTR)
#define ENC2_LMOD                                ENC_LMOD_REG(ENC2_BASE_PTR)
#define ENC2_UCOMP                               ENC_UCOMP_REG(ENC2_BASE_PTR)
#define ENC2_LCOMP                               ENC_LCOMP_REG(ENC2_BASE_PTR)
/* ENC3 */
#define ENC3_CTRL                                ENC_CTRL_REG(ENC3_BASE_PTR)
#define ENC3_FILT                                ENC_FILT_REG(ENC3_BASE_PTR)
#define ENC3_WTR                                 ENC_WTR_REG(ENC3_BASE_PTR)
#define ENC3_POSD                                ENC_POSD_REG(ENC3_BASE_PTR)
#define ENC3_POSDH                               ENC_POSDH_REG(ENC3_BASE_PTR)
#define ENC3_REV                                 ENC_REV_REG(ENC3_BASE_PTR)
#define ENC3_REVH                                ENC_REVH_REG(ENC3_BASE_PTR)
#define ENC3_UPOS                                ENC_UPOS_REG(ENC3_BASE_PTR)
#define ENC3_LPOS                                ENC_LPOS_REG(ENC3_BASE_PTR)
#define ENC3_UPOSH                               ENC_UPOSH_REG(ENC3_BASE_PTR)
#define ENC3_LPOSH                               ENC_LPOSH_REG(ENC3_BASE_PTR)
#define ENC3_UINIT                               ENC_UINIT_REG(ENC3_BASE_PTR)
#define ENC3_LINIT                               ENC_LINIT_REG(ENC3_BASE_PTR)
#define ENC3_IMR                                 ENC_IMR_REG(ENC3_BASE_PTR)
#define ENC3_TST                                 ENC_TST_REG(ENC3_BASE_PTR)
#define ENC3_CTRL2                               ENC_CTRL2_REG(ENC3_BASE_PTR)
#define ENC3_UMOD                                ENC_UMOD_REG(ENC3_BASE_PTR)
#define ENC3_LMOD                                ENC_LMOD_REG(ENC3_BASE_PTR)
#define ENC3_UCOMP                               ENC_UCOMP_REG(ENC3_BASE_PTR)
#define ENC3_LCOMP                               ENC_LCOMP_REG(ENC3_BASE_PTR)
/* ENC4 */
#define ENC4_CTRL                                ENC_CTRL_REG(ENC4_BASE_PTR)
#define ENC4_FILT                                ENC_FILT_REG(ENC4_BASE_PTR)
#define ENC4_WTR                                 ENC_WTR_REG(ENC4_BASE_PTR)
#define ENC4_POSD                                ENC_POSD_REG(ENC4_BASE_PTR)
#define ENC4_POSDH                               ENC_POSDH_REG(ENC4_BASE_PTR)
#define ENC4_REV                                 ENC_REV_REG(ENC4_BASE_PTR)
#define ENC4_REVH                                ENC_REVH_REG(ENC4_BASE_PTR)
#define ENC4_UPOS                                ENC_UPOS_REG(ENC4_BASE_PTR)
#define ENC4_LPOS                                ENC_LPOS_REG(ENC4_BASE_PTR)
#define ENC4_UPOSH                               ENC_UPOSH_REG(ENC4_BASE_PTR)
#define ENC4_LPOSH                               ENC_LPOSH_REG(ENC4_BASE_PTR)
#define ENC4_UINIT                               ENC_UINIT_REG(ENC4_BASE_PTR)
#define ENC4_LINIT                               ENC_LINIT_REG(ENC4_BASE_PTR)
#define ENC4_IMR                                 ENC_IMR_REG(ENC4_BASE_PTR)
#define ENC4_TST                                 ENC_TST_REG(ENC4_BASE_PTR)
#define ENC4_CTRL2                               ENC_CTRL2_REG(ENC4_BASE_PTR)
#define ENC4_UMOD                                ENC_UMOD_REG(ENC4_BASE_PTR)
#define ENC4_LMOD                                ENC_LMOD_REG(ENC4_BASE_PTR)
#define ENC4_UCOMP                               ENC_UCOMP_REG(ENC4_BASE_PTR)
#define ENC4_LCOMP                               ENC_LCOMP_REG(ENC4_BASE_PTR)

/*!
 * @}
 */ /* end of group ENC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group ENC_Peripheral */


/* ----------------------------------------------------------------------------
   -- ENET
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENET_Peripheral ENET
 * @{
 */

