AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* FLEXIO - Register instance definitions */
/* FLEXIO1 */
#define FLEXIO1_VERID                            FLEXIO_VERID_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_PARAM                            FLEXIO_PARAM_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_CTRL                             FLEXIO_CTRL_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_PIN                              FLEXIO_PIN_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTSTAT                        FLEXIO_SHIFTSTAT_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTERR                         FLEXIO_SHIFTERR_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_TIMSTAT                          FLEXIO_TIMSTAT_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTSIEN                        FLEXIO_SHIFTSIEN_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTEIEN                        FLEXIO_SHIFTEIEN_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_TIMIEN                           FLEXIO_TIMIEN_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTSDEN                        FLEXIO_SHIFTSDEN_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTSTATE                       FLEXIO_SHIFTSTATE_REG(FLEXIO1_BASE_PTR)
#define FLEXIO1_SHIFTCTL0                        FLEXIO_SHIFTCTL_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTCTL1                        FLEXIO_SHIFTCTL_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTCTL2                        FLEXIO_SHIFTCTL_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTCTL3                        FLEXIO_SHIFTCTL_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTCFG0                        FLEXIO_SHIFTCFG_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTCFG1                        FLEXIO_SHIFTCFG_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTCFG2                        FLEXIO_SHIFTCFG_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTCFG3                        FLEXIO_SHIFTCFG_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUF0                        FLEXIO_SHIFTBUF_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUF1                        FLEXIO_SHIFTBUF_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUF2                        FLEXIO_SHIFTBUF_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUF3                        FLEXIO_SHIFTBUF_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUFBIS0                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUFBIS1                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUFBIS2                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUFBIS3                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUFBYS0                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUFBYS1                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUFBYS2                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUFBYS3                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUFBBS0                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUFBBS1                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUFBBS2                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUFBBS3                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_TIMCTL0                          FLEXIO_TIMCTL_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_TIMCTL1                          FLEXIO_TIMCTL_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_TIMCTL2                          FLEXIO_TIMCTL_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_TIMCTL3                          FLEXIO_TIMCTL_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_TIMCFG0                          FLEXIO_TIMCFG_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_TIMCFG1                          FLEXIO_TIMCFG_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_TIMCFG2                          FLEXIO_TIMCFG_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_TIMCFG3                          FLEXIO_TIMCFG_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_TIMCMP0                          FLEXIO_TIMCMP_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_TIMCMP1                          FLEXIO_TIMCMP_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_TIMCMP2                          FLEXIO_TIMCMP_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_TIMCMP3                          FLEXIO_TIMCMP_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUFNBS0                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUFNBS1                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUFNBS2                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUFNBS3                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUFHWS0                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUFHWS1                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUFHWS2                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUFHWS3                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO1_BASE_PTR,3)
#define FLEXIO1_SHIFTBUFNIS0                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO1_BASE_PTR,0)
#define FLEXIO1_SHIFTBUFNIS1                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO1_BASE_PTR,1)
#define FLEXIO1_SHIFTBUFNIS2                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO1_BASE_PTR,2)
#define FLEXIO1_SHIFTBUFNIS3                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO1_BASE_PTR,3)
/* FLEXIO2 */
#define FLEXIO2_VERID                            FLEXIO_VERID_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_PARAM                            FLEXIO_PARAM_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_CTRL                             FLEXIO_CTRL_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_PIN                              FLEXIO_PIN_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTSTAT                        FLEXIO_SHIFTSTAT_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTERR                         FLEXIO_SHIFTERR_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_TIMSTAT                          FLEXIO_TIMSTAT_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTSIEN                        FLEXIO_SHIFTSIEN_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTEIEN                        FLEXIO_SHIFTEIEN_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_TIMIEN                           FLEXIO_TIMIEN_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTSDEN                        FLEXIO_SHIFTSDEN_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTSTATE                       FLEXIO_SHIFTSTATE_REG(FLEXIO2_BASE_PTR)
#define FLEXIO2_SHIFTCTL0                        FLEXIO_SHIFTCTL_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTCTL1                        FLEXIO_SHIFTCTL_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTCTL2                        FLEXIO_SHIFTCTL_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTCTL3                        FLEXIO_SHIFTCTL_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTCFG0                        FLEXIO_SHIFTCFG_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTCFG1                        FLEXIO_SHIFTCFG_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTCFG2                        FLEXIO_SHIFTCFG_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTCFG3                        FLEXIO_SHIFTCFG_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUF0                        FLEXIO_SHIFTBUF_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUF1                        FLEXIO_SHIFTBUF_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUF2                        FLEXIO_SHIFTBUF_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUF3                        FLEXIO_SHIFTBUF_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUFBIS0                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUFBIS1                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUFBIS2                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUFBIS3                     FLEXIO_SHIFTBUFBIS_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUFBYS0                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUFBYS1                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUFBYS2                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUFBYS3                     FLEXIO_SHIFTBUFBYS_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUFBBS0                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUFBBS1                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUFBBS2                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUFBBS3                     FLEXIO_SHIFTBUFBBS_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_TIMCTL0                          FLEXIO_TIMCTL_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_TIMCTL1                          FLEXIO_TIMCTL_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_TIMCTL2                          FLEXIO_TIMCTL_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_TIMCTL3                          FLEXIO_TIMCTL_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_TIMCFG0                          FLEXIO_TIMCFG_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_TIMCFG1                          FLEXIO_TIMCFG_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_TIMCFG2                          FLEXIO_TIMCFG_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_TIMCFG3                          FLEXIO_TIMCFG_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_TIMCMP0                          FLEXIO_TIMCMP_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_TIMCMP1                          FLEXIO_TIMCMP_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_TIMCMP2                          FLEXIO_TIMCMP_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_TIMCMP3                          FLEXIO_TIMCMP_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUFNBS0                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUFNBS1                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUFNBS2                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUFNBS3                     FLEXIO_SHIFTBUFNBS_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUFHWS0                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUFHWS1                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUFHWS2                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUFHWS3                     FLEXIO_SHIFTBUFHWS_REG(FLEXIO2_BASE_PTR,3)
#define FLEXIO2_SHIFTBUFNIS0                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO2_BASE_PTR,0)
#define FLEXIO2_SHIFTBUFNIS1                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO2_BASE_PTR,1)
#define FLEXIO2_SHIFTBUFNIS2                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO2_BASE_PTR,2)
#define FLEXIO2_SHIFTBUFNIS3                     FLEXIO_SHIFTBUFNIS_REG(FLEXIO2_BASE_PTR,3)

/* FLEXIO - Register array accessors */
#define FLEXIO1_SHIFTCTL(index)                  FLEXIO_SHIFTCTL_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTCTL(index)                  FLEXIO_SHIFTCTL_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTCFG(index)                  FLEXIO_SHIFTCFG_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTCFG(index)                  FLEXIO_SHIFTCFG_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUF(index)                  FLEXIO_SHIFTBUF_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUF(index)                  FLEXIO_SHIFTBUF_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUFBIS(index)               FLEXIO_SHIFTBUFBIS_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUFBIS(index)               FLEXIO_SHIFTBUFBIS_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUFBYS(index)               FLEXIO_SHIFTBUFBYS_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUFBYS(index)               FLEXIO_SHIFTBUFBYS_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUFBBS(index)               FLEXIO_SHIFTBUFBBS_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUFBBS(index)               FLEXIO_SHIFTBUFBBS_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_TIMCTL(index)                    FLEXIO_TIMCTL_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_TIMCTL(index)                    FLEXIO_TIMCTL_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_TIMCFG(index)                    FLEXIO_TIMCFG_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_TIMCFG(index)                    FLEXIO_TIMCFG_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_TIMCMP(index)                    FLEXIO_TIMCMP_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_TIMCMP(index)                    FLEXIO_TIMCMP_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUFNBS(index)               FLEXIO_SHIFTBUFNBS_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUFNBS(index)               FLEXIO_SHIFTBUFNBS_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUFHWS(index)               FLEXIO_SHIFTBUFHWS_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUFHWS(index)               FLEXIO_SHIFTBUFHWS_REG(FLEXIO2_BASE_PTR,index)
#define FLEXIO1_SHIFTBUFNIS(index)               FLEXIO_SHIFTBUFNIS_REG(FLEXIO1_BASE_PTR,index)
#define FLEXIO2_SHIFTBUFNIS(index)               FLEXIO_SHIFTBUFNIS_REG(FLEXIO2_BASE_PTR,index)

/*!
 * @}
 */ /* end of group FLEXIO_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group FLEXIO_Peripheral */


/* ----------------------------------------------------------------------------
   -- FLEXRAM
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXRAM_Peripheral FLEXRAM
 * @{
 */

/** FLEXRAM - Peripheral register structure */
typedef struct FLEXRAM_MemMap {
  uint32_t TCM_CTRL;                               /**< TCM CRTL Register, offset: 0x0 */
  uint32_t OCRAM_MAGIC_ADDR;                       /**< OCRAM Magic Address Register, offset: 0x4 */
  uint32_t DTCM_MAGIC_ADDR;                        /**< DTCM Magic Address Register, offset: 0x8 */
  uint32_t ITCM_MAGIC_ADDR;                        /**< ITCM Magic Address Register, offset: 0xC */
  uint32_t INT_STATUS;                             /**< Interrupt Status Register, offset: 0x10 */
  uint32_t INT_STAT_EN;                            /**< Interrupt Status Enable Register, offset: 0x14 */
  uint32_t INT_SIG_EN;                             /**< Interrupt Enable Register, offset: 0x18 */
} volatile *FLEXRAM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- FLEXRAM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXRAM_Register_Accessor_Macros FLEXRAM - Register accessor macros
 * @{
 */


