AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* FLEXRAM - Register instance definitions */
/* FLEXRAM */
#define FLEXRAM_TCM_CTRL                         FLEXRAM_TCM_CTRL_REG(FLEXRAM_BASE_PTR)
#define FLEXRAM_OCRAM_MAGIC_ADDR                 FLEXRAM_OCRAM_MAGIC_ADDR_REG(FLEXRAM_BASE_PTR)
#define FLEXRAM_DTCM_MAGIC_ADDR                  FLEXRAM_DTCM_MAGIC_ADDR_REG(FLEXRAM_BASE_PTR)
#define FLEXRAM_ITCM_MAGIC_ADDR                  FLEXRAM_ITCM_MAGIC_ADDR_REG(FLEXRAM_BASE_PTR)
#define FLEXRAM_INT_STATUS                       FLEXRAM_INT_STATUS_REG(FLEXRAM_BASE_PTR)
#define FLEXRAM_INT_STAT_EN                      FLEXRAM_INT_STAT_EN_REG(FLEXRAM_BASE_PTR)
#define FLEXRAM_INT_SIG_EN                       FLEXRAM_INT_SIG_EN_REG(FLEXRAM_BASE_PTR)

/*!
 * @}
 */ /* end of group FLEXRAM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group FLEXRAM_Peripheral */


/* ----------------------------------------------------------------------------
   -- FLEXSPI
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXSPI_Peripheral FLEXSPI
 * @{
 */

/** FLEXSPI - Peripheral register structure */
typedef struct FLEXSPI_MemMap {
  uint32_t MCR0;                                   /**< Module Control Register 0, offset: 0x0 */
  uint32_t MCR1;                                   /**< Module Control Register 1, offset: 0x4 */
  uint32_t MCR2;                                   /**< Module Control Register 2, offset: 0x8 */
  uint32_t AHBCR;                                  /**< AHB Bus Control Register, offset: 0xC */
  uint32_t INTEN;                                  /**< Interrupt Enable Register, offset: 0x10 */
  uint32_t INTR;                                   /**< Interrupt Register, offset: 0x14 */
  uint32_t LUTKEY;                                 /**< LUT Key Register, offset: 0x18 */
  uint32_t LUTCR;                                  /**< LUT Control Register, offset: 0x1C */
  uint32_t AHBRXBUFCR0[4];                         /**< AHB RX Buffer 0 Control Register 0..AHB RX Buffer 3 Control Register 0, array offset: 0x20, array step: 0x4 */
  uint8_t RESERVED_0[48];
  uint32_t FLSHCR0[4];                             /**< Flash A1 Control Register 0..Flash B2 Control Register 0, array offset: 0x60, array step: 0x4 */
  uint32_t FLSHCR1[4];                             /**< Flash A1 Control Register 1..Flash B2 Control Register 1, array offset: 0x70, array step: 0x4 */
  uint32_t FLSHCR2[4];                             /**< Flash A1 Control Register 2..Flash B2 Control Register 2, array offset: 0x80, array step: 0x4 */
  uint8_t RESERVED_1[4];
  uint32_t FLSHCR4;                                /**< Flash Control Register 4, offset: 0x94 */
  uint8_t RESERVED_2[8];
  uint32_t IPCR0;                                  /**< IP Control Register 0, offset: 0xA0 */
  uint32_t IPCR1;                                  /**< IP Control Register 1, offset: 0xA4 */
  uint8_t RESERVED_3[8];
  uint32_t IPCMD;                                  /**< IP Command Register, offset: 0xB0 */
  uint8_t RESERVED_4[4];
  uint32_t IPRXFCR;                                /**< IP RX FIFO Control Register, offset: 0xB8 */
  uint32_t IPTXFCR;                                /**< IP TX FIFO Control Register, offset: 0xBC */
  uint32_t DLLCR[2];                               /**< DLL Control Register 0, array offset: 0xC0, array step: 0x4 */
  uint8_t RESERVED_5[24];
  uint32_t STS0;                                   /**< Status Register 0, offset: 0xE0 */
  uint32_t STS1;                                   /**< Status Register 1, offset: 0xE4 */
  uint32_t STS2;                                   /**< Status Register 2, offset: 0xE8 */
  uint32_t AHBSPNDSTS;                             /**< AHB Suspend Status Register, offset: 0xEC */
  uint32_t IPRXFSTS;                               /**< IP RX FIFO Status Register, offset: 0xF0 */
  uint32_t IPTXFSTS;                               /**< IP TX FIFO Status Register, offset: 0xF4 */
  uint8_t RESERVED_6[8];
  uint32_t RFDR[32];                               /**< IP RX FIFO Data Register 0..IP RX FIFO Data Register 31, array offset: 0x100, array step: 0x4 */
  uint32_t TFDR[32];                               /**< IP TX FIFO Data Register 0..IP TX FIFO Data Register 31, array offset: 0x180, array step: 0x4 */
  uint32_t LUT[64];                                /**< LUT 0..LUT 63, array offset: 0x200, array step: 0x4 */
} volatile *FLEXSPI_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- FLEXSPI - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXSPI_Register_Accessor_Macros FLEXSPI - Register accessor macros
 * @{
 */


/* FLEXSPI - Register accessors */
#define FLEXSPI_MCR0_REG(base)                   ((base)->MCR0)
#define FLEXSPI_MCR1_REG(base)                   ((base)->MCR1)
#define FLEXSPI_MCR2_REG(base)                   ((base)->MCR2)
#define FLEXSPI_AHBCR_REG(base)                  ((base)->AHBCR)
#define FLEXSPI_INTEN_REG(base)                  ((base)->INTEN)
#define FLEXSPI_INTR_REG(base)                   ((base)->INTR)
#define FLEXSPI_LUTKEY_REG(base)                 ((base)->LUTKEY)
#define FLEXSPI_LUTCR_REG(base)                  ((base)->LUTCR)
#define FLEXSPI_AHBRXBUFCR0_REG(base,index)      ((base)->AHBRXBUFCR0[index])
#define FLEXSPI_FLSHCR0_REG(base,index)          ((base)->FLSHCR0[index])
#define FLEXSPI_FLSHCR1_REG(base,index)          ((base)->FLSHCR1[index])
#define FLEXSPI_FLSHCR2_REG(base,index)          ((base)->FLSHCR2[index])
#define FLEXSPI_FLSHCR4_REG(base)                ((base)->FLSHCR4)
#define FLEXSPI_IPCR0_REG(base)                  ((base)->IPCR0)
#define FLEXSPI_IPCR1_REG(base)                  ((base)->IPCR1)
#define FLEXSPI_IPCMD_REG(base)                  ((base)->IPCMD)
#define FLEXSPI_IPRXFCR_REG(base)                ((base)->IPRXFCR)
#define FLEXSPI_IPTXFCR_REG(base)                ((base)->IPTXFCR)
#define FLEXSPI_DLLCR_REG(base,index)            ((base)->DLLCR[index])
#define FLEXSPI_STS0_REG(base)                   ((base)->STS0)
#define FLEXSPI_STS1_REG(base)                   ((base)->STS1)
#define FLEXSPI_STS2_REG(base)                   ((base)->STS2)
#define FLEXSPI_AHBSPNDSTS_REG(base)             ((base)->AHBSPNDSTS)
#define FLEXSPI_IPRXFSTS_REG(base)               ((base)->IPRXFSTS)
#define FLEXSPI_IPTXFSTS_REG(base)               ((base)->IPTXFSTS)
#define FLEXSPI_RFDR_REG(base,index)             ((base)->RFDR[index])
#define FLEXSPI_TFDR_REG(base,index)             ((base)->TFDR[index])
#define FLEXSPI_LUT_REG(base,index)              ((base)->LUT[index])

/*!
 * @}
 */ /* end of group FLEXSPI_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- FLEXSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXSPI_Register_Masks FLEXSPI Register Masks
 * @{
 */

/*! @name MCR0 - Module Control Register 0 */
#define FLEXSPI_MCR0_SWRESET_MASK                (0x1U)
#define FLEXSPI_MCR0_SWRESET_SHIFT               (0U)
#define FLEXSPI_MCR0_MDIS_MASK                   (0x2U)
#define FLEXSPI_MCR0_MDIS_SHIFT                  (1U)
#define FLEXSPI_MCR0_RXCLKSRC_MASK               (0x30U)
#define FLEXSPI_MCR0_RXCLKSRC_SHIFT              (4U)
#define FLEXSPI_MCR0_RXCLKSRC(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXSPI_MCR0_RXCLKSRC_SHIFT)) & FLEXSPI_MCR0_RXCLKSRC_MASK)
#define FLEXSPI_MCR0_ARDFEN_MASK                 (0x40U)
#define FLEXSPI_MCR0_ARDFEN_SHIFT                (6U)
#define FLEXSPI_MCR0_ATDFEN_MASK                 (0x80U)
#define FLEXSPI_MCR0_ATDFEN_SHIFT                (7U)
#define FLEXSPI_MCR0_HSEN_MASK                   (0x800U)
#define FLEXSPI_MCR0_HSEN_SHIFT                  (11U)
#define FLEXSPI_MCR0_DOZEEN_MASK                 (0x1000U)
#define FLEXSPI_MCR0_DOZEEN_SHIFT                (12U)
#define FLEXSPI_MCR0_COMBINATIONEN_MASK          (0x2000U)
#define FLEXSPI_MCR0_COMBINATIONEN_SHIFT         (13U)
#define FLEXSPI_MCR0_SCKFREERUNEN_MASK           (0x4000U)
#define FLEXSPI_MCR0_SCKFREERUNEN_SHIFT          (14U)
#define FLEXSPI_MCR0_IPGRANTWAIT_MASK            (0xFF0000U)
#define FLEXSPI_MCR0_IPGRANTWAIT_SHIFT           (16U)
#define FLEXSPI_MCR0_IPGRANTWAIT(x)              (((uint32_t)(((uint32_t)(x)) << FLEXSPI_MCR0_IPGRANTWAIT_SHIFT)) & FLEXSPI_MCR0_IPGRANTWAIT_MASK)
#define FLEXSPI_MCR0_AHBGRANTWAIT_MASK           (0xFF000000U)
#define FLEXSPI_MCR0_AHBGRANTWAIT_SHIFT          (24U)
#define FLEXSPI_MCR0_AHBGRANTWAIT(x)             (((uint32_t)(((uint32_t)(x)) << FLEXSPI_MCR0_AHBGRANTWAIT_SHIFT)) & FLEXSPI_MCR0_AHBGRANTWAIT_MASK)

/*! @name MCR1 - Module Control Register 1 */
#define FLEXSPI_MCR1_AHBBUSWAIT_MASK             (0xFFFFU)
#define FLEXSPI_MCR1_AHBBUSWAIT_SHIFT            (0U)
#define FLEXSPI_MCR1_AHBBUSWAIT(x)               (((uint32_t)(((uint32_t)(x)) << FLEXSPI_MCR1_AHBBUSWAIT_SHIFT)) & FLEXSPI_MCR1_AHBBUSWAIT_MASK)
#define FLEXSPI_MCR1_SEQWAIT_MASK                (0xFFFF0000U)
#define FLEXSPI_MCR1_SEQWAIT_SHIFT               (16U)
#define FLEXSPI_MCR1_SEQWAIT(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_MCR1_SEQWAIT_SHIFT)) & FLEXSPI_MCR1_SEQWAIT_MASK)

/*! @name MCR2 - Module Control Register 2 */
#define FLEXSPI_MCR2_CLRAHBBUFOPT_MASK           (0x800U)
#define FLEXSPI_MCR2_CLRAHBBUFOPT_SHIFT          (11U)
#define FLEXSPI_MCR2_CLRLEARNPHASE_MASK          (0x4000U)
#define FLEXSPI_MCR2_CLRLEARNPHASE_SHIFT         (14U)
#define FLEXSPI_MCR2_SAMEDEVICEEN_MASK           (0x8000U)
#define FLEXSPI_MCR2_SAMEDEVICEEN_SHIFT          (15U)
#define FLEXSPI_MCR2_SCKBDIFFOPT_MASK            (0x80000U)
#define FLEXSPI_MCR2_SCKBDIFFOPT_SHIFT           (19U)
#define FLEXSPI_MCR2_RESUMEWAIT_MASK             (0xFF000000U)
#define FLEXSPI_MCR2_RESUMEWAIT_SHIFT            (24U)
#define FLEXSPI_MCR2_RESUMEWAIT(x)               (((uint32_t)(((uint32_t)(x)) << FLEXSPI_MCR2_RESUMEWAIT_SHIFT)) & FLEXSPI_MCR2_RESUMEWAIT_MASK)

/*! @name AHBCR - AHB Bus Control Register */
#define FLEXSPI_AHBCR_APAREN_MASK                (0x1U)
#define FLEXSPI_AHBCR_APAREN_SHIFT               (0U)
#define FLEXSPI_AHBCR_CACHABLEEN_MASK            (0x8U)
#define FLEXSPI_AHBCR_CACHABLEEN_SHIFT           (3U)
#define FLEXSPI_AHBCR_BUFFERABLEEN_MASK          (0x10U)
#define FLEXSPI_AHBCR_BUFFERABLEEN_SHIFT         (4U)
#define FLEXSPI_AHBCR_PREFETCHEN_MASK            (0x20U)
#define FLEXSPI_AHBCR_PREFETCHEN_SHIFT           (5U)
#define FLEXSPI_AHBCR_READADDROPT_MASK           (0x40U)
#define FLEXSPI_AHBCR_READADDROPT_SHIFT          (6U)

