AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name AHBSPNDSTS - AHB Suspend Status Register */
#define FLEXSPI_AHBSPNDSTS_ACTIVE_MASK           (0x1U)
#define FLEXSPI_AHBSPNDSTS_ACTIVE_SHIFT          (0U)
#define FLEXSPI_AHBSPNDSTS_BUFID_MASK            (0xEU)
#define FLEXSPI_AHBSPNDSTS_BUFID_SHIFT           (1U)
#define FLEXSPI_AHBSPNDSTS_BUFID(x)              (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBSPNDSTS_BUFID_SHIFT)) & FLEXSPI_AHBSPNDSTS_BUFID_MASK)
#define FLEXSPI_AHBSPNDSTS_DATLFT_MASK           (0xFFFF0000U)
#define FLEXSPI_AHBSPNDSTS_DATLFT_SHIFT          (16U)
#define FLEXSPI_AHBSPNDSTS_DATLFT(x)             (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBSPNDSTS_DATLFT_SHIFT)) & FLEXSPI_AHBSPNDSTS_DATLFT_MASK)

/*! @name IPRXFSTS - IP RX FIFO Status Register */
#define FLEXSPI_IPRXFSTS_FILL_MASK               (0xFFU)
#define FLEXSPI_IPRXFSTS_FILL_SHIFT              (0U)
#define FLEXSPI_IPRXFSTS_FILL(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXSPI_IPRXFSTS_FILL_SHIFT)) & FLEXSPI_IPRXFSTS_FILL_MASK)
#define FLEXSPI_IPRXFSTS_RDCNTR_MASK             (0xFFFF0000U)
#define FLEXSPI_IPRXFSTS_RDCNTR_SHIFT            (16U)
#define FLEXSPI_IPRXFSTS_RDCNTR(x)               (((uint32_t)(((uint32_t)(x)) << FLEXSPI_IPRXFSTS_RDCNTR_SHIFT)) & FLEXSPI_IPRXFSTS_RDCNTR_MASK)

/*! @name IPTXFSTS - IP TX FIFO Status Register */
#define FLEXSPI_IPTXFSTS_FILL_MASK               (0xFFU)
#define FLEXSPI_IPTXFSTS_FILL_SHIFT              (0U)
#define FLEXSPI_IPTXFSTS_FILL(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXSPI_IPTXFSTS_FILL_SHIFT)) & FLEXSPI_IPTXFSTS_FILL_MASK)
#define FLEXSPI_IPTXFSTS_WRCNTR_MASK             (0xFFFF0000U)
#define FLEXSPI_IPTXFSTS_WRCNTR_SHIFT            (16U)
#define FLEXSPI_IPTXFSTS_WRCNTR(x)               (((uint32_t)(((uint32_t)(x)) << FLEXSPI_IPTXFSTS_WRCNTR_SHIFT)) & FLEXSPI_IPTXFSTS_WRCNTR_MASK)

/*! @name RFDR - IP RX FIFO Data Register 0..IP RX FIFO Data Register 31 */
#define FLEXSPI_RFDR_RXDATA_MASK                 (0xFFFFFFFFU)
#define FLEXSPI_RFDR_RXDATA_SHIFT                (0U)
#define FLEXSPI_RFDR_RXDATA(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_RFDR_RXDATA_SHIFT)) & FLEXSPI_RFDR_RXDATA_MASK)

/* The count of FLEXSPI_RFDR */
#define FLEXSPI_RFDR_COUNT                       (32U)

/*! @name TFDR - IP TX FIFO Data Register 0..IP TX FIFO Data Register 31 */
#define FLEXSPI_TFDR_TXDATA_MASK                 (0xFFFFFFFFU)
#define FLEXSPI_TFDR_TXDATA_SHIFT                (0U)
#define FLEXSPI_TFDR_TXDATA(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_TFDR_TXDATA_SHIFT)) & FLEXSPI_TFDR_TXDATA_MASK)

/* The count of FLEXSPI_TFDR */
#define FLEXSPI_TFDR_COUNT                       (32U)

/*! @name LUT - LUT 0..LUT 63 */
#define FLEXSPI_LUT_OPERAND0_MASK                (0xFFU)
#define FLEXSPI_LUT_OPERAND0_SHIFT               (0U)
#define FLEXSPI_LUT_OPERAND0(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_LUT_OPERAND0_SHIFT)) & FLEXSPI_LUT_OPERAND0_MASK)
#define FLEXSPI_LUT_NUM_PADS0_MASK               (0x300U)
#define FLEXSPI_LUT_NUM_PADS0_SHIFT              (8U)
#define FLEXSPI_LUT_NUM_PADS0(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXSPI_LUT_NUM_PADS0_SHIFT)) & FLEXSPI_LUT_NUM_PADS0_MASK)
#define FLEXSPI_LUT_OPCODE0_MASK                 (0xFC00U)
#define FLEXSPI_LUT_OPCODE0_SHIFT                (10U)
#define FLEXSPI_LUT_OPCODE0(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_LUT_OPCODE0_SHIFT)) & FLEXSPI_LUT_OPCODE0_MASK)
#define FLEXSPI_LUT_OPERAND1_MASK                (0xFF0000U)
#define FLEXSPI_LUT_OPERAND1_SHIFT               (16U)
#define FLEXSPI_LUT_OPERAND1(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_LUT_OPERAND1_SHIFT)) & FLEXSPI_LUT_OPERAND1_MASK)
#define FLEXSPI_LUT_NUM_PADS1_MASK               (0x3000000U)
#define FLEXSPI_LUT_NUM_PADS1_SHIFT              (24U)
#define FLEXSPI_LUT_NUM_PADS1(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXSPI_LUT_NUM_PADS1_SHIFT)) & FLEXSPI_LUT_NUM_PADS1_MASK)
#define FLEXSPI_LUT_OPCODE1_MASK                 (0xFC000000U)
#define FLEXSPI_LUT_OPCODE1_SHIFT                (26U)
#define FLEXSPI_LUT_OPCODE1(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_LUT_OPCODE1_SHIFT)) & FLEXSPI_LUT_OPCODE1_MASK)

/* The count of FLEXSPI_LUT */
#define FLEXSPI_LUT_COUNT                        (64U)


/*!
 * @}
 */ /* end of group FLEXSPI_Register_Masks */


/* FLEXSPI - Peripheral instance base addresses */
/** Peripheral FLEXSPI base pointer */
#define FLEXSPI_BASE_PTR                         ((FLEXSPI_MemMapPtr)0x402A8000u)
/** Array initializer of FLEXSPI peripheral base pointers */
#define FLEXSPI_BASE_PTRS                        { FLEXSPI_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- FLEXSPI - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXSPI_Register_Accessor_Macros FLEXSPI - Register accessor macros
 * @{
 */


/* FLEXSPI - Register instance definitions */
/* FLEXSPI */
#define FLEXSPI_MCR0                             FLEXSPI_MCR0_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_MCR1                             FLEXSPI_MCR1_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_MCR2                             FLEXSPI_MCR2_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_AHBCR                            FLEXSPI_AHBCR_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_INTEN                            FLEXSPI_INTEN_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_INTR                             FLEXSPI_INTR_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_LUTKEY                           FLEXSPI_LUTKEY_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_LUTCR                            FLEXSPI_LUTCR_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_AHBRXBUF0CR0                     FLEXSPI_AHBRXBUFCR0_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_AHBRXBUF1CR0                     FLEXSPI_AHBRXBUFCR0_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_AHBRXBUF2CR0                     FLEXSPI_AHBRXBUFCR0_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_AHBRXBUF3CR0                     FLEXSPI_AHBRXBUFCR0_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_FLSHA1CR0                        FLEXSPI_FLSHCR0_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_FLSHA2CR0                        FLEXSPI_FLSHCR0_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_FLSHB1CR0                        FLEXSPI_FLSHCR0_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_FLSHB2CR0                        FLEXSPI_FLSHCR0_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_FLSHA1CR1                        FLEXSPI_FLSHCR1_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_FLSHA2CR1                        FLEXSPI_FLSHCR1_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_FLSHB1CR1                        FLEXSPI_FLSHCR1_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_FLSHB2CR1                        FLEXSPI_FLSHCR1_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_FLSHA1CR2                        FLEXSPI_FLSHCR2_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_FLSHA2CR2                        FLEXSPI_FLSHCR2_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_FLSHB1CR2                        FLEXSPI_FLSHCR2_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_FLSHB2CR2                        FLEXSPI_FLSHCR2_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_FLSHCR4                          FLEXSPI_FLSHCR4_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPCR0                            FLEXSPI_IPCR0_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPCR1                            FLEXSPI_IPCR1_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPCMD                            FLEXSPI_IPCMD_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPRXFCR                          FLEXSPI_IPRXFCR_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPTXFCR                          FLEXSPI_IPTXFCR_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_DLLACR                           FLEXSPI_DLLCR_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_DLLBCR                           FLEXSPI_DLLCR_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_STS0                             FLEXSPI_STS0_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_STS1                             FLEXSPI_STS1_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_STS2                             FLEXSPI_STS2_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_AHBSPNDSTS                       FLEXSPI_AHBSPNDSTS_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPRXFSTS                         FLEXSPI_IPRXFSTS_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_IPTXFSTS                         FLEXSPI_IPTXFSTS_REG(FLEXSPI_BASE_PTR)
#define FLEXSPI_RFDR0                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_RFDR1                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_RFDR2                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_RFDR3                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_RFDR4                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,4)
#define FLEXSPI_RFDR5                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,5)
#define FLEXSPI_RFDR6                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,6)
#define FLEXSPI_RFDR7                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,7)
#define FLEXSPI_RFDR8                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,8)
#define FLEXSPI_RFDR9                            FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,9)
#define FLEXSPI_RFDR10                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,10)
#define FLEXSPI_RFDR11                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,11)
#define FLEXSPI_RFDR12                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,12)
#define FLEXSPI_RFDR13                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,13)
#define FLEXSPI_RFDR14                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,14)
#define FLEXSPI_RFDR15                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,15)
#define FLEXSPI_RFDR16                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,16)
#define FLEXSPI_RFDR17                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,17)
#define FLEXSPI_RFDR18                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,18)
#define FLEXSPI_RFDR19                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,19)
#define FLEXSPI_RFDR20                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,20)
#define FLEXSPI_RFDR21                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,21)
#define FLEXSPI_RFDR22                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,22)
#define FLEXSPI_RFDR23                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,23)
#define FLEXSPI_RFDR24                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,24)
#define FLEXSPI_RFDR25                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,25)
#define FLEXSPI_RFDR26                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,26)
#define FLEXSPI_RFDR27                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,27)
#define FLEXSPI_RFDR28                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,28)
#define FLEXSPI_RFDR29                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,29)
#define FLEXSPI_RFDR30                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,30)
#define FLEXSPI_RFDR31                           FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,31)
#define FLEXSPI_TFDR0                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_TFDR1                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_TFDR2                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_TFDR3                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_TFDR4                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,4)
#define FLEXSPI_TFDR5                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,5)
#define FLEXSPI_TFDR6                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,6)
#define FLEXSPI_TFDR7                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,7)
#define FLEXSPI_TFDR8                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,8)
#define FLEXSPI_TFDR9                            FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,9)
#define FLEXSPI_TFDR10                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,10)
#define FLEXSPI_TFDR11                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,11)
#define FLEXSPI_TFDR12                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,12)
#define FLEXSPI_TFDR13                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,13)
#define FLEXSPI_TFDR14                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,14)
#define FLEXSPI_TFDR15                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,15)
#define FLEXSPI_TFDR16                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,16)
#define FLEXSPI_TFDR17                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,17)
#define FLEXSPI_TFDR18                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,18)
#define FLEXSPI_TFDR19                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,19)
#define FLEXSPI_TFDR20                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,20)
#define FLEXSPI_TFDR21                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,21)
#define FLEXSPI_TFDR22                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,22)
#define FLEXSPI_TFDR23                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,23)
#define FLEXSPI_TFDR24                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,24)
#define FLEXSPI_TFDR25                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,25)
#define FLEXSPI_TFDR26                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,26)
#define FLEXSPI_TFDR27                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,27)
#define FLEXSPI_TFDR28                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,28)
#define FLEXSPI_TFDR29                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,29)
#define FLEXSPI_TFDR30                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,30)
#define FLEXSPI_TFDR31                           FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,31)
#define FLEXSPI_LUT0                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,0)
#define FLEXSPI_LUT1                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,1)
#define FLEXSPI_LUT2                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,2)
#define FLEXSPI_LUT3                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,3)
#define FLEXSPI_LUT4                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,4)
#define FLEXSPI_LUT5                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,5)
#define FLEXSPI_LUT6                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,6)
#define FLEXSPI_LUT7                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,7)
#define FLEXSPI_LUT8                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,8)
#define FLEXSPI_LUT9                             FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,9)
#define FLEXSPI_LUT10                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,10)
#define FLEXSPI_LUT11                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,11)
#define FLEXSPI_LUT12                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,12)
#define FLEXSPI_LUT13                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,13)
#define FLEXSPI_LUT14                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,14)
#define FLEXSPI_LUT15                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,15)
#define FLEXSPI_LUT16                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,16)
#define FLEXSPI_LUT17                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,17)
#define FLEXSPI_LUT18                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,18)
#define FLEXSPI_LUT19                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,19)
#define FLEXSPI_LUT20                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,20)
#define FLEXSPI_LUT21                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,21)
#define FLEXSPI_LUT22                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,22)
#define FLEXSPI_LUT23                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,23)
#define FLEXSPI_LUT24                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,24)
#define FLEXSPI_LUT25                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,25)
#define FLEXSPI_LUT26                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,26)
#define FLEXSPI_LUT27                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,27)
#define FLEXSPI_LUT28                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,28)
#define FLEXSPI_LUT29                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,29)
#define FLEXSPI_LUT30                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,30)
#define FLEXSPI_LUT31                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,31)
#define FLEXSPI_LUT32                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,32)
#define FLEXSPI_LUT33                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,33)
#define FLEXSPI_LUT34                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,34)
#define FLEXSPI_LUT35                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,35)
#define FLEXSPI_LUT36                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,36)
#define FLEXSPI_LUT37                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,37)
#define FLEXSPI_LUT38                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,38)
#define FLEXSPI_LUT39                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,39)
#define FLEXSPI_LUT40                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,40)
#define FLEXSPI_LUT41                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,41)
#define FLEXSPI_LUT42                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,42)
#define FLEXSPI_LUT43                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,43)
#define FLEXSPI_LUT44                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,44)
#define FLEXSPI_LUT45                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,45)
#define FLEXSPI_LUT46                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,46)
#define FLEXSPI_LUT47                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,47)
#define FLEXSPI_LUT48                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,48)
#define FLEXSPI_LUT49                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,49)
#define FLEXSPI_LUT50                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,50)
#define FLEXSPI_LUT51                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,51)
#define FLEXSPI_LUT52                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,52)
#define FLEXSPI_LUT53                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,53)
#define FLEXSPI_LUT54                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,54)
#define FLEXSPI_LUT55                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,55)
#define FLEXSPI_LUT56                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,56)
#define FLEXSPI_LUT57                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,57)
#define FLEXSPI_LUT58                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,58)
#define FLEXSPI_LUT59                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,59)
#define FLEXSPI_LUT60                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,60)
#define FLEXSPI_LUT61                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,61)
#define FLEXSPI_LUT62                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,62)
#define FLEXSPI_LUT63                            FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,63)

