AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* FLEXSPI - Register array accessors */
#define FLEXSPI_AHBRXBUFCR0(index)               FLEXSPI_AHBRXBUFCR0_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_FLSHCR0(index)                   FLEXSPI_FLSHCR0_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_FLSHCR1(index)                   FLEXSPI_FLSHCR1_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_FLSHCR2(index)                   FLEXSPI_FLSHCR2_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_DLLCR(index)                     FLEXSPI_DLLCR_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_RFDR(index)                      FLEXSPI_RFDR_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_TFDR(index)                      FLEXSPI_TFDR_REG(FLEXSPI_BASE_PTR,index)
#define FLEXSPI_LUT(index)                       FLEXSPI_LUT_REG(FLEXSPI_BASE_PTR,index)

/*!
 * @}
 */ /* end of group FLEXSPI_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group FLEXSPI_Peripheral */


/* ----------------------------------------------------------------------------
   -- GPC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPC_Peripheral GPC
 * @{
 */

/** GPC - Peripheral register structure */
typedef struct GPC_MemMap {
  uint32_t CNTR;                                   /**< GPC Interface control register, offset: 0x0 */
  uint8_t RESERVED_0[4];
  uint32_t IMR[4];                                 /**< IRQ masking register 1..IRQ masking register 4, array offset: 0x8, array step: 0x4 */
  uint32_t ISR[4];                                 /**< IRQ status resister 1..IRQ status resister 4, array offset: 0x18, array step: 0x4 */
  uint8_t RESERVED_1[12];
  uint32_t IMR5;                                   /**< IRQ masking register 5, offset: 0x34 */
  uint32_t ISR5;                                   /**< IRQ status resister 5, offset: 0x38 */
} volatile *GPC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- GPC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPC_Register_Accessor_Macros GPC - Register accessor macros
 * @{
 */


/* GPC - Register accessors */
#define GPC_CNTR_REG(base)                       ((base)->CNTR)
#define GPC_IMR_REG(base,index)                  ((base)->IMR[index])
#define GPC_ISR_REG(base,index)                  ((base)->ISR[index])
#define GPC_IMR5_REG(base)                       ((base)->IMR5)
#define GPC_ISR5_REG(base)                       ((base)->ISR5)

/*!
 * @}
 */ /* end of group GPC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- GPC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPC_Register_Masks GPC Register Masks
 * @{
 */

/*! @name CNTR - GPC Interface control register */
#define GPC_CNTR_MEGA_PDN_REQ_MASK               (0x4U)
#define GPC_CNTR_MEGA_PDN_REQ_SHIFT              (2U)
#define GPC_CNTR_MEGA_PUP_REQ_MASK               (0x8U)
#define GPC_CNTR_MEGA_PUP_REQ_SHIFT              (3U)
#define GPC_CNTR_PDRAM0_PGE_MASK                 (0x400000U)
#define GPC_CNTR_PDRAM0_PGE_SHIFT                (22U)

/*! @name IMR - IRQ masking register 1..IRQ masking register 4 */
#define GPC_IMR_IMR1_MASK                        (0xFFFFFFFFU)
#define GPC_IMR_IMR1_SHIFT                       (0U)
#define GPC_IMR_IMR1(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_IMR_IMR1_SHIFT)) & GPC_IMR_IMR1_MASK)
#define GPC_IMR_IMR2_MASK                        (0xFFFFFFFFU)
#define GPC_IMR_IMR2_SHIFT                       (0U)
#define GPC_IMR_IMR2(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_IMR_IMR2_SHIFT)) & GPC_IMR_IMR2_MASK)
#define GPC_IMR_IMR3_MASK                        (0xFFFFFFFFU)
#define GPC_IMR_IMR3_SHIFT                       (0U)
#define GPC_IMR_IMR3(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_IMR_IMR3_SHIFT)) & GPC_IMR_IMR3_MASK)
#define GPC_IMR_IMR4_MASK                        (0xFFFFFFFFU)
#define GPC_IMR_IMR4_SHIFT                       (0U)
#define GPC_IMR_IMR4(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_IMR_IMR4_SHIFT)) & GPC_IMR_IMR4_MASK)

/* The count of GPC_IMR */
#define GPC_IMR_COUNT                            (4U)

/*! @name ISR - IRQ status resister 1..IRQ status resister 4 */
#define GPC_ISR_ISR1_MASK                        (0xFFFFFFFFU)
#define GPC_ISR_ISR1_SHIFT                       (0U)
#define GPC_ISR_ISR1(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_ISR_ISR1_SHIFT)) & GPC_ISR_ISR1_MASK)
#define GPC_ISR_ISR2_MASK                        (0xFFFFFFFFU)
#define GPC_ISR_ISR2_SHIFT                       (0U)
#define GPC_ISR_ISR2(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_ISR_ISR2_SHIFT)) & GPC_ISR_ISR2_MASK)
#define GPC_ISR_ISR3_MASK                        (0xFFFFFFFFU)
#define GPC_ISR_ISR3_SHIFT                       (0U)
#define GPC_ISR_ISR3(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_ISR_ISR3_SHIFT)) & GPC_ISR_ISR3_MASK)
#define GPC_ISR_ISR4_MASK                        (0xFFFFFFFFU)
#define GPC_ISR_ISR4_SHIFT                       (0U)
#define GPC_ISR_ISR4(x)                          (((uint32_t)(((uint32_t)(x)) << GPC_ISR_ISR4_SHIFT)) & GPC_ISR_ISR4_MASK)

/* The count of GPC_ISR */
#define GPC_ISR_COUNT                            (4U)

/*! @name IMR5 - IRQ masking register 5 */
#define GPC_IMR5_IMR5_MASK                       (0xFFFFFFFFU)
#define GPC_IMR5_IMR5_SHIFT                      (0U)
#define GPC_IMR5_IMR5(x)                         (((uint32_t)(((uint32_t)(x)) << GPC_IMR5_IMR5_SHIFT)) & GPC_IMR5_IMR5_MASK)

/*! @name ISR5 - IRQ status resister 5 */
#define GPC_ISR5_ISR4_MASK                       (0xFFFFFFFFU)
#define GPC_ISR5_ISR4_SHIFT                      (0U)
#define GPC_ISR5_ISR4(x)                         (((uint32_t)(((uint32_t)(x)) << GPC_ISR5_ISR4_SHIFT)) & GPC_ISR5_ISR4_MASK)


/*!
 * @}
 */ /* end of group GPC_Register_Masks */


