AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* The count of I2S_RDR */
#define I2S_RDR_COUNT                            (4U)

/*! @name RFR - SAI Receive FIFO Register */
#define I2S_RFR_RFP_MASK                         (0x3FU)
#define I2S_RFR_RFP_SHIFT                        (0U)
#define I2S_RFR_RFP(x)                           (((uint32_t)(((uint32_t)(x)) << I2S_RFR_RFP_SHIFT)) & I2S_RFR_RFP_MASK)
#define I2S_RFR_RCP_MASK                         (0x8000U)
#define I2S_RFR_RCP_SHIFT                        (15U)
#define I2S_RFR_WFP_MASK                         (0x3F0000U)
#define I2S_RFR_WFP_SHIFT                        (16U)
#define I2S_RFR_WFP(x)                           (((uint32_t)(((uint32_t)(x)) << I2S_RFR_WFP_SHIFT)) & I2S_RFR_WFP_MASK)

/* The count of I2S_RFR */
#define I2S_RFR_COUNT                            (4U)

/*! @name RMR - SAI Receive Mask Register */
#define I2S_RMR_RWM_MASK                         (0xFFFFFFFFU)
#define I2S_RMR_RWM_SHIFT                        (0U)
#define I2S_RMR_RWM(x)                           (((uint32_t)(((uint32_t)(x)) << I2S_RMR_RWM_SHIFT)) & I2S_RMR_RWM_MASK)


/*!
 * @}
 */ /* end of group I2S_Register_Masks */


/* I2S - Peripheral instance base addresses */
/** Peripheral SAI1 base pointer */
#define SAI1_BASE_PTR                            ((I2S_MemMapPtr)0x40384000u)
/** Peripheral SAI2 base pointer */
#define SAI2_BASE_PTR                            ((I2S_MemMapPtr)0x40388000u)
/** Peripheral SAI3 base pointer */
#define SAI3_BASE_PTR                            ((I2S_MemMapPtr)0x4038C000u)
/** Array initializer of I2S peripheral base pointers */
#define I2S_BASE_PTRS                            { SAI1_BASE_PTR, SAI2_BASE_PTR, SAI3_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- I2S - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2S_Register_Accessor_Macros I2S - Register accessor macros
 * @{
 */


/* I2S - Register instance definitions */
/* SAI1 */
#define SAI1_VERID                               I2S_VERID_REG(SAI1_BASE_PTR)
#define SAI1_PARAM                               I2S_PARAM_REG(SAI1_BASE_PTR)
#define SAI1_TCSR                                I2S_TCSR_REG(SAI1_BASE_PTR)
#define SAI1_TCR1                                I2S_TCR1_REG(SAI1_BASE_PTR)
#define SAI1_TCR2                                I2S_TCR2_REG(SAI1_BASE_PTR)
#define SAI1_TCR3                                I2S_TCR3_REG(SAI1_BASE_PTR)
#define SAI1_TCR4                                I2S_TCR4_REG(SAI1_BASE_PTR)
#define SAI1_TCR5                                I2S_TCR5_REG(SAI1_BASE_PTR)
#define SAI1_TDR0                                I2S_TDR_REG(SAI1_BASE_PTR,0)
#define SAI1_TDR1                                I2S_TDR_REG(SAI1_BASE_PTR,1)
#define SAI1_TDR2                                I2S_TDR_REG(SAI1_BASE_PTR,2)
#define SAI1_TDR3                                I2S_TDR_REG(SAI1_BASE_PTR,3)
#define SAI1_TFR0                                I2S_TFR_REG(SAI1_BASE_PTR,0)
#define SAI1_TFR1                                I2S_TFR_REG(SAI1_BASE_PTR,1)
#define SAI1_TFR2                                I2S_TFR_REG(SAI1_BASE_PTR,2)
#define SAI1_TFR3                                I2S_TFR_REG(SAI1_BASE_PTR,3)
#define SAI1_TMR                                 I2S_TMR_REG(SAI1_BASE_PTR)
#define SAI1_RCSR                                I2S_RCSR_REG(SAI1_BASE_PTR)
#define SAI1_RCR1                                I2S_RCR1_REG(SAI1_BASE_PTR)
#define SAI1_RCR2                                I2S_RCR2_REG(SAI1_BASE_PTR)
#define SAI1_RCR3                                I2S_RCR3_REG(SAI1_BASE_PTR)
#define SAI1_RCR4                                I2S_RCR4_REG(SAI1_BASE_PTR)
#define SAI1_RCR5                                I2S_RCR5_REG(SAI1_BASE_PTR)
#define SAI1_RDR0                                I2S_RDR_REG(SAI1_BASE_PTR,0)
#define SAI1_RDR1                                I2S_RDR_REG(SAI1_BASE_PTR,1)
#define SAI1_RDR2                                I2S_RDR_REG(SAI1_BASE_PTR,2)
#define SAI1_RDR3                                I2S_RDR_REG(SAI1_BASE_PTR,3)
#define SAI1_RFR0                                I2S_RFR_REG(SAI1_BASE_PTR,0)
#define SAI1_RFR1                                I2S_RFR_REG(SAI1_BASE_PTR,1)
#define SAI1_RFR2                                I2S_RFR_REG(SAI1_BASE_PTR,2)
#define SAI1_RFR3                                I2S_RFR_REG(SAI1_BASE_PTR,3)
#define SAI1_RMR                                 I2S_RMR_REG(SAI1_BASE_PTR)
/* SAI2 */
#define SAI2_VERID                               I2S_VERID_REG(SAI2_BASE_PTR)
#define SAI2_PARAM                               I2S_PARAM_REG(SAI2_BASE_PTR)
#define SAI2_TCSR                                I2S_TCSR_REG(SAI2_BASE_PTR)
#define SAI2_TCR1                                I2S_TCR1_REG(SAI2_BASE_PTR)
#define SAI2_TCR2                                I2S_TCR2_REG(SAI2_BASE_PTR)
#define SAI2_TCR3                                I2S_TCR3_REG(SAI2_BASE_PTR)
#define SAI2_TCR4                                I2S_TCR4_REG(SAI2_BASE_PTR)
#define SAI2_TCR5                                I2S_TCR5_REG(SAI2_BASE_PTR)
#define SAI2_TDR0                                I2S_TDR_REG(SAI2_BASE_PTR,0)
#define SAI2_TDR1                                I2S_TDR_REG(SAI2_BASE_PTR,1)
#define SAI2_TDR2                                I2S_TDR_REG(SAI2_BASE_PTR,2)
#define SAI2_TDR3                                I2S_TDR_REG(SAI2_BASE_PTR,3)
#define SAI2_TFR0                                I2S_TFR_REG(SAI2_BASE_PTR,0)
#define SAI2_TFR1                                I2S_TFR_REG(SAI2_BASE_PTR,1)
#define SAI2_TFR2                                I2S_TFR_REG(SAI2_BASE_PTR,2)
#define SAI2_TFR3                                I2S_TFR_REG(SAI2_BASE_PTR,3)
#define SAI2_TMR                                 I2S_TMR_REG(SAI2_BASE_PTR)
#define SAI2_RCSR                                I2S_RCSR_REG(SAI2_BASE_PTR)
#define SAI2_RCR1                                I2S_RCR1_REG(SAI2_BASE_PTR)
#define SAI2_RCR2                                I2S_RCR2_REG(SAI2_BASE_PTR)
#define SAI2_RCR3                                I2S_RCR3_REG(SAI2_BASE_PTR)
#define SAI2_RCR4                                I2S_RCR4_REG(SAI2_BASE_PTR)
#define SAI2_RCR5                                I2S_RCR5_REG(SAI2_BASE_PTR)
#define SAI2_RDR0                                I2S_RDR_REG(SAI2_BASE_PTR,0)
#define SAI2_RDR1                                I2S_RDR_REG(SAI2_BASE_PTR,1)
#define SAI2_RDR2                                I2S_RDR_REG(SAI2_BASE_PTR,2)
#define SAI2_RDR3                                I2S_RDR_REG(SAI2_BASE_PTR,3)
#define SAI2_RFR0                                I2S_RFR_REG(SAI2_BASE_PTR,0)
#define SAI2_RFR1                                I2S_RFR_REG(SAI2_BASE_PTR,1)
#define SAI2_RFR2                                I2S_RFR_REG(SAI2_BASE_PTR,2)
#define SAI2_RFR3                                I2S_RFR_REG(SAI2_BASE_PTR,3)
#define SAI2_RMR                                 I2S_RMR_REG(SAI2_BASE_PTR)
/* SAI3 */
#define SAI3_VERID                               I2S_VERID_REG(SAI3_BASE_PTR)
#define SAI3_PARAM                               I2S_PARAM_REG(SAI3_BASE_PTR)
#define SAI3_TCSR                                I2S_TCSR_REG(SAI3_BASE_PTR)
#define SAI3_TCR1                                I2S_TCR1_REG(SAI3_BASE_PTR)
#define SAI3_TCR2                                I2S_TCR2_REG(SAI3_BASE_PTR)
#define SAI3_TCR3                                I2S_TCR3_REG(SAI3_BASE_PTR)
#define SAI3_TCR4                                I2S_TCR4_REG(SAI3_BASE_PTR)
#define SAI3_TCR5                                I2S_TCR5_REG(SAI3_BASE_PTR)
#define SAI3_TDR0                                I2S_TDR_REG(SAI3_BASE_PTR,0)
#define SAI3_TDR1                                I2S_TDR_REG(SAI3_BASE_PTR,1)
#define SAI3_TDR2                                I2S_TDR_REG(SAI3_BASE_PTR,2)
#define SAI3_TDR3                                I2S_TDR_REG(SAI3_BASE_PTR,3)
#define SAI3_TFR0                                I2S_TFR_REG(SAI3_BASE_PTR,0)
#define SAI3_TFR1                                I2S_TFR_REG(SAI3_BASE_PTR,1)
#define SAI3_TFR2                                I2S_TFR_REG(SAI3_BASE_PTR,2)
#define SAI3_TFR3                                I2S_TFR_REG(SAI3_BASE_PTR,3)
#define SAI3_TMR                                 I2S_TMR_REG(SAI3_BASE_PTR)
#define SAI3_RCSR                                I2S_RCSR_REG(SAI3_BASE_PTR)
#define SAI3_RCR1                                I2S_RCR1_REG(SAI3_BASE_PTR)
#define SAI3_RCR2                                I2S_RCR2_REG(SAI3_BASE_PTR)
#define SAI3_RCR3                                I2S_RCR3_REG(SAI3_BASE_PTR)
#define SAI3_RCR4                                I2S_RCR4_REG(SAI3_BASE_PTR)
#define SAI3_RCR5                                I2S_RCR5_REG(SAI3_BASE_PTR)
#define SAI3_RDR0                                I2S_RDR_REG(SAI3_BASE_PTR,0)
#define SAI3_RDR1                                I2S_RDR_REG(SAI3_BASE_PTR,1)
#define SAI3_RDR2                                I2S_RDR_REG(SAI3_BASE_PTR,2)
#define SAI3_RDR3                                I2S_RDR_REG(SAI3_BASE_PTR,3)
#define SAI3_RFR0                                I2S_RFR_REG(SAI3_BASE_PTR,0)
#define SAI3_RFR1                                I2S_RFR_REG(SAI3_BASE_PTR,1)
#define SAI3_RFR2                                I2S_RFR_REG(SAI3_BASE_PTR,2)
#define SAI3_RFR3                                I2S_RFR_REG(SAI3_BASE_PTR,3)
#define SAI3_RMR                                 I2S_RMR_REG(SAI3_BASE_PTR)

/* I2S - Register array accessors */
#define SAI1_TDR(index)                          I2S_TDR_REG(SAI1_BASE_PTR,index)
#define SAI2_TDR(index)                          I2S_TDR_REG(SAI2_BASE_PTR,index)
#define SAI3_TDR(index)                          I2S_TDR_REG(SAI3_BASE_PTR,index)
#define SAI1_TFR(index)                          I2S_TFR_REG(SAI1_BASE_PTR,index)
#define SAI2_TFR(index)                          I2S_TFR_REG(SAI2_BASE_PTR,index)
#define SAI3_TFR(index)                          I2S_TFR_REG(SAI3_BASE_PTR,index)
#define SAI1_RDR(index)                          I2S_RDR_REG(SAI1_BASE_PTR,index)
#define SAI2_RDR(index)                          I2S_RDR_REG(SAI2_BASE_PTR,index)
#define SAI3_RDR(index)                          I2S_RDR_REG(SAI3_BASE_PTR,index)
#define SAI1_RFR(index)                          I2S_RFR_REG(SAI1_BASE_PTR,index)
#define SAI2_RFR(index)                          I2S_RFR_REG(SAI2_BASE_PTR,index)
#define SAI3_RFR(index)                          I2S_RFR_REG(SAI3_BASE_PTR,index)

/*!
 * @}
 */ /* end of group I2S_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group I2S_Peripheral */


/* ----------------------------------------------------------------------------
   -- IOMUXC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_Peripheral IOMUXC
 * @{
 */

