AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/** IOMUXC - Peripheral register structure */
typedef struct IOMUXC_MemMap {
  uint8_t RESERVED_0[20];
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_00;             /**< SW_MUX_CTL_PAD_GPIO_EMC_00 SW MUX Control Register, offset: 0x14 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_01;             /**< SW_MUX_CTL_PAD_GPIO_EMC_01 SW MUX Control Register, offset: 0x18 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_02;             /**< SW_MUX_CTL_PAD_GPIO_EMC_02 SW MUX Control Register, offset: 0x1C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_03;             /**< SW_MUX_CTL_PAD_GPIO_EMC_03 SW MUX Control Register, offset: 0x20 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_04;             /**< SW_MUX_CTL_PAD_GPIO_EMC_04 SW MUX Control Register, offset: 0x24 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_05;             /**< SW_MUX_CTL_PAD_GPIO_EMC_05 SW MUX Control Register, offset: 0x28 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_06;             /**< SW_MUX_CTL_PAD_GPIO_EMC_06 SW MUX Control Register, offset: 0x2C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_07;             /**< SW_MUX_CTL_PAD_GPIO_EMC_07 SW MUX Control Register, offset: 0x30 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_08;             /**< SW_MUX_CTL_PAD_GPIO_EMC_08 SW MUX Control Register, offset: 0x34 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_09;             /**< SW_MUX_CTL_PAD_GPIO_EMC_09 SW MUX Control Register, offset: 0x38 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_10;             /**< SW_MUX_CTL_PAD_GPIO_EMC_10 SW MUX Control Register, offset: 0x3C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_11;             /**< SW_MUX_CTL_PAD_GPIO_EMC_11 SW MUX Control Register, offset: 0x40 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_12;             /**< SW_MUX_CTL_PAD_GPIO_EMC_12 SW MUX Control Register, offset: 0x44 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_13;             /**< SW_MUX_CTL_PAD_GPIO_EMC_13 SW MUX Control Register, offset: 0x48 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_14;             /**< SW_MUX_CTL_PAD_GPIO_EMC_14 SW MUX Control Register, offset: 0x4C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_15;             /**< SW_MUX_CTL_PAD_GPIO_EMC_15 SW MUX Control Register, offset: 0x50 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_16;             /**< SW_MUX_CTL_PAD_GPIO_EMC_16 SW MUX Control Register, offset: 0x54 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_17;             /**< SW_MUX_CTL_PAD_GPIO_EMC_17 SW MUX Control Register, offset: 0x58 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_18;             /**< SW_MUX_CTL_PAD_GPIO_EMC_18 SW MUX Control Register, offset: 0x5C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_19;             /**< SW_MUX_CTL_PAD_GPIO_EMC_19 SW MUX Control Register, offset: 0x60 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_20;             /**< SW_MUX_CTL_PAD_GPIO_EMC_20 SW MUX Control Register, offset: 0x64 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_21;             /**< SW_MUX_CTL_PAD_GPIO_EMC_21 SW MUX Control Register, offset: 0x68 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_22;             /**< SW_MUX_CTL_PAD_GPIO_EMC_22 SW MUX Control Register, offset: 0x6C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_23;             /**< SW_MUX_CTL_PAD_GPIO_EMC_23 SW MUX Control Register, offset: 0x70 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_24;             /**< SW_MUX_CTL_PAD_GPIO_EMC_24 SW MUX Control Register, offset: 0x74 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_25;             /**< SW_MUX_CTL_PAD_GPIO_EMC_25 SW MUX Control Register, offset: 0x78 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_26;             /**< SW_MUX_CTL_PAD_GPIO_EMC_26 SW MUX Control Register, offset: 0x7C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_27;             /**< SW_MUX_CTL_PAD_GPIO_EMC_27 SW MUX Control Register, offset: 0x80 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_28;             /**< SW_MUX_CTL_PAD_GPIO_EMC_28 SW MUX Control Register, offset: 0x84 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_29;             /**< SW_MUX_CTL_PAD_GPIO_EMC_29 SW MUX Control Register, offset: 0x88 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_30;             /**< SW_MUX_CTL_PAD_GPIO_EMC_30 SW MUX Control Register, offset: 0x8C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_31;             /**< SW_MUX_CTL_PAD_GPIO_EMC_31 SW MUX Control Register, offset: 0x90 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_32;             /**< SW_MUX_CTL_PAD_GPIO_EMC_32 SW MUX Control Register, offset: 0x94 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_33;             /**< SW_MUX_CTL_PAD_GPIO_EMC_33 SW MUX Control Register, offset: 0x98 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_34;             /**< SW_MUX_CTL_PAD_GPIO_EMC_34 SW MUX Control Register, offset: 0x9C */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_35;             /**< SW_MUX_CTL_PAD_GPIO_EMC_35 SW MUX Control Register, offset: 0xA0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_36;             /**< SW_MUX_CTL_PAD_GPIO_EMC_36 SW MUX Control Register, offset: 0xA4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_37;             /**< SW_MUX_CTL_PAD_GPIO_EMC_37 SW MUX Control Register, offset: 0xA8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_38;             /**< SW_MUX_CTL_PAD_GPIO_EMC_38 SW MUX Control Register, offset: 0xAC */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_39;             /**< SW_MUX_CTL_PAD_GPIO_EMC_39 SW MUX Control Register, offset: 0xB0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_40;             /**< SW_MUX_CTL_PAD_GPIO_EMC_40 SW MUX Control Register, offset: 0xB4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_EMC_41;             /**< SW_MUX_CTL_PAD_GPIO_EMC_41 SW MUX Control Register, offset: 0xB8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_00;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_00 SW MUX Control Register, offset: 0xBC */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_01;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_01 SW MUX Control Register, offset: 0xC0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_02;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_02 SW MUX Control Register, offset: 0xC4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_03;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_03 SW MUX Control Register, offset: 0xC8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_04;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_04 SW MUX Control Register, offset: 0xCC */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_05;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_05 SW MUX Control Register, offset: 0xD0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_06;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_06 SW MUX Control Register, offset: 0xD4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_07;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_07 SW MUX Control Register, offset: 0xD8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_08;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_08 SW MUX Control Register, offset: 0xDC */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_09;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_09 SW MUX Control Register, offset: 0xE0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_10;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_10 SW MUX Control Register, offset: 0xE4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_11;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_11 SW MUX Control Register, offset: 0xE8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_12;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_12 SW MUX Control Register, offset: 0xEC */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_13;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_13 SW MUX Control Register, offset: 0xF0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_14;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_14 SW MUX Control Register, offset: 0xF4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_15;           /**< SW_MUX_CTL_PAD_GPIO_AD_B0_15 SW MUX Control Register, offset: 0xF8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_00;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_00 SW MUX Control Register, offset: 0xFC */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_01;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_01 SW MUX Control Register, offset: 0x100 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_02;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_02 SW MUX Control Register, offset: 0x104 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_03;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_03 SW MUX Control Register, offset: 0x108 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_04;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_04 SW MUX Control Register, offset: 0x10C */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_05;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_05 SW MUX Control Register, offset: 0x110 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_06;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_06 SW MUX Control Register, offset: 0x114 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_07;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_07 SW MUX Control Register, offset: 0x118 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_08;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_08 SW MUX Control Register, offset: 0x11C */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_09;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_09 SW MUX Control Register, offset: 0x120 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_10;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_10 SW MUX Control Register, offset: 0x124 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_11;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_11 SW MUX Control Register, offset: 0x128 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_12;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_12 SW MUX Control Register, offset: 0x12C */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_13;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_13 SW MUX Control Register, offset: 0x130 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_14;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_14 SW MUX Control Register, offset: 0x134 */
  uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_15;           /**< SW_MUX_CTL_PAD_GPIO_AD_B1_15 SW MUX Control Register, offset: 0x138 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_00;              /**< SW_MUX_CTL_PAD_GPIO_B0_00 SW MUX Control Register, offset: 0x13C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_01;              /**< SW_MUX_CTL_PAD_GPIO_B0_01 SW MUX Control Register, offset: 0x140 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_02;              /**< SW_MUX_CTL_PAD_GPIO_B0_02 SW MUX Control Register, offset: 0x144 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_03;              /**< SW_MUX_CTL_PAD_GPIO_B0_03 SW MUX Control Register, offset: 0x148 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_04;              /**< SW_MUX_CTL_PAD_GPIO_B0_04 SW MUX Control Register, offset: 0x14C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_05;              /**< SW_MUX_CTL_PAD_GPIO_B0_05 SW MUX Control Register, offset: 0x150 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_06;              /**< SW_MUX_CTL_PAD_GPIO_B0_06 SW MUX Control Register, offset: 0x154 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_07;              /**< SW_MUX_CTL_PAD_GPIO_B0_07 SW MUX Control Register, offset: 0x158 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_08;              /**< SW_MUX_CTL_PAD_GPIO_B0_08 SW MUX Control Register, offset: 0x15C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_09;              /**< SW_MUX_CTL_PAD_GPIO_B0_09 SW MUX Control Register, offset: 0x160 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_10;              /**< SW_MUX_CTL_PAD_GPIO_B0_10 SW MUX Control Register, offset: 0x164 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_11;              /**< SW_MUX_CTL_PAD_GPIO_B0_11 SW MUX Control Register, offset: 0x168 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_12;              /**< SW_MUX_CTL_PAD_GPIO_B0_12 SW MUX Control Register, offset: 0x16C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_13;              /**< SW_MUX_CTL_PAD_GPIO_B0_13 SW MUX Control Register, offset: 0x170 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_14;              /**< SW_MUX_CTL_PAD_GPIO_B0_14 SW MUX Control Register, offset: 0x174 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B0_15;              /**< SW_MUX_CTL_PAD_GPIO_B0_15 SW MUX Control Register, offset: 0x178 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_00;              /**< SW_MUX_CTL_PAD_GPIO_B1_00 SW MUX Control Register, offset: 0x17C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_01;              /**< SW_MUX_CTL_PAD_GPIO_B1_01 SW MUX Control Register, offset: 0x180 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_02;              /**< SW_MUX_CTL_PAD_GPIO_B1_02 SW MUX Control Register, offset: 0x184 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_03;              /**< SW_MUX_CTL_PAD_GPIO_B1_03 SW MUX Control Register, offset: 0x188 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_04;              /**< SW_MUX_CTL_PAD_GPIO_B1_04 SW MUX Control Register, offset: 0x18C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_05;              /**< SW_MUX_CTL_PAD_GPIO_B1_05 SW MUX Control Register, offset: 0x190 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_06;              /**< SW_MUX_CTL_PAD_GPIO_B1_06 SW MUX Control Register, offset: 0x194 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_07;              /**< SW_MUX_CTL_PAD_GPIO_B1_07 SW MUX Control Register, offset: 0x198 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_08;              /**< SW_MUX_CTL_PAD_GPIO_B1_08 SW MUX Control Register, offset: 0x19C */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_09;              /**< SW_MUX_CTL_PAD_GPIO_B1_09 SW MUX Control Register, offset: 0x1A0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_10;              /**< SW_MUX_CTL_PAD_GPIO_B1_10 SW MUX Control Register, offset: 0x1A4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_11;              /**< SW_MUX_CTL_PAD_GPIO_B1_11 SW MUX Control Register, offset: 0x1A8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_12;              /**< SW_MUX_CTL_PAD_GPIO_B1_12 SW MUX Control Register, offset: 0x1AC */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_13;              /**< SW_MUX_CTL_PAD_GPIO_B1_13 SW MUX Control Register, offset: 0x1B0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_14;              /**< SW_MUX_CTL_PAD_GPIO_B1_14 SW MUX Control Register, offset: 0x1B4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_B1_15;              /**< SW_MUX_CTL_PAD_GPIO_B1_15 SW MUX Control Register, offset: 0x1B8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_00;           /**< SW_MUX_CTL_PAD_GPIO_SD_B0_00 SW MUX Control Register, offset: 0x1BC */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_01;           /**< SW_MUX_CTL_PAD_GPIO_SD_B0_01 SW MUX Control Register, offset: 0x1C0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_02;           /**< SW_MUX_CTL_PAD_GPIO_SD_B0_02 SW MUX Control Register, offset: 0x1C4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_03;           /**< SW_MUX_CTL_PAD_GPIO_SD_B0_03 SW MUX Control Register, offset: 0x1C8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_04;           /**< SW_MUX_CTL_PAD_GPIO_SD_B0_04 SW MUX Control Register, offset: 0x1CC */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_05;           /**< SW_MUX_CTL_PAD_GPIO_SD_B0_05 SW MUX Control Register, offset: 0x1D0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_00;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_00 SW MUX Control Register, offset: 0x1D4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_01;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_01 SW MUX Control Register, offset: 0x1D8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_02;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_02 SW MUX Control Register, offset: 0x1DC */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_03;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_03 SW MUX Control Register, offset: 0x1E0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_04;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_04 SW MUX Control Register, offset: 0x1E4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_05;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_05 SW MUX Control Register, offset: 0x1E8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_06;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_06 SW MUX Control Register, offset: 0x1EC */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_07;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_07 SW MUX Control Register, offset: 0x1F0 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_08;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_08 SW MUX Control Register, offset: 0x1F4 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_09;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_09 SW MUX Control Register, offset: 0x1F8 */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_10;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_10 SW MUX Control Register, offset: 0x1FC */
  uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_11;           /**< SW_MUX_CTL_PAD_GPIO_SD_B1_11 SW MUX Control Register, offset: 0x200 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_00;             /**< SW_PAD_CTL_PAD_GPIO_EMC_00 SW PAD Control Register, offset: 0x204 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_01;             /**< SW_PAD_CTL_PAD_GPIO_EMC_01 SW PAD Control Register, offset: 0x208 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_02;             /**< SW_PAD_CTL_PAD_GPIO_EMC_02 SW PAD Control Register, offset: 0x20C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_03;             /**< SW_PAD_CTL_PAD_GPIO_EMC_03 SW PAD Control Register, offset: 0x210 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_04;             /**< SW_PAD_CTL_PAD_GPIO_EMC_04 SW PAD Control Register, offset: 0x214 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_05;             /**< SW_PAD_CTL_PAD_GPIO_EMC_05 SW PAD Control Register, offset: 0x218 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_06;             /**< SW_PAD_CTL_PAD_GPIO_EMC_06 SW PAD Control Register, offset: 0x21C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_07;             /**< SW_PAD_CTL_PAD_GPIO_EMC_07 SW PAD Control Register, offset: 0x220 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_08;             /**< SW_PAD_CTL_PAD_GPIO_EMC_08 SW PAD Control Register, offset: 0x224 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_09;             /**< SW_PAD_CTL_PAD_GPIO_EMC_09 SW PAD Control Register, offset: 0x228 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_10;             /**< SW_PAD_CTL_PAD_GPIO_EMC_10 SW PAD Control Register, offset: 0x22C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_11;             /**< SW_PAD_CTL_PAD_GPIO_EMC_11 SW PAD Control Register, offset: 0x230 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_12;             /**< SW_PAD_CTL_PAD_GPIO_EMC_12 SW PAD Control Register, offset: 0x234 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_13;             /**< SW_PAD_CTL_PAD_GPIO_EMC_13 SW PAD Control Register, offset: 0x238 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_14;             /**< SW_PAD_CTL_PAD_GPIO_EMC_14 SW PAD Control Register, offset: 0x23C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_15;             /**< SW_PAD_CTL_PAD_GPIO_EMC_15 SW PAD Control Register, offset: 0x240 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_16;             /**< SW_PAD_CTL_PAD_GPIO_EMC_16 SW PAD Control Register, offset: 0x244 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_17;             /**< SW_PAD_CTL_PAD_GPIO_EMC_17 SW PAD Control Register, offset: 0x248 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_18;             /**< SW_PAD_CTL_PAD_GPIO_EMC_18 SW PAD Control Register, offset: 0x24C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_19;             /**< SW_PAD_CTL_PAD_GPIO_EMC_19 SW PAD Control Register, offset: 0x250 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_20;             /**< SW_PAD_CTL_PAD_GPIO_EMC_20 SW PAD Control Register, offset: 0x254 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_21;             /**< SW_PAD_CTL_PAD_GPIO_EMC_21 SW PAD Control Register, offset: 0x258 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_22;             /**< SW_PAD_CTL_PAD_GPIO_EMC_22 SW PAD Control Register, offset: 0x25C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_23;             /**< SW_PAD_CTL_PAD_GPIO_EMC_23 SW PAD Control Register, offset: 0x260 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_24;             /**< SW_PAD_CTL_PAD_GPIO_EMC_24 SW PAD Control Register, offset: 0x264 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_25;             /**< SW_PAD_CTL_PAD_GPIO_EMC_25 SW PAD Control Register, offset: 0x268 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_26;             /**< SW_PAD_CTL_PAD_GPIO_EMC_26 SW PAD Control Register, offset: 0x26C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_27;             /**< SW_PAD_CTL_PAD_GPIO_EMC_27 SW PAD Control Register, offset: 0x270 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_28;             /**< SW_PAD_CTL_PAD_GPIO_EMC_28 SW PAD Control Register, offset: 0x274 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_29;             /**< SW_PAD_CTL_PAD_GPIO_EMC_29 SW PAD Control Register, offset: 0x278 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_30;             /**< SW_PAD_CTL_PAD_GPIO_EMC_30 SW PAD Control Register, offset: 0x27C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_31;             /**< SW_PAD_CTL_PAD_GPIO_EMC_31 SW PAD Control Register, offset: 0x280 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_32;             /**< SW_PAD_CTL_PAD_GPIO_EMC_32 SW PAD Control Register, offset: 0x284 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_33;             /**< SW_PAD_CTL_PAD_GPIO_EMC_33 SW PAD Control Register, offset: 0x288 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_34;             /**< SW_PAD_CTL_PAD_GPIO_EMC_34 SW PAD Control Register, offset: 0x28C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_35;             /**< SW_PAD_CTL_PAD_GPIO_EMC_35 SW PAD Control Register, offset: 0x290 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_36;             /**< SW_PAD_CTL_PAD_GPIO_EMC_36 SW PAD Control Register, offset: 0x294 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_37;             /**< SW_PAD_CTL_PAD_GPIO_EMC_37 SW PAD Control Register, offset: 0x298 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_38;             /**< SW_PAD_CTL_PAD_GPIO_EMC_38 SW PAD Control Register, offset: 0x29C */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_39;             /**< SW_PAD_CTL_PAD_GPIO_EMC_39 SW PAD Control Register, offset: 0x2A0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_40;             /**< SW_PAD_CTL_PAD_GPIO_EMC_40 SW PAD Control Register, offset: 0x2A4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_EMC_41;             /**< SW_PAD_CTL_PAD_GPIO_EMC_41 SW PAD Control Register, offset: 0x2A8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_00;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_00 SW PAD Control Register, offset: 0x2AC */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_01;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_01 SW PAD Control Register, offset: 0x2B0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_02;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_02 SW PAD Control Register, offset: 0x2B4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_03;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_03 SW PAD Control Register, offset: 0x2B8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_04;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_04 SW PAD Control Register, offset: 0x2BC */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_05;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_05 SW PAD Control Register, offset: 0x2C0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_06;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_06 SW PAD Control Register, offset: 0x2C4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_07;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_07 SW PAD Control Register, offset: 0x2C8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_08;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_08 SW PAD Control Register, offset: 0x2CC */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_09;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_09 SW PAD Control Register, offset: 0x2D0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_10;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_10 SW PAD Control Register, offset: 0x2D4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_11;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_11 SW PAD Control Register, offset: 0x2D8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_12;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_12 SW PAD Control Register, offset: 0x2DC */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_13;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_13 SW PAD Control Register, offset: 0x2E0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_14;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_14 SW PAD Control Register, offset: 0x2E4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_15;           /**< SW_PAD_CTL_PAD_GPIO_AD_B0_15 SW PAD Control Register, offset: 0x2E8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_00;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_00 SW PAD Control Register, offset: 0x2EC */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_01;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_01 SW PAD Control Register, offset: 0x2F0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_02;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_02 SW PAD Control Register, offset: 0x2F4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_03;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_03 SW PAD Control Register, offset: 0x2F8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_04;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_04 SW PAD Control Register, offset: 0x2FC */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_05;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_05 SW PAD Control Register, offset: 0x300 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_06;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_06 SW PAD Control Register, offset: 0x304 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_07;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_07 SW PAD Control Register, offset: 0x308 */
