AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_08;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_08 SW PAD Control Register, offset: 0x30C */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_09;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_09 SW PAD Control Register, offset: 0x310 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_10;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_10 SW PAD Control Register, offset: 0x314 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_11;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_11 SW PAD Control Register, offset: 0x318 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_12;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_12 SW PAD Control Register, offset: 0x31C */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_13;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_13 SW PAD Control Register, offset: 0x320 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_14;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_14 SW PAD Control Register, offset: 0x324 */
  uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_15;           /**< SW_PAD_CTL_PAD_GPIO_AD_B1_15 SW PAD Control Register, offset: 0x328 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_00;              /**< SW_PAD_CTL_PAD_GPIO_B0_00 SW PAD Control Register, offset: 0x32C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_01;              /**< SW_PAD_CTL_PAD_GPIO_B0_01 SW PAD Control Register, offset: 0x330 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_02;              /**< SW_PAD_CTL_PAD_GPIO_B0_02 SW PAD Control Register, offset: 0x334 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_03;              /**< SW_PAD_CTL_PAD_GPIO_B0_03 SW PAD Control Register, offset: 0x338 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_04;              /**< SW_PAD_CTL_PAD_GPIO_B0_04 SW PAD Control Register, offset: 0x33C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_05;              /**< SW_PAD_CTL_PAD_GPIO_B0_05 SW PAD Control Register, offset: 0x340 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_06;              /**< SW_PAD_CTL_PAD_GPIO_B0_06 SW PAD Control Register, offset: 0x344 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_07;              /**< SW_PAD_CTL_PAD_GPIO_B0_07 SW PAD Control Register, offset: 0x348 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_08;              /**< SW_PAD_CTL_PAD_GPIO_B0_08 SW PAD Control Register, offset: 0x34C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_09;              /**< SW_PAD_CTL_PAD_GPIO_B0_09 SW PAD Control Register, offset: 0x350 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_10;              /**< SW_PAD_CTL_PAD_GPIO_B0_10 SW PAD Control Register, offset: 0x354 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_11;              /**< SW_PAD_CTL_PAD_GPIO_B0_11 SW PAD Control Register, offset: 0x358 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_12;              /**< SW_PAD_CTL_PAD_GPIO_B0_12 SW PAD Control Register, offset: 0x35C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_13;              /**< SW_PAD_CTL_PAD_GPIO_B0_13 SW PAD Control Register, offset: 0x360 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_14;              /**< SW_PAD_CTL_PAD_GPIO_B0_14 SW PAD Control Register, offset: 0x364 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B0_15;              /**< SW_PAD_CTL_PAD_GPIO_B0_15 SW PAD Control Register, offset: 0x368 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_00;              /**< SW_PAD_CTL_PAD_GPIO_B1_00 SW PAD Control Register, offset: 0x36C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_01;              /**< SW_PAD_CTL_PAD_GPIO_B1_01 SW PAD Control Register, offset: 0x370 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_02;              /**< SW_PAD_CTL_PAD_GPIO_B1_02 SW PAD Control Register, offset: 0x374 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_03;              /**< SW_PAD_CTL_PAD_GPIO_B1_03 SW PAD Control Register, offset: 0x378 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_04;              /**< SW_PAD_CTL_PAD_GPIO_B1_04 SW PAD Control Register, offset: 0x37C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_05;              /**< SW_PAD_CTL_PAD_GPIO_B1_05 SW PAD Control Register, offset: 0x380 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_06;              /**< SW_PAD_CTL_PAD_GPIO_B1_06 SW PAD Control Register, offset: 0x384 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_07;              /**< SW_PAD_CTL_PAD_GPIO_B1_07 SW PAD Control Register, offset: 0x388 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_08;              /**< SW_PAD_CTL_PAD_GPIO_B1_08 SW PAD Control Register, offset: 0x38C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_09;              /**< SW_PAD_CTL_PAD_GPIO_B1_09 SW PAD Control Register, offset: 0x390 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_10;              /**< SW_PAD_CTL_PAD_GPIO_B1_10 SW PAD Control Register, offset: 0x394 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_11;              /**< SW_PAD_CTL_PAD_GPIO_B1_11 SW PAD Control Register, offset: 0x398 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_12;              /**< SW_PAD_CTL_PAD_GPIO_B1_12 SW PAD Control Register, offset: 0x39C */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_13;              /**< SW_PAD_CTL_PAD_GPIO_B1_13 SW PAD Control Register, offset: 0x3A0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_14;              /**< SW_PAD_CTL_PAD_GPIO_B1_14 SW PAD Control Register, offset: 0x3A4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_B1_15;              /**< SW_PAD_CTL_PAD_GPIO_B1_15 SW PAD Control Register, offset: 0x3A8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_00;           /**< SW_PAD_CTL_PAD_GPIO_SD_B0_00 SW PAD Control Register, offset: 0x3AC */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_01;           /**< SW_PAD_CTL_PAD_GPIO_SD_B0_01 SW PAD Control Register, offset: 0x3B0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_02;           /**< SW_PAD_CTL_PAD_GPIO_SD_B0_02 SW PAD Control Register, offset: 0x3B4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_03;           /**< SW_PAD_CTL_PAD_GPIO_SD_B0_03 SW PAD Control Register, offset: 0x3B8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_04;           /**< SW_PAD_CTL_PAD_GPIO_SD_B0_04 SW PAD Control Register, offset: 0x3BC */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_05;           /**< SW_PAD_CTL_PAD_GPIO_SD_B0_05 SW PAD Control Register, offset: 0x3C0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_00;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_00 SW PAD Control Register, offset: 0x3C4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_01;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_01 SW PAD Control Register, offset: 0x3C8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_02;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_02 SW PAD Control Register, offset: 0x3CC */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_03;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_03 SW PAD Control Register, offset: 0x3D0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_04;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_04 SW PAD Control Register, offset: 0x3D4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_05;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_05 SW PAD Control Register, offset: 0x3D8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_06;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_06 SW PAD Control Register, offset: 0x3DC */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_07;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_07 SW PAD Control Register, offset: 0x3E0 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_08;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_08 SW PAD Control Register, offset: 0x3E4 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_09;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_09 SW PAD Control Register, offset: 0x3E8 */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_10;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_10 SW PAD Control Register, offset: 0x3EC */
  uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_11;           /**< SW_PAD_CTL_PAD_GPIO_SD_B1_11 SW PAD Control Register, offset: 0x3F0 */
  uint32_t ANATOP_USB_OTG1_ID_SELECT_INPUT;        /**< ANATOP_USB_OTG1_ID_SELECT_INPUT DAISY Register, offset: 0x3F4 */
  uint32_t ANATOP_USB_OTG2_ID_SELECT_INPUT;        /**< ANATOP_USB_OTG2_ID_SELECT_INPUT DAISY Register, offset: 0x3F8 */
  uint32_t CCM_PMIC_READY_SELECT_INPUT;            /**< CCM_PMIC_READY_SELECT_INPUT DAISY Register, offset: 0x3FC */
  uint32_t CSI_DATA02_SELECT_INPUT;                /**< CSI_DATA02_SELECT_INPUT DAISY Register, offset: 0x400 */
  uint32_t CSI_DATA03_SELECT_INPUT;                /**< CSI_DATA03_SELECT_INPUT DAISY Register, offset: 0x404 */
  uint32_t CSI_DATA04_SELECT_INPUT;                /**< CSI_DATA04_SELECT_INPUT DAISY Register, offset: 0x408 */
  uint32_t CSI_DATA05_SELECT_INPUT;                /**< CSI_DATA05_SELECT_INPUT DAISY Register, offset: 0x40C */
  uint32_t CSI_DATA06_SELECT_INPUT;                /**< CSI_DATA06_SELECT_INPUT DAISY Register, offset: 0x410 */
  uint32_t CSI_DATA07_SELECT_INPUT;                /**< CSI_DATA07_SELECT_INPUT DAISY Register, offset: 0x414 */
  uint32_t CSI_DATA08_SELECT_INPUT;                /**< CSI_DATA08_SELECT_INPUT DAISY Register, offset: 0x418 */
  uint32_t CSI_DATA09_SELECT_INPUT;                /**< CSI_DATA09_SELECT_INPUT DAISY Register, offset: 0x41C */
  uint32_t CSI_HSYNC_SELECT_INPUT;                 /**< CSI_HSYNC_SELECT_INPUT DAISY Register, offset: 0x420 */
  uint32_t CSI_PIXCLK_SELECT_INPUT;                /**< CSI_PIXCLK_SELECT_INPUT DAISY Register, offset: 0x424 */
  uint32_t CSI_VSYNC_SELECT_INPUT;                 /**< CSI_VSYNC_SELECT_INPUT DAISY Register, offset: 0x428 */
  uint32_t ENET_IPG_CLK_RMII_SELECT_INPUT;         /**< ENET_IPG_CLK_RMII_SELECT_INPUT DAISY Register, offset: 0x42C */
  uint32_t ENET_MDIO_SELECT_INPUT;                 /**< ENET_MDIO_SELECT_INPUT DAISY Register, offset: 0x430 */
  uint32_t ENET0_RXDATA_SELECT_INPUT;              /**< ENET0_RXDATA_SELECT_INPUT DAISY Register, offset: 0x434 */
  uint32_t ENET1_RXDATA_SELECT_INPUT;              /**< ENET1_RXDATA_SELECT_INPUT DAISY Register, offset: 0x438 */
  uint32_t ENET_RXEN_SELECT_INPUT;                 /**< ENET_RXEN_SELECT_INPUT DAISY Register, offset: 0x43C */
  uint32_t ENET_RXERR_SELECT_INPUT;                /**< ENET_RXERR_SELECT_INPUT DAISY Register, offset: 0x440 */
  uint32_t ENET0_TIMER_SELECT_INPUT;               /**< ENET0_TIMER_SELECT_INPUT DAISY Register, offset: 0x444 */
  uint32_t ENET_TXCLK_SELECT_INPUT;                /**< ENET_TXCLK_SELECT_INPUT DAISY Register, offset: 0x448 */
  uint32_t FLEXCAN1_RX_SELECT_INPUT;               /**< FLEXCAN1_RX_SELECT_INPUT DAISY Register, offset: 0x44C */
  uint32_t FLEXCAN2_RX_SELECT_INPUT;               /**< FLEXCAN2_RX_SELECT_INPUT DAISY Register, offset: 0x450 */
  uint32_t FLEXPWM1_PWMA3_SELECT_INPUT;            /**< FLEXPWM1_PWMA3_SELECT_INPUT DAISY Register, offset: 0x454 */
  uint32_t FLEXPWM1_PWMA0_SELECT_INPUT;            /**< FLEXPWM1_PWMA0_SELECT_INPUT DAISY Register, offset: 0x458 */
  uint32_t FLEXPWM1_PWMA1_SELECT_INPUT;            /**< FLEXPWM1_PWMA1_SELECT_INPUT DAISY Register, offset: 0x45C */
  uint32_t FLEXPWM1_PWMA2_SELECT_INPUT;            /**< FLEXPWM1_PWMA2_SELECT_INPUT DAISY Register, offset: 0x460 */
  uint32_t FLEXPWM1_PWMB3_SELECT_INPUT;            /**< FLEXPWM1_PWMB3_SELECT_INPUT DAISY Register, offset: 0x464 */
  uint32_t FLEXPWM1_PWMB0_SELECT_INPUT;            /**< FLEXPWM1_PWMB0_SELECT_INPUT DAISY Register, offset: 0x468 */
  uint32_t FLEXPWM1_PWMB1_SELECT_INPUT;            /**< FLEXPWM1_PWMB1_SELECT_INPUT DAISY Register, offset: 0x46C */
  uint32_t FLEXPWM1_PWMB2_SELECT_INPUT;            /**< FLEXPWM1_PWMB2_SELECT_INPUT DAISY Register, offset: 0x470 */
  uint32_t FLEXPWM2_PWMA3_SELECT_INPUT;            /**< FLEXPWM2_PWMA3_SELECT_INPUT DAISY Register, offset: 0x474 */
  uint32_t FLEXPWM2_PWMA0_SELECT_INPUT;            /**< FLEXPWM2_PWMA0_SELECT_INPUT DAISY Register, offset: 0x478 */
  uint32_t FLEXPWM2_PWMA1_SELECT_INPUT;            /**< FLEXPWM2_PWMA1_SELECT_INPUT DAISY Register, offset: 0x47C */
  uint32_t FLEXPWM2_PWMA2_SELECT_INPUT;            /**< FLEXPWM2_PWMA2_SELECT_INPUT DAISY Register, offset: 0x480 */
  uint32_t FLEXPWM2_PWMB3_SELECT_INPUT;            /**< FLEXPWM2_PWMB3_SELECT_INPUT DAISY Register, offset: 0x484 */
  uint32_t FLEXPWM2_PWMB0_SELECT_INPUT;            /**< FLEXPWM2_PWMB0_SELECT_INPUT DAISY Register, offset: 0x488 */
  uint32_t FLEXPWM2_PWMB1_SELECT_INPUT;            /**< FLEXPWM2_PWMB1_SELECT_INPUT DAISY Register, offset: 0x48C */
  uint32_t FLEXPWM2_PWMB2_SELECT_INPUT;            /**< FLEXPWM2_PWMB2_SELECT_INPUT DAISY Register, offset: 0x490 */
  uint32_t FLEXPWM4_PWMA0_SELECT_INPUT;            /**< FLEXPWM4_PWMA0_SELECT_INPUT DAISY Register, offset: 0x494 */
  uint32_t FLEXPWM4_PWMA1_SELECT_INPUT;            /**< FLEXPWM4_PWMA1_SELECT_INPUT DAISY Register, offset: 0x498 */
  uint32_t FLEXPWM4_PWMA2_SELECT_INPUT;            /**< FLEXPWM4_PWMA2_SELECT_INPUT DAISY Register, offset: 0x49C */
  uint32_t FLEXPWM4_PWMA3_SELECT_INPUT;            /**< FLEXPWM4_PWMA3_SELECT_INPUT DAISY Register, offset: 0x4A0 */
  uint32_t FLEXSPIA_DQS_SELECT_INPUT;              /**< FLEXSPIA_DQS_SELECT_INPUT DAISY Register, offset: 0x4A4 */
  uint32_t FLEXSPIA_DATA0_SELECT_INPUT;            /**< FLEXSPIA_DATA0_SELECT_INPUT DAISY Register, offset: 0x4A8 */
  uint32_t FLEXSPIA_DATA1_SELECT_INPUT;            /**< FLEXSPIA_DATA1_SELECT_INPUT DAISY Register, offset: 0x4AC */
  uint32_t FLEXSPIA_DATA2_SELECT_INPUT;            /**< FLEXSPIA_DATA2_SELECT_INPUT DAISY Register, offset: 0x4B0 */
  uint32_t FLEXSPIA_DATA3_SELECT_INPUT;            /**< FLEXSPIA_DATA3_SELECT_INPUT DAISY Register, offset: 0x4B4 */
  uint32_t FLEXSPIB_DATA0_SELECT_INPUT;            /**< FLEXSPIB_DATA0_SELECT_INPUT DAISY Register, offset: 0x4B8 */
  uint32_t FLEXSPIB_DATA1_SELECT_INPUT;            /**< FLEXSPIB_DATA1_SELECT_INPUT DAISY Register, offset: 0x4BC */
  uint32_t FLEXSPIB_DATA2_SELECT_INPUT;            /**< FLEXSPIB_DATA2_SELECT_INPUT DAISY Register, offset: 0x4C0 */
  uint32_t FLEXSPIB_DATA3_SELECT_INPUT;            /**< FLEXSPIB_DATA3_SELECT_INPUT DAISY Register, offset: 0x4C4 */
  uint32_t FLEXSPIA_SCK_SELECT_INPUT;              /**< FLEXSPIA_SCK_SELECT_INPUT DAISY Register, offset: 0x4C8 */
  uint32_t LPI2C1_SCL_SELECT_INPUT;                /**< LPI2C1_SCL_SELECT_INPUT DAISY Register, offset: 0x4CC */
  uint32_t LPI2C1_SDA_SELECT_INPUT;                /**< LPI2C1_SDA_SELECT_INPUT DAISY Register, offset: 0x4D0 */
  uint32_t LPI2C2_SCL_SELECT_INPUT;                /**< LPI2C2_SCL_SELECT_INPUT DAISY Register, offset: 0x4D4 */
  uint32_t LPI2C2_SDA_SELECT_INPUT;                /**< LPI2C2_SDA_SELECT_INPUT DAISY Register, offset: 0x4D8 */
  uint32_t LPI2C3_SCL_SELECT_INPUT;                /**< LPI2C3_SCL_SELECT_INPUT DAISY Register, offset: 0x4DC */
  uint32_t LPI2C3_SDA_SELECT_INPUT;                /**< LPI2C3_SDA_SELECT_INPUT DAISY Register, offset: 0x4E0 */
  uint32_t LPI2C4_SCL_SELECT_INPUT;                /**< LPI2C4_SCL_SELECT_INPUT DAISY Register, offset: 0x4E4 */
  uint32_t LPI2C4_SDA_SELECT_INPUT;                /**< LPI2C4_SDA_SELECT_INPUT DAISY Register, offset: 0x4E8 */
  uint32_t LPSPI1_PCS0_SELECT_INPUT;               /**< LPSPI1_PCS0_SELECT_INPUT DAISY Register, offset: 0x4EC */
  uint32_t LPSPI1_SCK_SELECT_INPUT;                /**< LPSPI1_SCK_SELECT_INPUT DAISY Register, offset: 0x4F0 */
  uint32_t LPSPI1_SDI_SELECT_INPUT;                /**< LPSPI1_SDI_SELECT_INPUT DAISY Register, offset: 0x4F4 */
  uint32_t LPSPI1_SDO_SELECT_INPUT;                /**< LPSPI1_SDO_SELECT_INPUT DAISY Register, offset: 0x4F8 */
  uint32_t LPSPI2_PCS0_SELECT_INPUT;               /**< LPSPI2_PCS0_SELECT_INPUT DAISY Register, offset: 0x4FC */
  uint32_t LPSPI2_SCK_SELECT_INPUT;                /**< LPSPI2_SCK_SELECT_INPUT DAISY Register, offset: 0x500 */
  uint32_t LPSPI2_SDI_SELECT_INPUT;                /**< LPSPI2_SDI_SELECT_INPUT DAISY Register, offset: 0x504 */
  uint32_t LPSPI2_SDO_SELECT_INPUT;                /**< LPSPI2_SDO_SELECT_INPUT DAISY Register, offset: 0x508 */
  uint32_t LPSPI3_PCS0_SELECT_INPUT;               /**< LPSPI3_PCS0_SELECT_INPUT DAISY Register, offset: 0x50C */
  uint32_t LPSPI3_SCK_SELECT_INPUT;                /**< LPSPI3_SCK_SELECT_INPUT DAISY Register, offset: 0x510 */
  uint32_t LPSPI3_SDI_SELECT_INPUT;                /**< LPSPI3_SDI_SELECT_INPUT DAISY Register, offset: 0x514 */
  uint32_t LPSPI3_SDO_SELECT_INPUT;                /**< LPSPI3_SDO_SELECT_INPUT DAISY Register, offset: 0x518 */
  uint32_t LPSPI4_PCS0_SELECT_INPUT;               /**< LPSPI4_PCS0_SELECT_INPUT DAISY Register, offset: 0x51C */
  uint32_t LPSPI4_SCK_SELECT_INPUT;                /**< LPSPI4_SCK_SELECT_INPUT DAISY Register, offset: 0x520 */
  uint32_t LPSPI4_SDI_SELECT_INPUT;                /**< LPSPI4_SDI_SELECT_INPUT DAISY Register, offset: 0x524 */
  uint32_t LPSPI4_SDO_SELECT_INPUT;                /**< LPSPI4_SDO_SELECT_INPUT DAISY Register, offset: 0x528 */
  uint32_t LPUART2_RX_SELECT_INPUT;                /**< LPUART2_RX_SELECT_INPUT DAISY Register, offset: 0x52C */
  uint32_t LPUART2_TX_SELECT_INPUT;                /**< LPUART2_TX_SELECT_INPUT DAISY Register, offset: 0x530 */
  uint32_t LPUART3_CTS_B_SELECT_INPUT;             /**< LPUART3_CTS_B_SELECT_INPUT DAISY Register, offset: 0x534 */
  uint32_t LPUART3_RX_SELECT_INPUT;                /**< LPUART3_RX_SELECT_INPUT DAISY Register, offset: 0x538 */
  uint32_t LPUART3_TX_SELECT_INPUT;                /**< LPUART3_TX_SELECT_INPUT DAISY Register, offset: 0x53C */
  uint32_t LPUART4_RX_SELECT_INPUT;                /**< LPUART4_RX_SELECT_INPUT DAISY Register, offset: 0x540 */
  uint32_t LPUART4_TX_SELECT_INPUT;                /**< LPUART4_TX_SELECT_INPUT DAISY Register, offset: 0x544 */
  uint32_t LPUART5_RX_SELECT_INPUT;                /**< LPUART5_RX_SELECT_INPUT DAISY Register, offset: 0x548 */
  uint32_t LPUART5_TX_SELECT_INPUT;                /**< LPUART5_TX_SELECT_INPUT DAISY Register, offset: 0x54C */
  uint32_t LPUART6_RX_SELECT_INPUT;                /**< LPUART6_RX_SELECT_INPUT DAISY Register, offset: 0x550 */
  uint32_t LPUART6_TX_SELECT_INPUT;                /**< LPUART6_TX_SELECT_INPUT DAISY Register, offset: 0x554 */
  uint32_t LPUART7_RX_SELECT_INPUT;                /**< LPUART7_RX_SELECT_INPUT DAISY Register, offset: 0x558 */
  uint32_t LPUART7_TX_SELECT_INPUT;                /**< LPUART7_TX_SELECT_INPUT DAISY Register, offset: 0x55C */
  uint32_t LPUART8_RX_SELECT_INPUT;                /**< LPUART8_RX_SELECT_INPUT DAISY Register, offset: 0x560 */
  uint32_t LPUART8_TX_SELECT_INPUT;                /**< LPUART8_TX_SELECT_INPUT DAISY Register, offset: 0x564 */
  uint32_t NMI_SELECT_INPUT;                       /**< NMI_GLUE_NMI_SELECT_INPUT DAISY Register, offset: 0x568 */
  uint32_t QTIMER2_TIMER0_SELECT_INPUT;            /**< QTIMER2_TIMER0_SELECT_INPUT DAISY Register, offset: 0x56C */
  uint32_t QTIMER2_TIMER1_SELECT_INPUT;            /**< QTIMER2_TIMER1_SELECT_INPUT DAISY Register, offset: 0x570 */
  uint32_t QTIMER2_TIMER2_SELECT_INPUT;            /**< QTIMER2_TIMER2_SELECT_INPUT DAISY Register, offset: 0x574 */
  uint32_t QTIMER2_TIMER3_SELECT_INPUT;            /**< QTIMER2_TIMER3_SELECT_INPUT DAISY Register, offset: 0x578 */
  uint32_t QTIMER3_TIMER0_SELECT_INPUT;            /**< QTIMER3_TIMER0_SELECT_INPUT DAISY Register, offset: 0x57C */
  uint32_t QTIMER3_TIMER1_SELECT_INPUT;            /**< QTIMER3_TIMER1_SELECT_INPUT DAISY Register, offset: 0x580 */
  uint32_t QTIMER3_TIMER2_SELECT_INPUT;            /**< QTIMER3_TIMER2_SELECT_INPUT DAISY Register, offset: 0x584 */
  uint32_t QTIMER3_TIMER3_SELECT_INPUT;            /**< QTIMER3_TIMER3_SELECT_INPUT DAISY Register, offset: 0x588 */
  uint32_t SAI1_MCLK2_SELECT_INPUT;                /**< SAI1_MCLK2_SELECT_INPUT DAISY Register, offset: 0x58C */
  uint32_t SAI1_RX_BCLK_SELECT_INPUT;              /**< SAI1_RX_BCLK_SELECT_INPUT DAISY Register, offset: 0x590 */
  uint32_t SAI1_RX_DATA0_SELECT_INPUT;             /**< SAI1_RX_DATA0_SELECT_INPUT DAISY Register, offset: 0x594 */
  uint32_t SAI1_RX_DATA1_SELECT_INPUT;             /**< SAI1_RX_DATA1_SELECT_INPUT DAISY Register, offset: 0x598 */
  uint32_t SAI1_RX_DATA2_SELECT_INPUT;             /**< SAI1_RX_DATA2_SELECT_INPUT DAISY Register, offset: 0x59C */
  uint32_t SAI1_RX_DATA3_SELECT_INPUT;             /**< SAI1_RX_DATA3_SELECT_INPUT DAISY Register, offset: 0x5A0 */
  uint32_t SAI1_RX_SYNC_SELECT_INPUT;              /**< SAI1_RX_SYNC_SELECT_INPUT DAISY Register, offset: 0x5A4 */
  uint32_t SAI1_TX_BCLK_SELECT_INPUT;              /**< SAI1_TX_BCLK_SELECT_INPUT DAISY Register, offset: 0x5A8 */
  uint32_t SAI1_TX_SYNC_SELECT_INPUT;              /**< SAI1_TX_SYNC_SELECT_INPUT DAISY Register, offset: 0x5AC */
  uint32_t SAI2_MCLK2_SELECT_INPUT;                /**< SAI2_MCLK2_SELECT_INPUT DAISY Register, offset: 0x5B0 */
  uint32_t SAI2_RX_BCLK_SELECT_INPUT;              /**< SAI2_RX_BCLK_SELECT_INPUT DAISY Register, offset: 0x5B4 */
  uint32_t SAI2_RX_DATA0_SELECT_INPUT;             /**< SAI2_RX_DATA0_SELECT_INPUT DAISY Register, offset: 0x5B8 */
  uint32_t SAI2_RX_SYNC_SELECT_INPUT;              /**< SAI2_RX_SYNC_SELECT_INPUT DAISY Register, offset: 0x5BC */
  uint32_t SAI2_TX_BCLK_SELECT_INPUT;              /**< SAI2_TX_BCLK_SELECT_INPUT DAISY Register, offset: 0x5C0 */
  uint32_t SAI2_TX_SYNC_SELECT_INPUT;              /**< SAI2_TX_SYNC_SELECT_INPUT DAISY Register, offset: 0x5C4 */
  uint32_t SPDIF_IN_SELECT_INPUT;                  /**< SPDIF_IN_SELECT_INPUT DAISY Register, offset: 0x5C8 */
  uint32_t USB_OTG2_OC_SELECT_INPUT;               /**< USB_OTG2_OC_SELECT_INPUT DAISY Register, offset: 0x5CC */
  uint32_t USB_OTG1_OC_SELECT_INPUT;               /**< USB_OTG1_OC_SELECT_INPUT DAISY Register, offset: 0x5D0 */
  uint32_t USDHC1_CD_B_SELECT_INPUT;               /**< USDHC1_CD_B_SELECT_INPUT DAISY Register, offset: 0x5D4 */
  uint32_t USDHC1_WP_SELECT_INPUT;                 /**< USDHC1_WP_SELECT_INPUT DAISY Register, offset: 0x5D8 */
  uint32_t USDHC2_CLK_SELECT_INPUT;                /**< USDHC2_CLK_SELECT_INPUT DAISY Register, offset: 0x5DC */
  uint32_t USDHC2_CD_B_SELECT_INPUT;               /**< USDHC2_CD_B_SELECT_INPUT DAISY Register, offset: 0x5E0 */
  uint32_t USDHC2_CMD_SELECT_INPUT;                /**< USDHC2_CMD_SELECT_INPUT DAISY Register, offset: 0x5E4 */
  uint32_t USDHC2_DATA0_SELECT_INPUT;              /**< USDHC2_DATA0_SELECT_INPUT DAISY Register, offset: 0x5E8 */
  uint32_t USDHC2_DATA1_SELECT_INPUT;              /**< USDHC2_DATA1_SELECT_INPUT DAISY Register, offset: 0x5EC */
  uint32_t USDHC2_DATA2_SELECT_INPUT;              /**< USDHC2_DATA2_SELECT_INPUT DAISY Register, offset: 0x5F0 */
  uint32_t USDHC2_DATA3_SELECT_INPUT;              /**< USDHC2_DATA3_SELECT_INPUT DAISY Register, offset: 0x5F4 */
  uint32_t USDHC2_DATA4_SELECT_INPUT;              /**< USDHC2_DATA4_SELECT_INPUT DAISY Register, offset: 0x5F8 */
  uint32_t USDHC2_DATA5_SELECT_INPUT;              /**< USDHC2_DATA5_SELECT_INPUT DAISY Register, offset: 0x5FC */
  uint32_t USDHC2_DATA6_SELECT_INPUT;              /**< USDHC2_DATA6_SELECT_INPUT DAISY Register, offset: 0x600 */
  uint32_t USDHC2_DATA7_SELECT_INPUT;              /**< USDHC2_DATA7_SELECT_INPUT DAISY Register, offset: 0x604 */
  uint32_t USDHC2_WP_SELECT_INPUT;                 /**< USDHC2_WP_SELECT_INPUT DAISY Register, offset: 0x608 */
  uint32_t XBAR1_IN02_SELECT_INPUT;                /**< XBAR1_IN02_SELECT_INPUT DAISY Register, offset: 0x60C */
  uint32_t XBAR1_IN03_SELECT_INPUT;                /**< XBAR1_IN03_SELECT_INPUT DAISY Register, offset: 0x610 */
  uint32_t XBAR1_IN04_SELECT_INPUT;                /**< XBAR1_IN04_SELECT_INPUT DAISY Register, offset: 0x614 */
  uint32_t XBAR1_IN05_SELECT_INPUT;                /**< XBAR1_IN05_SELECT_INPUT DAISY Register, offset: 0x618 */
  uint32_t XBAR1_IN06_SELECT_INPUT;                /**< XBAR1_IN06_SELECT_INPUT DAISY Register, offset: 0x61C */
  uint32_t XBAR1_IN07_SELECT_INPUT;                /**< XBAR1_IN07_SELECT_INPUT DAISY Register, offset: 0x620 */
  uint32_t XBAR1_IN08_SELECT_INPUT;                /**< XBAR1_IN08_SELECT_INPUT DAISY Register, offset: 0x624 */
  uint32_t XBAR1_IN09_SELECT_INPUT;                /**< XBAR1_IN09_SELECT_INPUT DAISY Register, offset: 0x628 */
  uint32_t XBAR1_IN17_SELECT_INPUT;                /**< XBAR1_IN17_SELECT_INPUT DAISY Register, offset: 0x62C */
  uint32_t XBAR1_IN18_SELECT_INPUT;                /**< XBAR1_IN18_SELECT_INPUT DAISY Register, offset: 0x630 */
  uint32_t XBAR1_IN20_SELECT_INPUT;                /**< XBAR1_IN20_SELECT_INPUT DAISY Register, offset: 0x634 */
