AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
  uint32_t XBAR1_IN22_SELECT_INPUT;                /**< XBAR1_IN22_SELECT_INPUT DAISY Register, offset: 0x638 */
  uint32_t XBAR1_IN23_SELECT_INPUT;                /**< XBAR1_IN23_SELECT_INPUT DAISY Register, offset: 0x63C */
  uint32_t XBAR1_IN24_SELECT_INPUT;                /**< XBAR1_IN24_SELECT_INPUT DAISY Register, offset: 0x640 */
  uint32_t XBAR1_IN14_SELECT_INPUT;                /**< XBAR1_IN14_SELECT_INPUT DAISY Register, offset: 0x644 */
  uint32_t XBAR1_IN15_SELECT_INPUT;                /**< XBAR1_IN15_SELECT_INPUT DAISY Register, offset: 0x648 */
  uint32_t XBAR1_IN16_SELECT_INPUT;                /**< XBAR1_IN16_SELECT_INPUT DAISY Register, offset: 0x64C */
  uint32_t XBAR1_IN25_SELECT_INPUT;                /**< XBAR1_IN25_SELECT_INPUT DAISY Register, offset: 0x650 */
  uint32_t XBAR1_IN19_SELECT_INPUT;                /**< XBAR1_IN19_SELECT_INPUT DAISY Register, offset: 0x654 */
  uint32_t XBAR1_IN21_SELECT_INPUT;                /**< XBAR1_IN23_SELECT_INPUT DAISY Register, offset: 0x658 */
} volatile *IOMUXC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- IOMUXC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_Register_Accessor_Macros IOMUXC - Register accessor macros
 * @{
 */


/* IOMUXC - Register accessors */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_06)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_07)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_08)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_09)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_10)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_11)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_12)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_13)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_14)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_15)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_16)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_17)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_18)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_19)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_20)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_21)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_22)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_23)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_24)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_25)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_26)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_27)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_28)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_29)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_30)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_31)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_32)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_33)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_34)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_35)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_36)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_37)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_38)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_39)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_40)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_EMC_41)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_06)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_07)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_08)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_09)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_10)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_11)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_12)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_13)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_14)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B0_15)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_06_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_06)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_07_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_07)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_08_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_08)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_09_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_09)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_10_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_10)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_11_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_11)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_12_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_12)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_13_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_13)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_14_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_14)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_15_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_AD_B1_15)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_06_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_06)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_07_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_07)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_08_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_08)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_09_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_09)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_10_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_10)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_11_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_11)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_12_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_12)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_13_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_13)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_14_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_14)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_15_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B0_15)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_06_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_06)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_07_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_07)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_08_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_08)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_09)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_10)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_11)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_12)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_13)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_14)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_B1_15)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B0_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B0_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B0_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B0_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B0_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B0_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_00)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_01)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_02)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_03)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_04)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_05)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_06)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_07)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_08)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_09)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_10_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_10)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_11_REG(base) ((base)->SW_MUX_CTL_PAD_GPIO_SD_B1_11)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_06_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_06)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_07_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_07)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_08_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_08)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_09_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_09)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_10_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_10)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_11_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_11)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_12_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_12)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_13_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_13)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_14_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_14)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_15_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_15)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_16)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_17)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_18)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_19)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_20)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_21)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_22)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_23_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_23)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_24_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_24)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_25_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_25)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_26_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_26)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_27_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_27)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_28_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_28)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_29_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_29)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_30_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_30)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_31_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_31)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_32_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_32)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_33_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_33)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_34)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_35)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_36)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_37)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_38_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_38)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_39_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_39)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_40_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_40)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_41_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_EMC_41)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_06_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_06)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_07_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_07)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_08)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_09)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_10)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_11)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_12)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_13)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_14_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_14)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_15_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B0_15)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_06_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_06)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_07_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_07)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_08_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_08)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_09_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_09)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_10)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_11)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_12)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_13)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_14)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_AD_B1_15)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_06)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_07)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_08)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_09_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_09)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_10_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_10)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_11_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_11)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_12_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_12)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_13_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_13)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_14_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_14)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_15_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B0_15)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_06_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_06)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_07_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_07)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_08_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_08)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_09_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_09)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_10_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_10)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_11_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_11)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_12_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_12)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_13_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_13)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_14_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_14)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_15_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_B1_15)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B0_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B0_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B0_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B0_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B0_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B0_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_00)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_01)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_02)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_03)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_04)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_05)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_06)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_07)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_08)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_09)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_10)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_REG(base) ((base)->SW_PAD_CTL_PAD_GPIO_SD_B1_11)
#define IOMUXC_ANATOP_USB_OTG1_ID_SELECT_INPUT_REG(base) ((base)->ANATOP_USB_OTG1_ID_SELECT_INPUT)
#define IOMUXC_ANATOP_USB_OTG2_ID_SELECT_INPUT_REG(base) ((base)->ANATOP_USB_OTG2_ID_SELECT_INPUT)
