AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
#define IOMUXC_CCM_PMIC_READY_SELECT_INPUT_REG(base) ((base)->CCM_PMIC_READY_SELECT_INPUT)
#define IOMUXC_CSI_DATA02_SELECT_INPUT_REG(base) ((base)->CSI_DATA02_SELECT_INPUT)
#define IOMUXC_CSI_DATA03_SELECT_INPUT_REG(base) ((base)->CSI_DATA03_SELECT_INPUT)
#define IOMUXC_CSI_DATA04_SELECT_INPUT_REG(base) ((base)->CSI_DATA04_SELECT_INPUT)
#define IOMUXC_CSI_DATA05_SELECT_INPUT_REG(base) ((base)->CSI_DATA05_SELECT_INPUT)
#define IOMUXC_CSI_DATA06_SELECT_INPUT_REG(base) ((base)->CSI_DATA06_SELECT_INPUT)
#define IOMUXC_CSI_DATA07_SELECT_INPUT_REG(base) ((base)->CSI_DATA07_SELECT_INPUT)
#define IOMUXC_CSI_DATA08_SELECT_INPUT_REG(base) ((base)->CSI_DATA08_SELECT_INPUT)
#define IOMUXC_CSI_DATA09_SELECT_INPUT_REG(base) ((base)->CSI_DATA09_SELECT_INPUT)
#define IOMUXC_CSI_HSYNC_SELECT_INPUT_REG(base)  ((base)->CSI_HSYNC_SELECT_INPUT)
#define IOMUXC_CSI_PIXCLK_SELECT_INPUT_REG(base) ((base)->CSI_PIXCLK_SELECT_INPUT)
#define IOMUXC_CSI_VSYNC_SELECT_INPUT_REG(base)  ((base)->CSI_VSYNC_SELECT_INPUT)
#define IOMUXC_ENET_IPG_CLK_RMII_SELECT_INPUT_REG(base) ((base)->ENET_IPG_CLK_RMII_SELECT_INPUT)
#define IOMUXC_ENET_MDIO_SELECT_INPUT_REG(base)  ((base)->ENET_MDIO_SELECT_INPUT)
#define IOMUXC_ENET0_RXDATA_SELECT_INPUT_REG(base) ((base)->ENET0_RXDATA_SELECT_INPUT)
#define IOMUXC_ENET1_RXDATA_SELECT_INPUT_REG(base) ((base)->ENET1_RXDATA_SELECT_INPUT)
#define IOMUXC_ENET_RXEN_SELECT_INPUT_REG(base)  ((base)->ENET_RXEN_SELECT_INPUT)
#define IOMUXC_ENET_RXERR_SELECT_INPUT_REG(base) ((base)->ENET_RXERR_SELECT_INPUT)
#define IOMUXC_ENET0_TIMER_SELECT_INPUT_REG(base) ((base)->ENET0_TIMER_SELECT_INPUT)
#define IOMUXC_ENET_TXCLK_SELECT_INPUT_REG(base) ((base)->ENET_TXCLK_SELECT_INPUT)
#define IOMUXC_FLEXCAN1_RX_SELECT_INPUT_REG(base) ((base)->FLEXCAN1_RX_SELECT_INPUT)
#define IOMUXC_FLEXCAN2_RX_SELECT_INPUT_REG(base) ((base)->FLEXCAN2_RX_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMA3_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMA0_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMA0_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMA1_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMA1_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMA2_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMA2_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMB3_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMB0_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMB0_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMB1_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMB1_SELECT_INPUT)
#define IOMUXC_FLEXPWM1_PWMB2_SELECT_INPUT_REG(base) ((base)->FLEXPWM1_PWMB2_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMA3_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMA0_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMA0_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMA1_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMA1_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMA2_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMA2_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMB3_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMB0_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMB0_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMB1_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMB1_SELECT_INPUT)
#define IOMUXC_FLEXPWM2_PWMB2_SELECT_INPUT_REG(base) ((base)->FLEXPWM2_PWMB2_SELECT_INPUT)
#define IOMUXC_FLEXPWM4_PWMA0_SELECT_INPUT_REG(base) ((base)->FLEXPWM4_PWMA0_SELECT_INPUT)
#define IOMUXC_FLEXPWM4_PWMA1_SELECT_INPUT_REG(base) ((base)->FLEXPWM4_PWMA1_SELECT_INPUT)
#define IOMUXC_FLEXPWM4_PWMA2_SELECT_INPUT_REG(base) ((base)->FLEXPWM4_PWMA2_SELECT_INPUT)
#define IOMUXC_FLEXPWM4_PWMA3_SELECT_INPUT_REG(base) ((base)->FLEXPWM4_PWMA3_SELECT_INPUT)
#define IOMUXC_FLEXSPIA_DQS_SELECT_INPUT_REG(base) ((base)->FLEXSPIA_DQS_SELECT_INPUT)
#define IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT_REG(base) ((base)->FLEXSPIA_DATA0_SELECT_INPUT)
#define IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT_REG(base) ((base)->FLEXSPIA_DATA1_SELECT_INPUT)
#define IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT_REG(base) ((base)->FLEXSPIA_DATA2_SELECT_INPUT)
#define IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT_REG(base) ((base)->FLEXSPIA_DATA3_SELECT_INPUT)
#define IOMUXC_FLEXSPIB_DATA0_SELECT_INPUT_REG(base) ((base)->FLEXSPIB_DATA0_SELECT_INPUT)
#define IOMUXC_FLEXSPIB_DATA1_SELECT_INPUT_REG(base) ((base)->FLEXSPIB_DATA1_SELECT_INPUT)
#define IOMUXC_FLEXSPIB_DATA2_SELECT_INPUT_REG(base) ((base)->FLEXSPIB_DATA2_SELECT_INPUT)
#define IOMUXC_FLEXSPIB_DATA3_SELECT_INPUT_REG(base) ((base)->FLEXSPIB_DATA3_SELECT_INPUT)
#define IOMUXC_FLEXSPIA_SCK_SELECT_INPUT_REG(base) ((base)->FLEXSPIA_SCK_SELECT_INPUT)
#define IOMUXC_LPI2C1_SCL_SELECT_INPUT_REG(base) ((base)->LPI2C1_SCL_SELECT_INPUT)
#define IOMUXC_LPI2C1_SDA_SELECT_INPUT_REG(base) ((base)->LPI2C1_SDA_SELECT_INPUT)
#define IOMUXC_LPI2C2_SCL_SELECT_INPUT_REG(base) ((base)->LPI2C2_SCL_SELECT_INPUT)
#define IOMUXC_LPI2C2_SDA_SELECT_INPUT_REG(base) ((base)->LPI2C2_SDA_SELECT_INPUT)
#define IOMUXC_LPI2C3_SCL_SELECT_INPUT_REG(base) ((base)->LPI2C3_SCL_SELECT_INPUT)
#define IOMUXC_LPI2C3_SDA_SELECT_INPUT_REG(base) ((base)->LPI2C3_SDA_SELECT_INPUT)
#define IOMUXC_LPI2C4_SCL_SELECT_INPUT_REG(base) ((base)->LPI2C4_SCL_SELECT_INPUT)
#define IOMUXC_LPI2C4_SDA_SELECT_INPUT_REG(base) ((base)->LPI2C4_SDA_SELECT_INPUT)
#define IOMUXC_LPSPI1_PCS0_SELECT_INPUT_REG(base) ((base)->LPSPI1_PCS0_SELECT_INPUT)
#define IOMUXC_LPSPI1_SCK_SELECT_INPUT_REG(base) ((base)->LPSPI1_SCK_SELECT_INPUT)
#define IOMUXC_LPSPI1_SDI_SELECT_INPUT_REG(base) ((base)->LPSPI1_SDI_SELECT_INPUT)
#define IOMUXC_LPSPI1_SDO_SELECT_INPUT_REG(base) ((base)->LPSPI1_SDO_SELECT_INPUT)
#define IOMUXC_LPSPI2_PCS0_SELECT_INPUT_REG(base) ((base)->LPSPI2_PCS0_SELECT_INPUT)
#define IOMUXC_LPSPI2_SCK_SELECT_INPUT_REG(base) ((base)->LPSPI2_SCK_SELECT_INPUT)
#define IOMUXC_LPSPI2_SDI_SELECT_INPUT_REG(base) ((base)->LPSPI2_SDI_SELECT_INPUT)
#define IOMUXC_LPSPI2_SDO_SELECT_INPUT_REG(base) ((base)->LPSPI2_SDO_SELECT_INPUT)
#define IOMUXC_LPSPI3_PCS0_SELECT_INPUT_REG(base) ((base)->LPSPI3_PCS0_SELECT_INPUT)
#define IOMUXC_LPSPI3_SCK_SELECT_INPUT_REG(base) ((base)->LPSPI3_SCK_SELECT_INPUT)
#define IOMUXC_LPSPI3_SDI_SELECT_INPUT_REG(base) ((base)->LPSPI3_SDI_SELECT_INPUT)
#define IOMUXC_LPSPI3_SDO_SELECT_INPUT_REG(base) ((base)->LPSPI3_SDO_SELECT_INPUT)
#define IOMUXC_LPSPI4_PCS0_SELECT_INPUT_REG(base) ((base)->LPSPI4_PCS0_SELECT_INPUT)
#define IOMUXC_LPSPI4_SCK_SELECT_INPUT_REG(base) ((base)->LPSPI4_SCK_SELECT_INPUT)
#define IOMUXC_LPSPI4_SDI_SELECT_INPUT_REG(base) ((base)->LPSPI4_SDI_SELECT_INPUT)
#define IOMUXC_LPSPI4_SDO_SELECT_INPUT_REG(base) ((base)->LPSPI4_SDO_SELECT_INPUT)
#define IOMUXC_LPUART2_RX_SELECT_INPUT_REG(base) ((base)->LPUART2_RX_SELECT_INPUT)
#define IOMUXC_LPUART2_TX_SELECT_INPUT_REG(base) ((base)->LPUART2_TX_SELECT_INPUT)
#define IOMUXC_LPUART3_CTS_B_SELECT_INPUT_REG(base) ((base)->LPUART3_CTS_B_SELECT_INPUT)
#define IOMUXC_LPUART3_RX_SELECT_INPUT_REG(base) ((base)->LPUART3_RX_SELECT_INPUT)
#define IOMUXC_LPUART3_TX_SELECT_INPUT_REG(base) ((base)->LPUART3_TX_SELECT_INPUT)
#define IOMUXC_LPUART4_RX_SELECT_INPUT_REG(base) ((base)->LPUART4_RX_SELECT_INPUT)
#define IOMUXC_LPUART4_TX_SELECT_INPUT_REG(base) ((base)->LPUART4_TX_SELECT_INPUT)
#define IOMUXC_LPUART5_RX_SELECT_INPUT_REG(base) ((base)->LPUART5_RX_SELECT_INPUT)
#define IOMUXC_LPUART5_TX_SELECT_INPUT_REG(base) ((base)->LPUART5_TX_SELECT_INPUT)
#define IOMUXC_LPUART6_RX_SELECT_INPUT_REG(base) ((base)->LPUART6_RX_SELECT_INPUT)
#define IOMUXC_LPUART6_TX_SELECT_INPUT_REG(base) ((base)->LPUART6_TX_SELECT_INPUT)
#define IOMUXC_LPUART7_RX_SELECT_INPUT_REG(base) ((base)->LPUART7_RX_SELECT_INPUT)
#define IOMUXC_LPUART7_TX_SELECT_INPUT_REG(base) ((base)->LPUART7_TX_SELECT_INPUT)
#define IOMUXC_LPUART8_RX_SELECT_INPUT_REG(base) ((base)->LPUART8_RX_SELECT_INPUT)
#define IOMUXC_LPUART8_TX_SELECT_INPUT_REG(base) ((base)->LPUART8_TX_SELECT_INPUT)
#define IOMUXC_NMI_SELECT_INPUT_REG(base)        ((base)->NMI_SELECT_INPUT)
#define IOMUXC_QTIMER2_TIMER0_SELECT_INPUT_REG(base) ((base)->QTIMER2_TIMER0_SELECT_INPUT)
#define IOMUXC_QTIMER2_TIMER1_SELECT_INPUT_REG(base) ((base)->QTIMER2_TIMER1_SELECT_INPUT)
#define IOMUXC_QTIMER2_TIMER2_SELECT_INPUT_REG(base) ((base)->QTIMER2_TIMER2_SELECT_INPUT)
#define IOMUXC_QTIMER2_TIMER3_SELECT_INPUT_REG(base) ((base)->QTIMER2_TIMER3_SELECT_INPUT)
#define IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_REG(base) ((base)->QTIMER3_TIMER0_SELECT_INPUT)
#define IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_REG(base) ((base)->QTIMER3_TIMER1_SELECT_INPUT)
#define IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_REG(base) ((base)->QTIMER3_TIMER2_SELECT_INPUT)
#define IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_REG(base) ((base)->QTIMER3_TIMER3_SELECT_INPUT)
#define IOMUXC_SAI1_MCLK2_SELECT_INPUT_REG(base) ((base)->SAI1_MCLK2_SELECT_INPUT)
#define IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_REG(base) ((base)->SAI1_RX_BCLK_SELECT_INPUT)
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_REG(base) ((base)->SAI1_RX_DATA0_SELECT_INPUT)
#define IOMUXC_SAI1_RX_DATA1_SELECT_INPUT_REG(base) ((base)->SAI1_RX_DATA1_SELECT_INPUT)
#define IOMUXC_SAI1_RX_DATA2_SELECT_INPUT_REG(base) ((base)->SAI1_RX_DATA2_SELECT_INPUT)
#define IOMUXC_SAI1_RX_DATA3_SELECT_INPUT_REG(base) ((base)->SAI1_RX_DATA3_SELECT_INPUT)
#define IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_REG(base) ((base)->SAI1_RX_SYNC_SELECT_INPUT)
#define IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_REG(base) ((base)->SAI1_TX_BCLK_SELECT_INPUT)
#define IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_REG(base) ((base)->SAI1_TX_SYNC_SELECT_INPUT)
#define IOMUXC_SAI2_MCLK2_SELECT_INPUT_REG(base) ((base)->SAI2_MCLK2_SELECT_INPUT)
#define IOMUXC_SAI2_RX_BCLK_SELECT_INPUT_REG(base) ((base)->SAI2_RX_BCLK_SELECT_INPUT)
#define IOMUXC_SAI2_RX_DATA0_SELECT_INPUT_REG(base) ((base)->SAI2_RX_DATA0_SELECT_INPUT)
#define IOMUXC_SAI2_RX_SYNC_SELECT_INPUT_REG(base) ((base)->SAI2_RX_SYNC_SELECT_INPUT)
#define IOMUXC_SAI2_TX_BCLK_SELECT_INPUT_REG(base) ((base)->SAI2_TX_BCLK_SELECT_INPUT)
#define IOMUXC_SAI2_TX_SYNC_SELECT_INPUT_REG(base) ((base)->SAI2_TX_SYNC_SELECT_INPUT)
#define IOMUXC_SPDIF_IN_SELECT_INPUT_REG(base)   ((base)->SPDIF_IN_SELECT_INPUT)
#define IOMUXC_USB_OTG2_OC_SELECT_INPUT_REG(base) ((base)->USB_OTG2_OC_SELECT_INPUT)
#define IOMUXC_USB_OTG1_OC_SELECT_INPUT_REG(base) ((base)->USB_OTG1_OC_SELECT_INPUT)
#define IOMUXC_USDHC1_CD_B_SELECT_INPUT_REG(base) ((base)->USDHC1_CD_B_SELECT_INPUT)
#define IOMUXC_USDHC1_WP_SELECT_INPUT_REG(base)  ((base)->USDHC1_WP_SELECT_INPUT)
#define IOMUXC_USDHC2_CLK_SELECT_INPUT_REG(base) ((base)->USDHC2_CLK_SELECT_INPUT)
#define IOMUXC_USDHC2_CD_B_SELECT_INPUT_REG(base) ((base)->USDHC2_CD_B_SELECT_INPUT)
#define IOMUXC_USDHC2_CMD_SELECT_INPUT_REG(base) ((base)->USDHC2_CMD_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA0_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA0_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA1_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA1_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA2_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA2_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA3_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA3_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA4_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA4_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA5_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA5_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA6_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA6_SELECT_INPUT)
#define IOMUXC_USDHC2_DATA7_SELECT_INPUT_REG(base) ((base)->USDHC2_DATA7_SELECT_INPUT)
#define IOMUXC_USDHC2_WP_SELECT_INPUT_REG(base)  ((base)->USDHC2_WP_SELECT_INPUT)
#define IOMUXC_XBAR1_IN02_SELECT_INPUT_REG(base) ((base)->XBAR1_IN02_SELECT_INPUT)
#define IOMUXC_XBAR1_IN03_SELECT_INPUT_REG(base) ((base)->XBAR1_IN03_SELECT_INPUT)
#define IOMUXC_XBAR1_IN04_SELECT_INPUT_REG(base) ((base)->XBAR1_IN04_SELECT_INPUT)
#define IOMUXC_XBAR1_IN05_SELECT_INPUT_REG(base) ((base)->XBAR1_IN05_SELECT_INPUT)
#define IOMUXC_XBAR1_IN06_SELECT_INPUT_REG(base) ((base)->XBAR1_IN06_SELECT_INPUT)
#define IOMUXC_XBAR1_IN07_SELECT_INPUT_REG(base) ((base)->XBAR1_IN07_SELECT_INPUT)
#define IOMUXC_XBAR1_IN08_SELECT_INPUT_REG(base) ((base)->XBAR1_IN08_SELECT_INPUT)
#define IOMUXC_XBAR1_IN09_SELECT_INPUT_REG(base) ((base)->XBAR1_IN09_SELECT_INPUT)
#define IOMUXC_XBAR1_IN17_SELECT_INPUT_REG(base) ((base)->XBAR1_IN17_SELECT_INPUT)
#define IOMUXC_XBAR1_IN18_SELECT_INPUT_REG(base) ((base)->XBAR1_IN18_SELECT_INPUT)
#define IOMUXC_XBAR1_IN20_SELECT_INPUT_REG(base) ((base)->XBAR1_IN20_SELECT_INPUT)
#define IOMUXC_XBAR1_IN22_SELECT_INPUT_REG(base) ((base)->XBAR1_IN22_SELECT_INPUT)
#define IOMUXC_XBAR1_IN23_SELECT_INPUT_REG(base) ((base)->XBAR1_IN23_SELECT_INPUT)
#define IOMUXC_XBAR1_IN24_SELECT_INPUT_REG(base) ((base)->XBAR1_IN24_SELECT_INPUT)
#define IOMUXC_XBAR1_IN14_SELECT_INPUT_REG(base) ((base)->XBAR1_IN14_SELECT_INPUT)
#define IOMUXC_XBAR1_IN15_SELECT_INPUT_REG(base) ((base)->XBAR1_IN15_SELECT_INPUT)
#define IOMUXC_XBAR1_IN16_SELECT_INPUT_REG(base) ((base)->XBAR1_IN16_SELECT_INPUT)
#define IOMUXC_XBAR1_IN25_SELECT_INPUT_REG(base) ((base)->XBAR1_IN25_SELECT_INPUT)
#define IOMUXC_XBAR1_IN19_SELECT_INPUT_REG(base) ((base)->XBAR1_IN19_SELECT_INPUT)
#define IOMUXC_XBAR1_IN21_SELECT_INPUT_REG(base) ((base)->XBAR1_IN21_SELECT_INPUT)

/*!
 * @}
 */ /* end of group IOMUXC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- IOMUXC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_Register_Masks IOMUXC Register Masks
 * @{
 */

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_00 - SW_MUX_CTL_PAD_GPIO_EMC_00 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_01 - SW_MUX_CTL_PAD_GPIO_EMC_01 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_SION_SHIFT (4U)

