AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_MUX_CTL_PAD_GPIO_EMC_02 - SW_MUX_CTL_PAD_GPIO_EMC_02 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_03 - SW_MUX_CTL_PAD_GPIO_EMC_03 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_04 - SW_MUX_CTL_PAD_GPIO_EMC_04 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_05 - SW_MUX_CTL_PAD_GPIO_EMC_05 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_06 - SW_MUX_CTL_PAD_GPIO_EMC_06 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_07 - SW_MUX_CTL_PAD_GPIO_EMC_07 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_08 - SW_MUX_CTL_PAD_GPIO_EMC_08 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_09 - SW_MUX_CTL_PAD_GPIO_EMC_09 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_10 - SW_MUX_CTL_PAD_GPIO_EMC_10 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_11 - SW_MUX_CTL_PAD_GPIO_EMC_11 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_12 - SW_MUX_CTL_PAD_GPIO_EMC_12 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_13 - SW_MUX_CTL_PAD_GPIO_EMC_13 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_14 - SW_MUX_CTL_PAD_GPIO_EMC_14 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_SION_SHIFT (4U)

