AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_MUX_CTL_PAD_GPIO_EMC_15 - SW_MUX_CTL_PAD_GPIO_EMC_15 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_16 - SW_MUX_CTL_PAD_GPIO_EMC_16 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_17 - SW_MUX_CTL_PAD_GPIO_EMC_17 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_18 - SW_MUX_CTL_PAD_GPIO_EMC_18 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_19 - SW_MUX_CTL_PAD_GPIO_EMC_19 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_20 - SW_MUX_CTL_PAD_GPIO_EMC_20 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_21 - SW_MUX_CTL_PAD_GPIO_EMC_21 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_22 - SW_MUX_CTL_PAD_GPIO_EMC_22 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_23 - SW_MUX_CTL_PAD_GPIO_EMC_23 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_24 - SW_MUX_CTL_PAD_GPIO_EMC_24 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_25 - SW_MUX_CTL_PAD_GPIO_EMC_25 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_26 - SW_MUX_CTL_PAD_GPIO_EMC_26 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_27 - SW_MUX_CTL_PAD_GPIO_EMC_27 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_SION_SHIFT (4U)

