AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_MUX_CTL_PAD_GPIO_EMC_28 - SW_MUX_CTL_PAD_GPIO_EMC_28 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_29 - SW_MUX_CTL_PAD_GPIO_EMC_29 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_30 - SW_MUX_CTL_PAD_GPIO_EMC_30 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_31 - SW_MUX_CTL_PAD_GPIO_EMC_31 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_32 - SW_MUX_CTL_PAD_GPIO_EMC_32 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_33 - SW_MUX_CTL_PAD_GPIO_EMC_33 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_34 - SW_MUX_CTL_PAD_GPIO_EMC_34 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_35 - SW_MUX_CTL_PAD_GPIO_EMC_35 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_36 - SW_MUX_CTL_PAD_GPIO_EMC_36 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_37 - SW_MUX_CTL_PAD_GPIO_EMC_37 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_38 - SW_MUX_CTL_PAD_GPIO_EMC_38 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_39 - SW_MUX_CTL_PAD_GPIO_EMC_39 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_40 - SW_MUX_CTL_PAD_GPIO_EMC_40 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_EMC_41 - SW_MUX_CTL_PAD_GPIO_EMC_41 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_SION_SHIFT (4U)

