AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_00 - SW_MUX_CTL_PAD_GPIO_AD_B0_00 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_01 - SW_MUX_CTL_PAD_GPIO_AD_B0_01 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_02 - SW_MUX_CTL_PAD_GPIO_AD_B0_02 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_03 - SW_MUX_CTL_PAD_GPIO_AD_B0_03 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_04 - SW_MUX_CTL_PAD_GPIO_AD_B0_04 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_05 - SW_MUX_CTL_PAD_GPIO_AD_B0_05 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_06 - SW_MUX_CTL_PAD_GPIO_AD_B0_06 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_07 - SW_MUX_CTL_PAD_GPIO_AD_B0_07 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_08 - SW_MUX_CTL_PAD_GPIO_AD_B0_08 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_09 - SW_MUX_CTL_PAD_GPIO_AD_B0_09 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_10 - SW_MUX_CTL_PAD_GPIO_AD_B0_10 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_11 - SW_MUX_CTL_PAD_GPIO_AD_B0_11 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_12 - SW_MUX_CTL_PAD_GPIO_AD_B0_12 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_13 - SW_MUX_CTL_PAD_GPIO_AD_B0_13 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_14 - SW_MUX_CTL_PAD_GPIO_AD_B0_14 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B0_15 - SW_MUX_CTL_PAD_GPIO_AD_B0_15 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B1_00 - SW_MUX_CTL_PAD_GPIO_AD_B1_00 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B1_01 - SW_MUX_CTL_PAD_GPIO_AD_B1_01 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B1_02 - SW_MUX_CTL_PAD_GPIO_AD_B1_02 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_AD_B1_03 - SW_MUX_CTL_PAD_GPIO_AD_B1_03 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_SION_SHIFT (4U)

