AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_MUX_CTL_PAD_GPIO_B1_09 - SW_MUX_CTL_PAD_GPIO_B1_09 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_B1_10 - SW_MUX_CTL_PAD_GPIO_B1_10 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_B1_11 - SW_MUX_CTL_PAD_GPIO_B1_11 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_B1_12 - SW_MUX_CTL_PAD_GPIO_B1_12 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_B1_13 - SW_MUX_CTL_PAD_GPIO_B1_13 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_B1_14 - SW_MUX_CTL_PAD_GPIO_B1_14 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_B1_15 - SW_MUX_CTL_PAD_GPIO_B1_15 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B0_00 - SW_MUX_CTL_PAD_GPIO_SD_B0_00 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B0_01 - SW_MUX_CTL_PAD_GPIO_SD_B0_01 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B0_02 - SW_MUX_CTL_PAD_GPIO_SD_B0_02 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B0_03 - SW_MUX_CTL_PAD_GPIO_SD_B0_03 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B0_04 - SW_MUX_CTL_PAD_GPIO_SD_B0_04 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B0_05 - SW_MUX_CTL_PAD_GPIO_SD_B0_05 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_00 - SW_MUX_CTL_PAD_GPIO_SD_B1_00 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_01 - SW_MUX_CTL_PAD_GPIO_SD_B1_01 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_02 - SW_MUX_CTL_PAD_GPIO_SD_B1_02 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_03 - SW_MUX_CTL_PAD_GPIO_SD_B1_03 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_04 - SW_MUX_CTL_PAD_GPIO_SD_B1_04 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_05 - SW_MUX_CTL_PAD_GPIO_SD_B1_05 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_06 - SW_MUX_CTL_PAD_GPIO_SD_B1_06 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_07 - SW_MUX_CTL_PAD_GPIO_SD_B1_07 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_08 - SW_MUX_CTL_PAD_GPIO_SD_B1_08 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_SION_SHIFT (4U)

/*! @name SW_MUX_CTL_PAD_GPIO_SD_B1_09 - SW_MUX_CTL_PAD_GPIO_SD_B1_09 SW MUX Control Register */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_MUX_MODE_MASK (0x7U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_MUX_MODE_SHIFT (0U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_MUX_MODE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_MUX_MODE_MASK)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_SION_MASK (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_SION_SHIFT (4U)

