AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_PAD_CTL_PAD_GPIO_EMC_16 - SW_PAD_CTL_PAD_GPIO_EMC_16 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_17 - SW_PAD_CTL_PAD_GPIO_EMC_17 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_18 - SW_PAD_CTL_PAD_GPIO_EMC_18 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_19 - SW_PAD_CTL_PAD_GPIO_EMC_19 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_20 - SW_PAD_CTL_PAD_GPIO_EMC_20 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_21 - SW_PAD_CTL_PAD_GPIO_EMC_21 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_22 - SW_PAD_CTL_PAD_GPIO_EMC_22 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_HYS_SHIFT (16U)

