AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_PAD_CTL_PAD_GPIO_EMC_34 - SW_PAD_CTL_PAD_GPIO_EMC_34 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_35 - SW_PAD_CTL_PAD_GPIO_EMC_35 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_36 - SW_PAD_CTL_PAD_GPIO_EMC_36 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_EMC_37 - SW_PAD_CTL_PAD_GPIO_EMC_37 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_HYS_SHIFT (16U)

