AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_PAD_CTL_PAD_GPIO_AD_B0_08 - SW_PAD_CTL_PAD_GPIO_AD_B0_08 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B0_09 - SW_PAD_CTL_PAD_GPIO_AD_B0_09 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B0_10 - SW_PAD_CTL_PAD_GPIO_AD_B0_10 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B0_11 - SW_PAD_CTL_PAD_GPIO_AD_B0_11 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B0_12 - SW_PAD_CTL_PAD_GPIO_AD_B0_12 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B0_13 - SW_PAD_CTL_PAD_GPIO_AD_B0_13 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_HYS_SHIFT (16U)

