AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_PAD_CTL_PAD_GPIO_AD_B1_10 - SW_PAD_CTL_PAD_GPIO_AD_B1_10 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B1_11 - SW_PAD_CTL_PAD_GPIO_AD_B1_11 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B1_12 - SW_PAD_CTL_PAD_GPIO_AD_B1_12 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B1_13 - SW_PAD_CTL_PAD_GPIO_AD_B1_13 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B1_14 - SW_PAD_CTL_PAD_GPIO_AD_B1_14 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_AD_B1_15 - SW_PAD_CTL_PAD_GPIO_AD_B1_15 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_00 - SW_PAD_CTL_PAD_GPIO_B0_00 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_01 - SW_PAD_CTL_PAD_GPIO_B0_01 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_02 - SW_PAD_CTL_PAD_GPIO_B0_02 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_03 - SW_PAD_CTL_PAD_GPIO_B0_03 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_04 - SW_PAD_CTL_PAD_GPIO_B0_04 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_05 - SW_PAD_CTL_PAD_GPIO_B0_05 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_06 - SW_PAD_CTL_PAD_GPIO_B0_06 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_07 - SW_PAD_CTL_PAD_GPIO_B0_07 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_B0_08 - SW_PAD_CTL_PAD_GPIO_B0_08 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_DSE(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUS(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_HYS_SHIFT (16U)

