AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_PAD_CTL_PAD_GPIO_SD_B0_00 - SW_PAD_CTL_PAD_GPIO_SD_B0_00 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B0_01 - SW_PAD_CTL_PAD_GPIO_SD_B0_01 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B0_02 - SW_PAD_CTL_PAD_GPIO_SD_B0_02 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B0_03 - SW_PAD_CTL_PAD_GPIO_SD_B0_03 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B0_04 - SW_PAD_CTL_PAD_GPIO_SD_B0_04 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B0_05 - SW_PAD_CTL_PAD_GPIO_SD_B0_05 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_00 - SW_PAD_CTL_PAD_GPIO_SD_B1_00 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_01 - SW_PAD_CTL_PAD_GPIO_SD_B1_01 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_02 - SW_PAD_CTL_PAD_GPIO_SD_B1_02 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_03 - SW_PAD_CTL_PAD_GPIO_SD_B1_03 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_HYS_SHIFT (16U)

