AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_04 - SW_PAD_CTL_PAD_GPIO_SD_B1_04 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_05 - SW_PAD_CTL_PAD_GPIO_SD_B1_05 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_06 - SW_PAD_CTL_PAD_GPIO_SD_B1_06 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_07 - SW_PAD_CTL_PAD_GPIO_SD_B1_07 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_08 - SW_PAD_CTL_PAD_GPIO_SD_B1_08 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_09 - SW_PAD_CTL_PAD_GPIO_SD_B1_09 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_10 - SW_PAD_CTL_PAD_GPIO_SD_B1_10 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_HYS_SHIFT (16U)

/*! @name SW_PAD_CTL_PAD_GPIO_SD_B1_11 - SW_PAD_CTL_PAD_GPIO_SD_B1_11 SW PAD Control Register */
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SRE_MASK (0x1U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SRE_SHIFT (0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_DSE_MASK (0x38U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_DSE_SHIFT (3U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_DSE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_DSE_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_DSE_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SPEED_MASK (0xC0U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SPEED_SHIFT (6U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SPEED(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SPEED_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_SPEED_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_ODE_MASK (0x800U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_ODE_SHIFT (11U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PKE_MASK (0x1000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PKE_SHIFT (12U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUE_MASK (0x2000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUE_SHIFT (13U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUS_MASK (0xC000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUS_SHIFT (14U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUS(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUS_SHIFT)) & IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_PUS_MASK)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_HYS_MASK (0x10000U)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_HYS_SHIFT (16U)

/*! @name ANATOP_USB_OTG1_ID_SELECT_INPUT - ANATOP_USB_OTG1_ID_SELECT_INPUT DAISY Register */
#define IOMUXC_ANATOP_USB_OTG1_ID_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ANATOP_USB_OTG1_ID_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name ANATOP_USB_OTG2_ID_SELECT_INPUT - ANATOP_USB_OTG2_ID_SELECT_INPUT DAISY Register */
#define IOMUXC_ANATOP_USB_OTG2_ID_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ANATOP_USB_OTG2_ID_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CCM_PMIC_READY_SELECT_INPUT - CCM_PMIC_READY_SELECT_INPUT DAISY Register */
#define IOMUXC_CCM_PMIC_READY_SELECT_INPUT_DAISY_MASK (0x7U)
#define IOMUXC_CCM_PMIC_READY_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_CCM_PMIC_READY_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_CCM_PMIC_READY_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_CCM_PMIC_READY_SELECT_INPUT_DAISY_MASK)

/*! @name CSI_DATA02_SELECT_INPUT - CSI_DATA02_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA02_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA02_SELECT_INPUT_DAISY_SHIFT (0U)

