AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name CSI_DATA03_SELECT_INPUT - CSI_DATA03_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA03_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA03_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_DATA04_SELECT_INPUT - CSI_DATA04_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA04_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA04_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_DATA05_SELECT_INPUT - CSI_DATA05_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA05_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA05_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_DATA06_SELECT_INPUT - CSI_DATA06_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA06_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA06_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_DATA07_SELECT_INPUT - CSI_DATA07_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA07_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA07_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_DATA08_SELECT_INPUT - CSI_DATA08_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA08_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA08_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_DATA09_SELECT_INPUT - CSI_DATA09_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_DATA09_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_DATA09_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_HSYNC_SELECT_INPUT - CSI_HSYNC_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_HSYNC_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_CSI_HSYNC_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_CSI_HSYNC_SELECT_INPUT_DAISY(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_CSI_HSYNC_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_CSI_HSYNC_SELECT_INPUT_DAISY_MASK)

/*! @name CSI_PIXCLK_SELECT_INPUT - CSI_PIXCLK_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_PIXCLK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_CSI_PIXCLK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name CSI_VSYNC_SELECT_INPUT - CSI_VSYNC_SELECT_INPUT DAISY Register */
#define IOMUXC_CSI_VSYNC_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_CSI_VSYNC_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_CSI_VSYNC_SELECT_INPUT_DAISY(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_CSI_VSYNC_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_CSI_VSYNC_SELECT_INPUT_DAISY_MASK)

/*! @name ENET_IPG_CLK_RMII_SELECT_INPUT - ENET_IPG_CLK_RMII_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET_IPG_CLK_RMII_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ENET_IPG_CLK_RMII_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name ENET_MDIO_SELECT_INPUT - ENET_MDIO_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET_MDIO_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_ENET_MDIO_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_ENET_MDIO_SELECT_INPUT_DAISY(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_ENET_MDIO_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_ENET_MDIO_SELECT_INPUT_DAISY_MASK)

/*! @name ENET0_RXDATA_SELECT_INPUT - ENET0_RXDATA_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET0_RXDATA_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ENET0_RXDATA_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name ENET1_RXDATA_SELECT_INPUT - ENET1_RXDATA_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET1_RXDATA_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ENET1_RXDATA_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name ENET_RXEN_SELECT_INPUT - ENET_RXEN_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET_RXEN_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ENET_RXEN_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name ENET_RXERR_SELECT_INPUT - ENET_RXERR_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET_RXERR_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ENET_RXERR_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name ENET0_TIMER_SELECT_INPUT - ENET0_TIMER_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET0_TIMER_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_ENET0_TIMER_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_ENET0_TIMER_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_ENET0_TIMER_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_ENET0_TIMER_SELECT_INPUT_DAISY_MASK)

/*! @name ENET_TXCLK_SELECT_INPUT - ENET_TXCLK_SELECT_INPUT DAISY Register */
#define IOMUXC_ENET_TXCLK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_ENET_TXCLK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXCAN1_RX_SELECT_INPUT - FLEXCAN1_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY_MASK)

/*! @name FLEXCAN2_RX_SELECT_INPUT - FLEXCAN2_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_FLEXCAN2_RX_SELECT_INPUT_DAISY_MASK)

/*! @name FLEXPWM1_PWMA3_SELECT_INPUT - FLEXPWM1_PWMA3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_DAISY_MASK (0x7U)
#define IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_DAISY_MASK)

/*! @name FLEXPWM1_PWMA0_SELECT_INPUT - FLEXPWM1_PWMA0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM1_PWMA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM1_PWMA1_SELECT_INPUT - FLEXPWM1_PWMA1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM1_PWMA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM1_PWMA2_SELECT_INPUT - FLEXPWM1_PWMA2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM1_PWMA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM1_PWMB3_SELECT_INPUT - FLEXPWM1_PWMB3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_DAISY_MASK (0x7U)
#define IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_DAISY_MASK)

/*! @name FLEXPWM1_PWMB0_SELECT_INPUT - FLEXPWM1_PWMB0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMB0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM1_PWMB0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM1_PWMB1_SELECT_INPUT - FLEXPWM1_PWMB1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMB1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM1_PWMB1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM1_PWMB2_SELECT_INPUT - FLEXPWM1_PWMB2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM1_PWMB2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM1_PWMB2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM2_PWMA3_SELECT_INPUT - FLEXPWM2_PWMA3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_DAISY_MASK (0x7U)
#define IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_DAISY_MASK)

/*! @name FLEXPWM2_PWMA0_SELECT_INPUT - FLEXPWM2_PWMA0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM2_PWMA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM2_PWMA1_SELECT_INPUT - FLEXPWM2_PWMA1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM2_PWMA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM2_PWMA2_SELECT_INPUT - FLEXPWM2_PWMA2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM2_PWMA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM2_PWMB3_SELECT_INPUT - FLEXPWM2_PWMB3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_DAISY_MASK)

