AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name FLEXPWM2_PWMB0_SELECT_INPUT - FLEXPWM2_PWMB0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMB0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM2_PWMB0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM2_PWMB1_SELECT_INPUT - FLEXPWM2_PWMB1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMB1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM2_PWMB1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM2_PWMB2_SELECT_INPUT - FLEXPWM2_PWMB2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM2_PWMB2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM2_PWMB2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM4_PWMA0_SELECT_INPUT - FLEXPWM4_PWMA0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM4_PWMA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM4_PWMA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM4_PWMA1_SELECT_INPUT - FLEXPWM4_PWMA1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM4_PWMA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM4_PWMA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM4_PWMA2_SELECT_INPUT - FLEXPWM4_PWMA2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM4_PWMA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM4_PWMA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXPWM4_PWMA3_SELECT_INPUT - FLEXPWM4_PWMA3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXPWM4_PWMA3_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXPWM4_PWMA3_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIA_DQS_SELECT_INPUT - FLEXSPIA_DQS_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIA_DQS_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIA_DQS_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIA_DATA0_SELECT_INPUT - FLEXSPIA_DATA0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIA_DATA1_SELECT_INPUT - FLEXSPIA_DATA1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIA_DATA2_SELECT_INPUT - FLEXSPIA_DATA2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIA_DATA3_SELECT_INPUT - FLEXSPIA_DATA3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIB_DATA0_SELECT_INPUT - FLEXSPIB_DATA0_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIB_DATA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIB_DATA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIB_DATA1_SELECT_INPUT - FLEXSPIB_DATA1_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIB_DATA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIB_DATA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIB_DATA2_SELECT_INPUT - FLEXSPIB_DATA2_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIB_DATA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIB_DATA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIB_DATA3_SELECT_INPUT - FLEXSPIB_DATA3_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIB_DATA3_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIB_DATA3_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name FLEXSPIA_SCK_SELECT_INPUT - FLEXSPIA_SCK_SELECT_INPUT DAISY Register */
#define IOMUXC_FLEXSPIA_SCK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_FLEXSPIA_SCK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPI2C1_SCL_SELECT_INPUT - LPI2C1_SCL_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C1_SCL_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPI2C1_SCL_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPI2C1_SDA_SELECT_INPUT - LPI2C1_SDA_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C1_SDA_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPI2C1_SDA_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPI2C2_SCL_SELECT_INPUT - LPI2C2_SCL_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C2_SCL_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPI2C2_SCL_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPI2C2_SDA_SELECT_INPUT - LPI2C2_SDA_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C2_SDA_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPI2C2_SDA_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPI2C3_SCL_SELECT_INPUT - LPI2C3_SCL_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C3_SCL_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPI2C3_SCL_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPI2C3_SCL_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPI2C3_SCL_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPI2C3_SCL_SELECT_INPUT_DAISY_MASK)

/*! @name LPI2C3_SDA_SELECT_INPUT - LPI2C3_SDA_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C3_SDA_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPI2C3_SDA_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPI2C3_SDA_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPI2C3_SDA_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPI2C3_SDA_SELECT_INPUT_DAISY_MASK)

/*! @name LPI2C4_SCL_SELECT_INPUT - LPI2C4_SCL_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C4_SCL_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPI2C4_SCL_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPI2C4_SDA_SELECT_INPUT - LPI2C4_SDA_SELECT_INPUT DAISY Register */
#define IOMUXC_LPI2C4_SDA_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPI2C4_SDA_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI1_PCS0_SELECT_INPUT - LPSPI1_PCS0_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI1_PCS0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI1_PCS0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI1_SCK_SELECT_INPUT - LPSPI1_SCK_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI1_SCK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI1_SCK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI1_SDI_SELECT_INPUT - LPSPI1_SDI_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI1_SDI_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI1_SDI_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI1_SDO_SELECT_INPUT - LPSPI1_SDO_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI1_SDO_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI1_SDO_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI2_PCS0_SELECT_INPUT - LPSPI2_PCS0_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI2_PCS0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI2_PCS0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI2_SCK_SELECT_INPUT - LPSPI2_SCK_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI2_SCK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI2_SCK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI2_SDI_SELECT_INPUT - LPSPI2_SDI_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI2_SDI_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI2_SDI_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI2_SDO_SELECT_INPUT - LPSPI2_SDO_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI2_SDO_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI2_SDO_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI3_PCS0_SELECT_INPUT - LPSPI3_PCS0_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI3_PCS0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI3_PCS0_SELECT_INPUT_DAISY_SHIFT (0U)

