AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name LPSPI3_SCK_SELECT_INPUT - LPSPI3_SCK_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI3_SCK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI3_SCK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI3_SDI_SELECT_INPUT - LPSPI3_SDI_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI3_SDI_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI3_SDI_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI3_SDO_SELECT_INPUT - LPSPI3_SDO_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI3_SDO_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI3_SDO_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI4_PCS0_SELECT_INPUT - LPSPI4_PCS0_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI4_PCS0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI4_PCS0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI4_SCK_SELECT_INPUT - LPSPI4_SCK_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI4_SCK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI4_SCK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI4_SDI_SELECT_INPUT - LPSPI4_SDI_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI4_SDI_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI4_SDI_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPSPI4_SDO_SELECT_INPUT - LPSPI4_SDO_SELECT_INPUT DAISY Register */
#define IOMUXC_LPSPI4_SDO_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPSPI4_SDO_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART2_RX_SELECT_INPUT - LPUART2_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART2_RX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART2_RX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART2_TX_SELECT_INPUT - LPUART2_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART2_TX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART2_TX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART3_CTS_B_SELECT_INPUT - LPUART3_CTS_B_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART3_CTS_B_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART3_CTS_B_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART3_RX_SELECT_INPUT - LPUART3_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART3_RX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPUART3_RX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPUART3_RX_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPUART3_RX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPUART3_RX_SELECT_INPUT_DAISY_MASK)

/*! @name LPUART3_TX_SELECT_INPUT - LPUART3_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART3_TX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPUART3_TX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPUART3_TX_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPUART3_TX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPUART3_TX_SELECT_INPUT_DAISY_MASK)

/*! @name LPUART4_RX_SELECT_INPUT - LPUART4_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART4_RX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPUART4_RX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPUART4_RX_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPUART4_RX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPUART4_RX_SELECT_INPUT_DAISY_MASK)

/*! @name LPUART4_TX_SELECT_INPUT - LPUART4_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART4_TX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPUART4_TX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPUART4_TX_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPUART4_TX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPUART4_TX_SELECT_INPUT_DAISY_MASK)

/*! @name LPUART5_RX_SELECT_INPUT - LPUART5_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART5_RX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART5_RX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART5_TX_SELECT_INPUT - LPUART5_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART5_TX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART5_TX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART6_RX_SELECT_INPUT - LPUART6_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART6_RX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART6_RX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART6_TX_SELECT_INPUT - LPUART6_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART6_TX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART6_TX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART7_RX_SELECT_INPUT - LPUART7_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART7_RX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART7_RX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART7_TX_SELECT_INPUT - LPUART7_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART7_TX_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_LPUART7_TX_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name LPUART8_RX_SELECT_INPUT - LPUART8_RX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART8_RX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPUART8_RX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPUART8_RX_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPUART8_RX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPUART8_RX_SELECT_INPUT_DAISY_MASK)

/*! @name LPUART8_TX_SELECT_INPUT - LPUART8_TX_SELECT_INPUT DAISY Register */
#define IOMUXC_LPUART8_TX_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_LPUART8_TX_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_LPUART8_TX_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPUART8_TX_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_LPUART8_TX_SELECT_INPUT_DAISY_MASK)

/*! @name NMI_SELECT_INPUT - NMI_GLUE_NMI_SELECT_INPUT DAISY Register */
#define IOMUXC_NMI_SELECT_INPUT_DAISY_MASK       (0x1U)
#define IOMUXC_NMI_SELECT_INPUT_DAISY_SHIFT      (0U)

/*! @name QTIMER2_TIMER0_SELECT_INPUT - QTIMER2_TIMER0_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER2_TIMER0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_QTIMER2_TIMER0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name QTIMER2_TIMER1_SELECT_INPUT - QTIMER2_TIMER1_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER2_TIMER1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_QTIMER2_TIMER1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name QTIMER2_TIMER2_SELECT_INPUT - QTIMER2_TIMER2_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER2_TIMER2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_QTIMER2_TIMER2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name QTIMER2_TIMER3_SELECT_INPUT - QTIMER2_TIMER3_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER2_TIMER3_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_QTIMER2_TIMER3_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name QTIMER3_TIMER0_SELECT_INPUT - QTIMER3_TIMER0_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_DAISY_MASK)

