AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name QTIMER3_TIMER1_SELECT_INPUT - QTIMER3_TIMER1_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_DAISY_MASK)

/*! @name QTIMER3_TIMER2_SELECT_INPUT - QTIMER3_TIMER2_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_DAISY_MASK)

/*! @name QTIMER3_TIMER3_SELECT_INPUT - QTIMER3_TIMER3_SELECT_INPUT DAISY Register */
#define IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_DAISY_MASK)

/*! @name SAI1_MCLK2_SELECT_INPUT - SAI1_MCLK2_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_MCLK2_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_SAI1_MCLK2_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_SAI1_MCLK2_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_SAI1_MCLK2_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_SAI1_MCLK2_SELECT_INPUT_DAISY_MASK)

/*! @name SAI1_RX_BCLK_SELECT_INPUT - SAI1_RX_BCLK_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_DAISY_MASK)

/*! @name SAI1_RX_DATA0_SELECT_INPUT - SAI1_RX_DATA0_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_DAISY_MASK)

/*! @name SAI1_RX_DATA1_SELECT_INPUT - SAI1_RX_DATA1_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_RX_DATA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI1_RX_DATA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI1_RX_DATA2_SELECT_INPUT - SAI1_RX_DATA2_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_RX_DATA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI1_RX_DATA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI1_RX_DATA3_SELECT_INPUT - SAI1_RX_DATA3_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_RX_DATA3_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI1_RX_DATA3_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI1_RX_SYNC_SELECT_INPUT - SAI1_RX_SYNC_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_DAISY_MASK)

/*! @name SAI1_TX_BCLK_SELECT_INPUT - SAI1_TX_BCLK_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_DAISY_MASK)

/*! @name SAI1_TX_SYNC_SELECT_INPUT - SAI1_TX_SYNC_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_DAISY_MASK)

/*! @name SAI2_MCLK2_SELECT_INPUT - SAI2_MCLK2_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI2_MCLK2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI2_MCLK2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI2_RX_BCLK_SELECT_INPUT - SAI2_RX_BCLK_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI2_RX_BCLK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI2_RX_BCLK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI2_RX_DATA0_SELECT_INPUT - SAI2_RX_DATA0_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI2_RX_DATA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI2_RX_DATA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI2_RX_SYNC_SELECT_INPUT - SAI2_RX_SYNC_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI2_RX_SYNC_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI2_RX_SYNC_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI2_TX_BCLK_SELECT_INPUT - SAI2_TX_BCLK_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI2_TX_BCLK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI2_TX_BCLK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SAI2_TX_SYNC_SELECT_INPUT - SAI2_TX_SYNC_SELECT_INPUT DAISY Register */
#define IOMUXC_SAI2_TX_SYNC_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_SAI2_TX_SYNC_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name SPDIF_IN_SELECT_INPUT - SPDIF_IN_SELECT_INPUT DAISY Register */
#define IOMUXC_SPDIF_IN_SELECT_INPUT_DAISY_MASK  (0x1U)
#define IOMUXC_SPDIF_IN_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USB_OTG2_OC_SELECT_INPUT - USB_OTG2_OC_SELECT_INPUT DAISY Register */
#define IOMUXC_USB_OTG2_OC_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USB_OTG2_OC_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USB_OTG1_OC_SELECT_INPUT - USB_OTG1_OC_SELECT_INPUT DAISY Register */
#define IOMUXC_USB_OTG1_OC_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USB_OTG1_OC_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC1_CD_B_SELECT_INPUT - USDHC1_CD_B_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC1_CD_B_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_USDHC1_CD_B_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_USDHC1_CD_B_SELECT_INPUT_DAISY(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_USDHC1_CD_B_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_USDHC1_CD_B_SELECT_INPUT_DAISY_MASK)

