AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name USDHC1_WP_SELECT_INPUT - USDHC1_WP_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC1_WP_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_USDHC1_WP_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_USDHC1_WP_SELECT_INPUT_DAISY(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_USDHC1_WP_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_USDHC1_WP_SELECT_INPUT_DAISY_MASK)

/*! @name USDHC2_CLK_SELECT_INPUT - USDHC2_CLK_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_CLK_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_CLK_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_CD_B_SELECT_INPUT - USDHC2_CD_B_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_CD_B_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_CD_B_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_CMD_SELECT_INPUT - USDHC2_CMD_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_CMD_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_CMD_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA0_SELECT_INPUT - USDHC2_DATA0_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA0_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA0_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA1_SELECT_INPUT - USDHC2_DATA1_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA1_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA1_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA2_SELECT_INPUT - USDHC2_DATA2_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA2_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA2_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA3_SELECT_INPUT - USDHC2_DATA3_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA3_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA3_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA4_SELECT_INPUT - USDHC2_DATA4_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA4_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA4_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA5_SELECT_INPUT - USDHC2_DATA5_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA5_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA5_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA6_SELECT_INPUT - USDHC2_DATA6_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA6_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA6_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_DATA7_SELECT_INPUT - USDHC2_DATA7_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_DATA7_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_DATA7_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name USDHC2_WP_SELECT_INPUT - USDHC2_WP_SELECT_INPUT DAISY Register */
#define IOMUXC_USDHC2_WP_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_USDHC2_WP_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN02_SELECT_INPUT - XBAR1_IN02_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN02_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN02_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN03_SELECT_INPUT - XBAR1_IN03_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN03_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN03_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN04_SELECT_INPUT - XBAR1_IN04_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN04_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN04_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN05_SELECT_INPUT - XBAR1_IN05_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN05_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN05_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN06_SELECT_INPUT - XBAR1_IN06_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN06_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN06_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN07_SELECT_INPUT - XBAR1_IN07_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN07_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN07_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN08_SELECT_INPUT - XBAR1_IN08_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN08_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN08_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN09_SELECT_INPUT - XBAR1_IN09_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN09_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN09_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN17_SELECT_INPUT - XBAR1_IN17_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN17_SELECT_INPUT_DAISY_MASK (0x3U)
#define IOMUXC_XBAR1_IN17_SELECT_INPUT_DAISY_SHIFT (0U)
#define IOMUXC_XBAR1_IN17_SELECT_INPUT_DAISY(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_XBAR1_IN17_SELECT_INPUT_DAISY_SHIFT)) & IOMUXC_XBAR1_IN17_SELECT_INPUT_DAISY_MASK)

/*! @name XBAR1_IN18_SELECT_INPUT - XBAR1_IN18_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN18_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN18_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN20_SELECT_INPUT - XBAR1_IN20_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN20_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN20_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN22_SELECT_INPUT - XBAR1_IN22_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN22_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN22_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN23_SELECT_INPUT - XBAR1_IN23_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN23_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN23_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN24_SELECT_INPUT - XBAR1_IN24_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN24_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN24_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN14_SELECT_INPUT - XBAR1_IN14_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN14_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN14_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN15_SELECT_INPUT - XBAR1_IN15_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN15_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN15_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN16_SELECT_INPUT - XBAR1_IN16_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN16_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN16_SELECT_INPUT_DAISY_SHIFT (0U)

