AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name XBAR1_IN25_SELECT_INPUT - XBAR1_IN25_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN25_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN25_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN19_SELECT_INPUT - XBAR1_IN19_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN19_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN19_SELECT_INPUT_DAISY_SHIFT (0U)

/*! @name XBAR1_IN21_SELECT_INPUT - XBAR1_IN23_SELECT_INPUT DAISY Register */
#define IOMUXC_XBAR1_IN21_SELECT_INPUT_DAISY_MASK (0x1U)
#define IOMUXC_XBAR1_IN21_SELECT_INPUT_DAISY_SHIFT (0U)


/*!
 * @}
 */ /* end of group IOMUXC_Register_Masks */


/* IOMUXC - Peripheral instance base addresses */
/** Peripheral IOMUXC base pointer */
#define IOMUXC_BASE_PTR                          ((IOMUXC_MemMapPtr)0x401F8000u)
/** Array initializer of IOMUXC peripheral base pointers */
#define IOMUXC_BASE_PTRS                         { IOMUXC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- IOMUXC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_Register_Accessor_Macros IOMUXC - Register accessor macros
 * @{
 */


/* IOMUXC - Register instance definitions */
/* IOMUXC */
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41        IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_04      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_05      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_06      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_07      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_08      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_09      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_10      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_11      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_12      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_13      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_14      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_15      IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_00         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_01         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_02         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_03         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_04         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_05         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_06         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_07         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_08         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_09         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_10         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_11         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_12         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_13         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_14         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_15         IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_00         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_01         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_02         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_03         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_04         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_05         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_06         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_07         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_08         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15         IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_10      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_11      IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_00        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_01        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_02        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_03        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_04        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_05        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_06        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_07        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_08        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_09        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_10        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_11        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_12        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_13        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_14        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_15        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_23        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_23_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_24        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_24_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_25        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_25_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_26        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_26_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_27        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_27_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_28        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_28_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_29        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_29_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_30        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_30_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_31        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_31_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_32        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_32_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_33        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_33_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_38        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_38_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_39        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_39_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_40        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_40_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_41        IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_41_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_00      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_01      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_02      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_03      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_04      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_05      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_06      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_07      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_14      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_15      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_00      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_01      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_02      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_03      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_04      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_05      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_06      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_07      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_08      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_09      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15      IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_09         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_10         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_11         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_12         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_13         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_14         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_15         IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_00         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_01         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_02         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_02_REG(IOMUXC_BASE_PTR)
