AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_03         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_04         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_05         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_06         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_07         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_08         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_09         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_10         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_11         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_12         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_12_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_13         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_13_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_14         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_14_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_15         IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_15_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11      IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ANATOP_USB_OTG1_ID_SELECT_INPUT   IOMUXC_ANATOP_USB_OTG1_ID_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ANATOP_USB_OTG2_ID_SELECT_INPUT   IOMUXC_ANATOP_USB_OTG2_ID_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CCM_PMIC_READY_SELECT_INPUT       IOMUXC_CCM_PMIC_READY_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA02_SELECT_INPUT           IOMUXC_CSI_DATA02_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA03_SELECT_INPUT           IOMUXC_CSI_DATA03_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA04_SELECT_INPUT           IOMUXC_CSI_DATA04_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA05_SELECT_INPUT           IOMUXC_CSI_DATA05_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA06_SELECT_INPUT           IOMUXC_CSI_DATA06_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA07_SELECT_INPUT           IOMUXC_CSI_DATA07_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA08_SELECT_INPUT           IOMUXC_CSI_DATA08_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_DATA09_SELECT_INPUT           IOMUXC_CSI_DATA09_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_HSYNC_SELECT_INPUT            IOMUXC_CSI_HSYNC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_PIXCLK_SELECT_INPUT           IOMUXC_CSI_PIXCLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_CSI_VSYNC_SELECT_INPUT            IOMUXC_CSI_VSYNC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET_IPG_CLK_RMII_SELECT_INPUT    IOMUXC_ENET_IPG_CLK_RMII_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET_MDIO_SELECT_INPUT            IOMUXC_ENET_MDIO_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET0_RXDATA_SELECT_INPUT         IOMUXC_ENET0_RXDATA_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET1_RXDATA_SELECT_INPUT         IOMUXC_ENET1_RXDATA_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET_RXEN_SELECT_INPUT            IOMUXC_ENET_RXEN_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET_RXERR_SELECT_INPUT           IOMUXC_ENET_RXERR_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET0_TIMER_SELECT_INPUT          IOMUXC_ENET0_TIMER_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_ENET_TXCLK_SELECT_INPUT           IOMUXC_ENET_TXCLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXCAN1_RX_SELECT_INPUT          IOMUXC_FLEXCAN1_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXCAN2_RX_SELECT_INPUT          IOMUXC_FLEXCAN2_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMA0_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMA1_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMA2_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMB0_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMB0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMB1_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMB1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM1_PWMB2_SELECT_INPUT       IOMUXC_FLEXPWM1_PWMB2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMA0_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMA1_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMA2_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMB0_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMB0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMB1_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMB1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM2_PWMB2_SELECT_INPUT       IOMUXC_FLEXPWM2_PWMB2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM4_PWMA0_SELECT_INPUT       IOMUXC_FLEXPWM4_PWMA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM4_PWMA1_SELECT_INPUT       IOMUXC_FLEXPWM4_PWMA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM4_PWMA2_SELECT_INPUT       IOMUXC_FLEXPWM4_PWMA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXPWM4_PWMA3_SELECT_INPUT       IOMUXC_FLEXPWM4_PWMA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIA_DQS_SELECT_INPUT         IOMUXC_FLEXSPIA_DQS_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT       IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT       IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT       IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT       IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIB_DATA0_SELECT_INPUT       IOMUXC_FLEXSPIB_DATA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIB_DATA1_SELECT_INPUT       IOMUXC_FLEXSPIB_DATA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIB_DATA2_SELECT_INPUT       IOMUXC_FLEXSPIB_DATA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIB_DATA3_SELECT_INPUT       IOMUXC_FLEXSPIB_DATA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_FLEXSPIA_SCK_SELECT_INPUT         IOMUXC_FLEXSPIA_SCK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C1_SCL_SELECT_INPUT           IOMUXC_LPI2C1_SCL_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C1_SDA_SELECT_INPUT           IOMUXC_LPI2C1_SDA_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C2_SCL_SELECT_INPUT           IOMUXC_LPI2C2_SCL_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C2_SDA_SELECT_INPUT           IOMUXC_LPI2C2_SDA_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C3_SCL_SELECT_INPUT           IOMUXC_LPI2C3_SCL_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C3_SDA_SELECT_INPUT           IOMUXC_LPI2C3_SDA_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C4_SCL_SELECT_INPUT           IOMUXC_LPI2C4_SCL_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPI2C4_SDA_SELECT_INPUT           IOMUXC_LPI2C4_SDA_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI1_PCS0_SELECT_INPUT          IOMUXC_LPSPI1_PCS0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI1_SCK_SELECT_INPUT           IOMUXC_LPSPI1_SCK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI1_SDI_SELECT_INPUT           IOMUXC_LPSPI1_SDI_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI1_SDO_SELECT_INPUT           IOMUXC_LPSPI1_SDO_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI2_PCS0_SELECT_INPUT          IOMUXC_LPSPI2_PCS0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI2_SCK_SELECT_INPUT           IOMUXC_LPSPI2_SCK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI2_SDI_SELECT_INPUT           IOMUXC_LPSPI2_SDI_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI2_SDO_SELECT_INPUT           IOMUXC_LPSPI2_SDO_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI3_PCS0_SELECT_INPUT          IOMUXC_LPSPI3_PCS0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI3_SCK_SELECT_INPUT           IOMUXC_LPSPI3_SCK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI3_SDI_SELECT_INPUT           IOMUXC_LPSPI3_SDI_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI3_SDO_SELECT_INPUT           IOMUXC_LPSPI3_SDO_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI4_PCS0_SELECT_INPUT          IOMUXC_LPSPI4_PCS0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI4_SCK_SELECT_INPUT           IOMUXC_LPSPI4_SCK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI4_SDI_SELECT_INPUT           IOMUXC_LPSPI4_SDI_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPSPI4_SDO_SELECT_INPUT           IOMUXC_LPSPI4_SDO_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART2_RX_SELECT_INPUT           IOMUXC_LPUART2_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART2_TX_SELECT_INPUT           IOMUXC_LPUART2_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART3_CTS_B_SELECT_INPUT        IOMUXC_LPUART3_CTS_B_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART3_RX_SELECT_INPUT           IOMUXC_LPUART3_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART3_TX_SELECT_INPUT           IOMUXC_LPUART3_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART4_RX_SELECT_INPUT           IOMUXC_LPUART4_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART4_TX_SELECT_INPUT           IOMUXC_LPUART4_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART5_RX_SELECT_INPUT           IOMUXC_LPUART5_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART5_TX_SELECT_INPUT           IOMUXC_LPUART5_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART6_RX_SELECT_INPUT           IOMUXC_LPUART6_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART6_TX_SELECT_INPUT           IOMUXC_LPUART6_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART7_RX_SELECT_INPUT           IOMUXC_LPUART7_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART7_TX_SELECT_INPUT           IOMUXC_LPUART7_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART8_RX_SELECT_INPUT           IOMUXC_LPUART8_RX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_LPUART8_TX_SELECT_INPUT           IOMUXC_LPUART8_TX_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_NMI_SELECT_INPUT                  IOMUXC_NMI_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER2_TIMER0_SELECT_INPUT       IOMUXC_QTIMER2_TIMER0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER2_TIMER1_SELECT_INPUT       IOMUXC_QTIMER2_TIMER1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER2_TIMER2_SELECT_INPUT       IOMUXC_QTIMER2_TIMER2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER2_TIMER3_SELECT_INPUT       IOMUXC_QTIMER2_TIMER3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER3_TIMER0_SELECT_INPUT       IOMUXC_QTIMER3_TIMER0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER3_TIMER1_SELECT_INPUT       IOMUXC_QTIMER3_TIMER1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER3_TIMER2_SELECT_INPUT       IOMUXC_QTIMER3_TIMER2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_QTIMER3_TIMER3_SELECT_INPUT       IOMUXC_QTIMER3_TIMER3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_MCLK2_SELECT_INPUT           IOMUXC_SAI1_MCLK2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_RX_BCLK_SELECT_INPUT         IOMUXC_SAI1_RX_BCLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT        IOMUXC_SAI1_RX_DATA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_RX_DATA1_SELECT_INPUT        IOMUXC_SAI1_RX_DATA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_RX_DATA2_SELECT_INPUT        IOMUXC_SAI1_RX_DATA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_RX_DATA3_SELECT_INPUT        IOMUXC_SAI1_RX_DATA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_RX_SYNC_SELECT_INPUT         IOMUXC_SAI1_RX_SYNC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_TX_BCLK_SELECT_INPUT         IOMUXC_SAI1_TX_BCLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI1_TX_SYNC_SELECT_INPUT         IOMUXC_SAI1_TX_SYNC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI2_MCLK2_SELECT_INPUT           IOMUXC_SAI2_MCLK2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI2_RX_BCLK_SELECT_INPUT         IOMUXC_SAI2_RX_BCLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI2_RX_DATA0_SELECT_INPUT        IOMUXC_SAI2_RX_DATA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI2_RX_SYNC_SELECT_INPUT         IOMUXC_SAI2_RX_SYNC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI2_TX_BCLK_SELECT_INPUT         IOMUXC_SAI2_TX_BCLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SAI2_TX_SYNC_SELECT_INPUT         IOMUXC_SAI2_TX_SYNC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_SPDIF_IN_SELECT_INPUT             IOMUXC_SPDIF_IN_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USB_OTG2_OC_SELECT_INPUT          IOMUXC_USB_OTG2_OC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USB_OTG1_OC_SELECT_INPUT          IOMUXC_USB_OTG1_OC_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC1_CD_B_SELECT_INPUT          IOMUXC_USDHC1_CD_B_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC1_WP_SELECT_INPUT            IOMUXC_USDHC1_WP_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_CLK_SELECT_INPUT           IOMUXC_USDHC2_CLK_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_CD_B_SELECT_INPUT          IOMUXC_USDHC2_CD_B_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_CMD_SELECT_INPUT           IOMUXC_USDHC2_CMD_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA0_SELECT_INPUT         IOMUXC_USDHC2_DATA0_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA1_SELECT_INPUT         IOMUXC_USDHC2_DATA1_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA2_SELECT_INPUT         IOMUXC_USDHC2_DATA2_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA3_SELECT_INPUT         IOMUXC_USDHC2_DATA3_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA4_SELECT_INPUT         IOMUXC_USDHC2_DATA4_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA5_SELECT_INPUT         IOMUXC_USDHC2_DATA5_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA6_SELECT_INPUT         IOMUXC_USDHC2_DATA6_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_DATA7_SELECT_INPUT         IOMUXC_USDHC2_DATA7_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_USDHC2_WP_SELECT_INPUT            IOMUXC_USDHC2_WP_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN02_SELECT_INPUT           IOMUXC_XBAR1_IN02_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN03_SELECT_INPUT           IOMUXC_XBAR1_IN03_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN04_SELECT_INPUT           IOMUXC_XBAR1_IN04_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN05_SELECT_INPUT           IOMUXC_XBAR1_IN05_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN06_SELECT_INPUT           IOMUXC_XBAR1_IN06_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN07_SELECT_INPUT           IOMUXC_XBAR1_IN07_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN08_SELECT_INPUT           IOMUXC_XBAR1_IN08_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN09_SELECT_INPUT           IOMUXC_XBAR1_IN09_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN17_SELECT_INPUT           IOMUXC_XBAR1_IN17_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN18_SELECT_INPUT           IOMUXC_XBAR1_IN18_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN20_SELECT_INPUT           IOMUXC_XBAR1_IN20_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN22_SELECT_INPUT           IOMUXC_XBAR1_IN22_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN23_SELECT_INPUT           IOMUXC_XBAR1_IN23_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN24_SELECT_INPUT           IOMUXC_XBAR1_IN24_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN14_SELECT_INPUT           IOMUXC_XBAR1_IN14_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN15_SELECT_INPUT           IOMUXC_XBAR1_IN15_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN16_SELECT_INPUT           IOMUXC_XBAR1_IN16_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN25_SELECT_INPUT           IOMUXC_XBAR1_IN25_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN19_SELECT_INPUT           IOMUXC_XBAR1_IN19_SELECT_INPUT_REG(IOMUXC_BASE_PTR)
#define IOMUXC_XBAR1_IN21_SELECT_INPUT           IOMUXC_XBAR1_IN21_SELECT_INPUT_REG(IOMUXC_BASE_PTR)

/*!
 * @}
 */ /* end of group IOMUXC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group IOMUXC_Peripheral */


/* ----------------------------------------------------------------------------
   -- IOMUXC_GPR
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_GPR_Peripheral IOMUXC_GPR
 * @{
 */

/** IOMUXC_GPR - Peripheral register structure */
typedef struct IOMUXC_GPR_MemMap {
  uint32_t GPR0;                                   /**< GPR0 General Purpose Register, offset: 0x0 */
  uint32_t GPR1;                                   /**< GPR1 General Purpose Register, offset: 0x4 */
  uint32_t GPR2;                                   /**< GPR2 General Purpose Register, offset: 0x8 */
  uint32_t GPR3;                                   /**< GPR3 General Purpose Register, offset: 0xC */
  uint32_t GPR4;                                   /**< GPR4 General Purpose Register, offset: 0x10 */
  uint32_t GPR5;                                   /**< GPR5 General Purpose Register, offset: 0x14 */
  uint32_t GPR6;                                   /**< GPR6 General Purpose Register, offset: 0x18 */
  uint32_t GPR7;                                   /**< GPR7 General Purpose Register, offset: 0x1C */
  uint32_t GPR8;                                   /**< GPR8 General Purpose Register, offset: 0x20 */
  uint32_t GPR9;                                   /**< GPR9 General Purpose Register, offset: 0x24 */
  uint32_t GPR10;                                  /**< GPR10 General Purpose Register, offset: 0x28 */
  uint32_t GPR11;                                  /**< GPR11 General Purpose Register, offset: 0x2C */
  uint32_t GPR12;                                  /**< GPR12 General Purpose Register, offset: 0x30 */
  uint32_t GPR13;                                  /**< GPR13 General Purpose Register, offset: 0x34 */
  uint32_t GPR14;                                  /**< GPR14 General Purpose Register, offset: 0x38 */
  uint32_t GPR15;                                  /**< GPR15 General Purpose Register, offset: 0x3C */
  uint32_t GPR16;                                  /**< GPR16 General Purpose Register, offset: 0x40 */
  uint32_t GPR17;                                  /**< GPR17 General Purpose Register, offset: 0x44 */
  uint32_t GPR18;                                  /**< GPR18 General Purpose Register, offset: 0x48 */
  uint32_t GPR19;                                  /**< GPR19 General Purpose Register, offset: 0x4C */
  uint32_t GPR20;                                  /**< GPR20 General Purpose Register, offset: 0x50 */
  uint32_t GPR21;                                  /**< GPR21 General Purpose Register, offset: 0x54 */
  uint32_t GPR22;                                  /**< GPR22 General Purpose Register, offset: 0x58 */
  uint32_t GPR23;                                  /**< GPR23 General Purpose Register, offset: 0x5C */
  uint32_t GPR24;                                  /**< GPR24 General Purpose Register, offset: 0x60 */
  uint32_t GPR25;                                  /**< GPR25 General Purpose Register, offset: 0x64 */
} volatile *IOMUXC_GPR_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- IOMUXC_GPR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_GPR_Register_Accessor_Macros IOMUXC_GPR - Register accessor macros
 * @{
 */


