AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name LUT0_DATA - Lookup Table Data Register. */
#define LCDIF_LUT0_DATA_DATA_MASK                (0xFFFFFFFFU)
#define LCDIF_LUT0_DATA_DATA_SHIFT               (0U)
#define LCDIF_LUT0_DATA_DATA(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIF_LUT0_DATA_DATA_SHIFT)) & LCDIF_LUT0_DATA_DATA_MASK)

/*! @name LUT1_ADDR - Lookup Table Control Register. */
#define LCDIF_LUT1_ADDR_ADDR_MASK                (0xFFU)
#define LCDIF_LUT1_ADDR_ADDR_SHIFT               (0U)
#define LCDIF_LUT1_ADDR_ADDR(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIF_LUT1_ADDR_ADDR_SHIFT)) & LCDIF_LUT1_ADDR_ADDR_MASK)

/*! @name LUT1_DATA - Lookup Table Data Register. */
#define LCDIF_LUT1_DATA_DATA_MASK                (0xFFFFFFFFU)
#define LCDIF_LUT1_DATA_DATA_SHIFT               (0U)
#define LCDIF_LUT1_DATA_DATA(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIF_LUT1_DATA_DATA_SHIFT)) & LCDIF_LUT1_DATA_DATA_MASK)


/*!
 * @}
 */ /* end of group LCDIF_Register_Masks */


/* LCDIF - Peripheral instance base addresses */
/** Peripheral LCDIF base pointer */
#define LCDIF_BASE_PTR                           ((LCDIF_MemMapPtr)0x402B8000u)
/** Array initializer of LCDIF peripheral base pointers */
#define LCDIF_BASE_PTRS                          { LCDIF_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- LCDIF - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LCDIF_Register_Accessor_Macros LCDIF - Register accessor macros
 * @{
 */


/* LCDIF - Register instance definitions */
/* LCDIF */
#define LCDIF_CTRL                               LCDIF_CTRL_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL_SET                           LCDIF_CTRL_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL_CLR                           LCDIF_CTRL_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL_TOG                           LCDIF_CTRL_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL1                              LCDIF_CTRL1_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL1_SET                          LCDIF_CTRL1_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL1_CLR                          LCDIF_CTRL1_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL1_TOG                          LCDIF_CTRL1_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL2                              LCDIF_CTRL2_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL2_SET                          LCDIF_CTRL2_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL2_CLR                          LCDIF_CTRL2_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_CTRL2_TOG                          LCDIF_CTRL2_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_TRANSFER_COUNT                     LCDIF_TRANSFER_COUNT_REG(LCDIF_BASE_PTR)
#define LCDIF_CUR_BUF                            LCDIF_CUR_BUF_REG(LCDIF_BASE_PTR)
#define LCDIF_NEXT_BUF                           LCDIF_NEXT_BUF_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL0                            LCDIF_VDCTRL0_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL0_SET                        LCDIF_VDCTRL0_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL0_CLR                        LCDIF_VDCTRL0_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL0_TOG                        LCDIF_VDCTRL0_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL1                            LCDIF_VDCTRL1_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL2                            LCDIF_VDCTRL2_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL3                            LCDIF_VDCTRL3_REG(LCDIF_BASE_PTR)
#define LCDIF_VDCTRL4                            LCDIF_VDCTRL4_REG(LCDIF_BASE_PTR)
#define LCDIF_BM_ERROR_STAT                      LCDIF_BM_ERROR_STAT_REG(LCDIF_BASE_PTR)
#define LCDIF_CRC_STAT                           LCDIF_CRC_STAT_REG(LCDIF_BASE_PTR)
#define LCDIF_STAT                               LCDIF_STAT_REG(LCDIF_BASE_PTR)
#define LCDIF_THRES                              LCDIF_THRES_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL0                        LCDIF_PIGEONCTRL0_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL0_SET                    LCDIF_PIGEONCTRL0_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL0_CLR                    LCDIF_PIGEONCTRL0_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL0_TOG                    LCDIF_PIGEONCTRL0_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL1                        LCDIF_PIGEONCTRL1_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL1_SET                    LCDIF_PIGEONCTRL1_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL1_CLR                    LCDIF_PIGEONCTRL1_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL1_TOG                    LCDIF_PIGEONCTRL1_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL2                        LCDIF_PIGEONCTRL2_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL2_SET                    LCDIF_PIGEONCTRL2_SET_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL2_CLR                    LCDIF_PIGEONCTRL2_CLR_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEONCTRL2_TOG                    LCDIF_PIGEONCTRL2_TOG_REG(LCDIF_BASE_PTR)
#define LCDIF_PIGEON_0_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,0)
#define LCDIF_PIGEON_0_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,0)
#define LCDIF_PIGEON_0_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,0)
#define LCDIF_PIGEON_1_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,1)
#define LCDIF_PIGEON_1_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,1)
#define LCDIF_PIGEON_1_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,1)
#define LCDIF_PIGEON_2_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,2)
#define LCDIF_PIGEON_2_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,2)
#define LCDIF_PIGEON_2_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,2)
#define LCDIF_PIGEON_3_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,3)
#define LCDIF_PIGEON_3_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,3)
#define LCDIF_PIGEON_3_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,3)
#define LCDIF_PIGEON_4_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,4)
#define LCDIF_PIGEON_4_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,4)
#define LCDIF_PIGEON_4_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,4)
#define LCDIF_PIGEON_5_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,5)
#define LCDIF_PIGEON_5_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,5)
#define LCDIF_PIGEON_5_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,5)
#define LCDIF_PIGEON_6_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,6)
#define LCDIF_PIGEON_6_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,6)
#define LCDIF_PIGEON_6_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,6)
#define LCDIF_PIGEON_7_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,7)
#define LCDIF_PIGEON_7_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,7)
#define LCDIF_PIGEON_7_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,7)
#define LCDIF_PIGEON_8_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,8)
#define LCDIF_PIGEON_8_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,8)
#define LCDIF_PIGEON_8_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,8)
#define LCDIF_PIGEON_9_0                         LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,9)
#define LCDIF_PIGEON_9_1                         LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,9)
#define LCDIF_PIGEON_9_2                         LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,9)
#define LCDIF_PIGEON_10_0                        LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,10)
#define LCDIF_PIGEON_10_1                        LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,10)
#define LCDIF_PIGEON_10_2                        LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,10)
#define LCDIF_PIGEON_11_0                        LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,11)
#define LCDIF_PIGEON_11_1                        LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,11)
#define LCDIF_PIGEON_11_2                        LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,11)
#define LCDIF_LUT_CTRL                           LCDIF_LUT_CTRL_REG(LCDIF_BASE_PTR)
#define LCDIF_LUT0_ADDR                          LCDIF_LUT0_ADDR_REG(LCDIF_BASE_PTR)
#define LCDIF_LUT0_DATA                          LCDIF_LUT0_DATA_REG(LCDIF_BASE_PTR)
#define LCDIF_LUT1_ADDR                          LCDIF_LUT1_ADDR_REG(LCDIF_BASE_PTR)
#define LCDIF_LUT1_DATA                          LCDIF_LUT1_DATA_REG(LCDIF_BASE_PTR)

/* LCDIF - Register array accessors */
#define LCDIF_PIGEON_0(index)                    LCDIF_PIGEON_0_REG(LCDIF_BASE_PTR,index)
#define LCDIF_PIGEON_1(index)                    LCDIF_PIGEON_1_REG(LCDIF_BASE_PTR,index)
#define LCDIF_PIGEON_2(index)                    LCDIF_PIGEON_2_REG(LCDIF_BASE_PTR,index)

/*!
 * @}
 */ /* end of group LCDIF_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group LCDIF_Peripheral */


/* ----------------------------------------------------------------------------
   -- LPI2C
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Peripheral LPI2C
 * @{
 */

