AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SASR - Slave Address Status Register */
#define LPI2C_SASR_RADDR_MASK                    (0x7FFU)
#define LPI2C_SASR_RADDR_SHIFT                   (0U)
#define LPI2C_SASR_RADDR(x)                      (((uint32_t)(((uint32_t)(x)) << LPI2C_SASR_RADDR_SHIFT)) & LPI2C_SASR_RADDR_MASK)
#define LPI2C_SASR_ANV_MASK                      (0x4000U)
#define LPI2C_SASR_ANV_SHIFT                     (14U)

/*! @name STAR - Slave Transmit ACK Register */
#define LPI2C_STAR_TXNACK_MASK                   (0x1U)
#define LPI2C_STAR_TXNACK_SHIFT                  (0U)

/*! @name STDR - Slave Transmit Data Register */
#define LPI2C_STDR_DATA_MASK                     (0xFFU)
#define LPI2C_STDR_DATA_SHIFT                    (0U)
#define LPI2C_STDR_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << LPI2C_STDR_DATA_SHIFT)) & LPI2C_STDR_DATA_MASK)

/*! @name SRDR - Slave Receive Data Register */
#define LPI2C_SRDR_DATA_MASK                     (0xFFU)
#define LPI2C_SRDR_DATA_SHIFT                    (0U)
#define LPI2C_SRDR_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << LPI2C_SRDR_DATA_SHIFT)) & LPI2C_SRDR_DATA_MASK)
#define LPI2C_SRDR_RXEMPTY_MASK                  (0x4000U)
#define LPI2C_SRDR_RXEMPTY_SHIFT                 (14U)
#define LPI2C_SRDR_SOF_MASK                      (0x8000U)
#define LPI2C_SRDR_SOF_SHIFT                     (15U)


/*!
 * @}
 */ /* end of group LPI2C_Register_Masks */


/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C1 base pointer */
#define LPI2C1_BASE_PTR                          ((LPI2C_MemMapPtr)0x403F0000u)
/** Peripheral LPI2C2 base pointer */
#define LPI2C2_BASE_PTR                          ((LPI2C_MemMapPtr)0x403F4000u)
/** Peripheral LPI2C3 base pointer */
#define LPI2C3_BASE_PTR                          ((LPI2C_MemMapPtr)0x403F8000u)
/** Peripheral LPI2C4 base pointer */
#define LPI2C4_BASE_PTR                          ((LPI2C_MemMapPtr)0x403FC000u)
/** Array initializer of LPI2C peripheral base pointers */
#define LPI2C_BASE_PTRS                          { LPI2C1_BASE_PTR, LPI2C2_BASE_PTR, LPI2C3_BASE_PTR, LPI2C4_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- LPI2C - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Register_Accessor_Macros LPI2C - Register accessor macros
 * @{
 */


/* LPI2C - Register instance definitions */
/* LPI2C1 */
#define LPI2C1_VERID                             LPI2C_VERID_REG(LPI2C1_BASE_PTR)
#define LPI2C1_PARAM                             LPI2C_PARAM_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCR                               LPI2C_MCR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MSR                               LPI2C_MSR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MIER                              LPI2C_MIER_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MDER                              LPI2C_MDER_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCFGR0                            LPI2C_MCFGR0_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCFGR1                            LPI2C_MCFGR1_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCFGR2                            LPI2C_MCFGR2_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCFGR3                            LPI2C_MCFGR3_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MDMR                              LPI2C_MDMR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCCR0                             LPI2C_MCCR0_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MCCR1                             LPI2C_MCCR1_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MFCR                              LPI2C_MFCR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MFSR                              LPI2C_MFSR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MTDR                              LPI2C_MTDR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_MRDR                              LPI2C_MRDR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SCR                               LPI2C_SCR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SSR                               LPI2C_SSR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SIER                              LPI2C_SIER_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SDER                              LPI2C_SDER_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SCFGR1                            LPI2C_SCFGR1_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SCFGR2                            LPI2C_SCFGR2_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SAMR                              LPI2C_SAMR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SASR                              LPI2C_SASR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_STAR                              LPI2C_STAR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_STDR                              LPI2C_STDR_REG(LPI2C1_BASE_PTR)
#define LPI2C1_SRDR                              LPI2C_SRDR_REG(LPI2C1_BASE_PTR)
/* LPI2C2 */
#define LPI2C2_VERID                             LPI2C_VERID_REG(LPI2C2_BASE_PTR)
#define LPI2C2_PARAM                             LPI2C_PARAM_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCR                               LPI2C_MCR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MSR                               LPI2C_MSR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MIER                              LPI2C_MIER_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MDER                              LPI2C_MDER_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCFGR0                            LPI2C_MCFGR0_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCFGR1                            LPI2C_MCFGR1_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCFGR2                            LPI2C_MCFGR2_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCFGR3                            LPI2C_MCFGR3_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MDMR                              LPI2C_MDMR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCCR0                             LPI2C_MCCR0_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MCCR1                             LPI2C_MCCR1_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MFCR                              LPI2C_MFCR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MFSR                              LPI2C_MFSR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MTDR                              LPI2C_MTDR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_MRDR                              LPI2C_MRDR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SCR                               LPI2C_SCR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SSR                               LPI2C_SSR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SIER                              LPI2C_SIER_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SDER                              LPI2C_SDER_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SCFGR1                            LPI2C_SCFGR1_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SCFGR2                            LPI2C_SCFGR2_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SAMR                              LPI2C_SAMR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SASR                              LPI2C_SASR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_STAR                              LPI2C_STAR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_STDR                              LPI2C_STDR_REG(LPI2C2_BASE_PTR)
#define LPI2C2_SRDR                              LPI2C_SRDR_REG(LPI2C2_BASE_PTR)
/* LPI2C3 */
#define LPI2C3_VERID                             LPI2C_VERID_REG(LPI2C3_BASE_PTR)
#define LPI2C3_PARAM                             LPI2C_PARAM_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCR                               LPI2C_MCR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MSR                               LPI2C_MSR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MIER                              LPI2C_MIER_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MDER                              LPI2C_MDER_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCFGR0                            LPI2C_MCFGR0_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCFGR1                            LPI2C_MCFGR1_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCFGR2                            LPI2C_MCFGR2_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCFGR3                            LPI2C_MCFGR3_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MDMR                              LPI2C_MDMR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCCR0                             LPI2C_MCCR0_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MCCR1                             LPI2C_MCCR1_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MFCR                              LPI2C_MFCR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MFSR                              LPI2C_MFSR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MTDR                              LPI2C_MTDR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_MRDR                              LPI2C_MRDR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SCR                               LPI2C_SCR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SSR                               LPI2C_SSR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SIER                              LPI2C_SIER_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SDER                              LPI2C_SDER_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SCFGR1                            LPI2C_SCFGR1_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SCFGR2                            LPI2C_SCFGR2_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SAMR                              LPI2C_SAMR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SASR                              LPI2C_SASR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_STAR                              LPI2C_STAR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_STDR                              LPI2C_STDR_REG(LPI2C3_BASE_PTR)
#define LPI2C3_SRDR                              LPI2C_SRDR_REG(LPI2C3_BASE_PTR)
/* LPI2C4 */
#define LPI2C4_VERID                             LPI2C_VERID_REG(LPI2C4_BASE_PTR)
#define LPI2C4_PARAM                             LPI2C_PARAM_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCR                               LPI2C_MCR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MSR                               LPI2C_MSR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MIER                              LPI2C_MIER_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MDER                              LPI2C_MDER_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCFGR0                            LPI2C_MCFGR0_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCFGR1                            LPI2C_MCFGR1_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCFGR2                            LPI2C_MCFGR2_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCFGR3                            LPI2C_MCFGR3_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MDMR                              LPI2C_MDMR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCCR0                             LPI2C_MCCR0_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MCCR1                             LPI2C_MCCR1_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MFCR                              LPI2C_MFCR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MFSR                              LPI2C_MFSR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MTDR                              LPI2C_MTDR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_MRDR                              LPI2C_MRDR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SCR                               LPI2C_SCR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SSR                               LPI2C_SSR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SIER                              LPI2C_SIER_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SDER                              LPI2C_SDER_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SCFGR1                            LPI2C_SCFGR1_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SCFGR2                            LPI2C_SCFGR2_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SAMR                              LPI2C_SAMR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SASR                              LPI2C_SASR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_STAR                              LPI2C_STAR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_STDR                              LPI2C_STDR_REG(LPI2C4_BASE_PTR)
#define LPI2C4_SRDR                              LPI2C_SRDR_REG(LPI2C4_BASE_PTR)

/*!
 * @}
 */ /* end of group LPI2C_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group LPI2C_Peripheral */


/* ----------------------------------------------------------------------------
   -- LPSPI
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Peripheral LPSPI
 * @{
 */

/** LPSPI - Peripheral register structure */
typedef struct LPSPI_MemMap {
  uint32_t VERID;                                  /**< Version ID Register, offset: 0x0 */
  uint32_t PARAM;                                  /**< Parameter Register, offset: 0x4 */
  uint8_t RESERVED_0[8];
  uint32_t CR;                                     /**< Control Register, offset: 0x10 */
  uint32_t SR;                                     /**< Status Register, offset: 0x14 */
  uint32_t IER;                                    /**< Interrupt Enable Register, offset: 0x18 */
  uint32_t DER;                                    /**< DMA Enable Register, offset: 0x1C */
  uint32_t CFGR0;                                  /**< Configuration Register 0, offset: 0x20 */
  uint32_t CFGR1;                                  /**< Configuration Register 1, offset: 0x24 */
  uint8_t RESERVED_1[8];
  uint32_t DMR0;                                   /**< Data Match Register 0, offset: 0x30 */
  uint32_t DMR1;                                   /**< Data Match Register 1, offset: 0x34 */
  uint8_t RESERVED_2[8];
  uint32_t CCR;                                    /**< Clock Configuration Register, offset: 0x40 */
  uint8_t RESERVED_3[20];
  uint32_t FCR;                                    /**< FIFO Control Register, offset: 0x58 */
  uint32_t FSR;                                    /**< FIFO Status Register, offset: 0x5C */
  uint32_t TCR;                                    /**< Transmit Command Register, offset: 0x60 */
  uint32_t TDR;                                    /**< Transmit Data Register, offset: 0x64 */
  uint8_t RESERVED_4[8];
  uint32_t RSR;                                    /**< Receive Status Register, offset: 0x70 */
  uint32_t RDR;                                    /**< Receive Data Register, offset: 0x74 */
} volatile *LPSPI_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- LPSPI - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Register_Accessor_Macros LPSPI - Register accessor macros
 * @{
 */


/* LPSPI - Register accessors */
#define LPSPI_VERID_REG(base)                    ((base)->VERID)
#define LPSPI_PARAM_REG(base)                    ((base)->PARAM)
#define LPSPI_CR_REG(base)                       ((base)->CR)
#define LPSPI_SR_REG(base)                       ((base)->SR)
#define LPSPI_IER_REG(base)                      ((base)->IER)
#define LPSPI_DER_REG(base)                      ((base)->DER)
#define LPSPI_CFGR0_REG(base)                    ((base)->CFGR0)
#define LPSPI_CFGR1_REG(base)                    ((base)->CFGR1)
#define LPSPI_DMR0_REG(base)                     ((base)->DMR0)
#define LPSPI_DMR1_REG(base)                     ((base)->DMR1)
#define LPSPI_CCR_REG(base)                      ((base)->CCR)
#define LPSPI_FCR_REG(base)                      ((base)->FCR)
#define LPSPI_FSR_REG(base)                      ((base)->FSR)
#define LPSPI_TCR_REG(base)                      ((base)->TCR)
#define LPSPI_TDR_REG(base)                      ((base)->TDR)
#define LPSPI_RSR_REG(base)                      ((base)->RSR)
#define LPSPI_RDR_REG(base)                      ((base)->RDR)

/*!
 * @}
 */ /* end of group LPSPI_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- LPSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Register_Masks LPSPI Register Masks
 * @{
 */

