AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name RSR - Receive Status Register */
#define LPSPI_RSR_SOF_MASK                       (0x1U)
#define LPSPI_RSR_SOF_SHIFT                      (0U)
#define LPSPI_RSR_RXEMPTY_MASK                   (0x2U)
#define LPSPI_RSR_RXEMPTY_SHIFT                  (1U)

/*! @name RDR - Receive Data Register */
#define LPSPI_RDR_DATA_MASK                      (0xFFFFFFFFU)
#define LPSPI_RDR_DATA_SHIFT                     (0U)
#define LPSPI_RDR_DATA(x)                        (((uint32_t)(((uint32_t)(x)) << LPSPI_RDR_DATA_SHIFT)) & LPSPI_RDR_DATA_MASK)


/*!
 * @}
 */ /* end of group LPSPI_Register_Masks */


/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI1 base pointer */
#define LPSPI1_BASE_PTR                          ((LPSPI_MemMapPtr)0x40394000u)
/** Peripheral LPSPI2 base pointer */
#define LPSPI2_BASE_PTR                          ((LPSPI_MemMapPtr)0x40398000u)
/** Peripheral LPSPI3 base pointer */
#define LPSPI3_BASE_PTR                          ((LPSPI_MemMapPtr)0x4039C000u)
/** Peripheral LPSPI4 base pointer */
#define LPSPI4_BASE_PTR                          ((LPSPI_MemMapPtr)0x403A0000u)
/** Array initializer of LPSPI peripheral base pointers */
#define LPSPI_BASE_PTRS                          { LPSPI1_BASE_PTR, LPSPI2_BASE_PTR, LPSPI3_BASE_PTR, LPSPI4_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- LPSPI - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Register_Accessor_Macros LPSPI - Register accessor macros
 * @{
 */


/* LPSPI - Register instance definitions */
/* LPSPI1 */
#define LPSPI1_VERID                             LPSPI_VERID_REG(LPSPI1_BASE_PTR)
#define LPSPI1_PARAM                             LPSPI_PARAM_REG(LPSPI1_BASE_PTR)
#define LPSPI1_CR                                LPSPI_CR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_SR                                LPSPI_SR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_IER                               LPSPI_IER_REG(LPSPI1_BASE_PTR)
#define LPSPI1_DER                               LPSPI_DER_REG(LPSPI1_BASE_PTR)
#define LPSPI1_CFGR0                             LPSPI_CFGR0_REG(LPSPI1_BASE_PTR)
#define LPSPI1_CFGR1                             LPSPI_CFGR1_REG(LPSPI1_BASE_PTR)
#define LPSPI1_DMR0                              LPSPI_DMR0_REG(LPSPI1_BASE_PTR)
#define LPSPI1_DMR1                              LPSPI_DMR1_REG(LPSPI1_BASE_PTR)
#define LPSPI1_CCR                               LPSPI_CCR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_FCR                               LPSPI_FCR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_FSR                               LPSPI_FSR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_TCR                               LPSPI_TCR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_TDR                               LPSPI_TDR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_RSR                               LPSPI_RSR_REG(LPSPI1_BASE_PTR)
#define LPSPI1_RDR                               LPSPI_RDR_REG(LPSPI1_BASE_PTR)
/* LPSPI2 */
#define LPSPI2_VERID                             LPSPI_VERID_REG(LPSPI2_BASE_PTR)
#define LPSPI2_PARAM                             LPSPI_PARAM_REG(LPSPI2_BASE_PTR)
#define LPSPI2_CR                                LPSPI_CR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_SR                                LPSPI_SR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_IER                               LPSPI_IER_REG(LPSPI2_BASE_PTR)
#define LPSPI2_DER                               LPSPI_DER_REG(LPSPI2_BASE_PTR)
#define LPSPI2_CFGR0                             LPSPI_CFGR0_REG(LPSPI2_BASE_PTR)
#define LPSPI2_CFGR1                             LPSPI_CFGR1_REG(LPSPI2_BASE_PTR)
#define LPSPI2_DMR0                              LPSPI_DMR0_REG(LPSPI2_BASE_PTR)
#define LPSPI2_DMR1                              LPSPI_DMR1_REG(LPSPI2_BASE_PTR)
#define LPSPI2_CCR                               LPSPI_CCR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_FCR                               LPSPI_FCR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_FSR                               LPSPI_FSR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_TCR                               LPSPI_TCR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_TDR                               LPSPI_TDR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_RSR                               LPSPI_RSR_REG(LPSPI2_BASE_PTR)
#define LPSPI2_RDR                               LPSPI_RDR_REG(LPSPI2_BASE_PTR)
/* LPSPI3 */
#define LPSPI3_VERID                             LPSPI_VERID_REG(LPSPI3_BASE_PTR)
#define LPSPI3_PARAM                             LPSPI_PARAM_REG(LPSPI3_BASE_PTR)
#define LPSPI3_CR                                LPSPI_CR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_SR                                LPSPI_SR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_IER                               LPSPI_IER_REG(LPSPI3_BASE_PTR)
#define LPSPI3_DER                               LPSPI_DER_REG(LPSPI3_BASE_PTR)
#define LPSPI3_CFGR0                             LPSPI_CFGR0_REG(LPSPI3_BASE_PTR)
#define LPSPI3_CFGR1                             LPSPI_CFGR1_REG(LPSPI3_BASE_PTR)
#define LPSPI3_DMR0                              LPSPI_DMR0_REG(LPSPI3_BASE_PTR)
#define LPSPI3_DMR1                              LPSPI_DMR1_REG(LPSPI3_BASE_PTR)
#define LPSPI3_CCR                               LPSPI_CCR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_FCR                               LPSPI_FCR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_FSR                               LPSPI_FSR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_TCR                               LPSPI_TCR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_TDR                               LPSPI_TDR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_RSR                               LPSPI_RSR_REG(LPSPI3_BASE_PTR)
#define LPSPI3_RDR                               LPSPI_RDR_REG(LPSPI3_BASE_PTR)
/* LPSPI4 */
#define LPSPI4_VERID                             LPSPI_VERID_REG(LPSPI4_BASE_PTR)
#define LPSPI4_PARAM                             LPSPI_PARAM_REG(LPSPI4_BASE_PTR)
#define LPSPI4_CR                                LPSPI_CR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_SR                                LPSPI_SR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_IER                               LPSPI_IER_REG(LPSPI4_BASE_PTR)
#define LPSPI4_DER                               LPSPI_DER_REG(LPSPI4_BASE_PTR)
#define LPSPI4_CFGR0                             LPSPI_CFGR0_REG(LPSPI4_BASE_PTR)
#define LPSPI4_CFGR1                             LPSPI_CFGR1_REG(LPSPI4_BASE_PTR)
#define LPSPI4_DMR0                              LPSPI_DMR0_REG(LPSPI4_BASE_PTR)
#define LPSPI4_DMR1                              LPSPI_DMR1_REG(LPSPI4_BASE_PTR)
#define LPSPI4_CCR                               LPSPI_CCR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_FCR                               LPSPI_FCR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_FSR                               LPSPI_FSR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_TCR                               LPSPI_TCR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_TDR                               LPSPI_TDR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_RSR                               LPSPI_RSR_REG(LPSPI4_BASE_PTR)
#define LPSPI4_RDR                               LPSPI_RDR_REG(LPSPI4_BASE_PTR)

/*!
 * @}
 */ /* end of group LPSPI_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group LPSPI_Peripheral */


/* ----------------------------------------------------------------------------
   -- LPUART
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Peripheral LPUART
 * @{
 */

