AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name WATER - LPUART Watermark Register */
#define LPUART_WATER_TXWATER_MASK                (0x3U)
#define LPUART_WATER_TXWATER_SHIFT               (0U)
#define LPUART_WATER_TXWATER(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_TXWATER_SHIFT)) & LPUART_WATER_TXWATER_MASK)
#define LPUART_WATER_TXCOUNT_MASK                (0x700U)
#define LPUART_WATER_TXCOUNT_SHIFT               (8U)
#define LPUART_WATER_TXCOUNT(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_TXCOUNT_SHIFT)) & LPUART_WATER_TXCOUNT_MASK)
#define LPUART_WATER_RXWATER_MASK                (0x30000U)
#define LPUART_WATER_RXWATER_SHIFT               (16U)
#define LPUART_WATER_RXWATER(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_RXWATER_SHIFT)) & LPUART_WATER_RXWATER_MASK)
#define LPUART_WATER_RXCOUNT_MASK                (0x7000000U)
#define LPUART_WATER_RXCOUNT_SHIFT               (24U)
#define LPUART_WATER_RXCOUNT(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_RXCOUNT_SHIFT)) & LPUART_WATER_RXCOUNT_MASK)


/*!
 * @}
 */ /* end of group LPUART_Register_Masks */


/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART1 base pointer */
#define LPUART1_BASE_PTR                         ((LPUART_MemMapPtr)0x40184000u)
/** Peripheral LPUART2 base pointer */
#define LPUART2_BASE_PTR                         ((LPUART_MemMapPtr)0x40188000u)
/** Peripheral LPUART3 base pointer */
#define LPUART3_BASE_PTR                         ((LPUART_MemMapPtr)0x4018C000u)
/** Peripheral LPUART4 base pointer */
#define LPUART4_BASE_PTR                         ((LPUART_MemMapPtr)0x40190000u)
/** Peripheral LPUART5 base pointer */
#define LPUART5_BASE_PTR                         ((LPUART_MemMapPtr)0x40194000u)
/** Peripheral LPUART6 base pointer */
#define LPUART6_BASE_PTR                         ((LPUART_MemMapPtr)0x40198000u)
/** Peripheral LPUART7 base pointer */
#define LPUART7_BASE_PTR                         ((LPUART_MemMapPtr)0x4019C000u)
/** Peripheral LPUART8 base pointer */
#define LPUART8_BASE_PTR                         ((LPUART_MemMapPtr)0x401A0000u)
/** Array initializer of LPUART peripheral base pointers */
#define LPUART_BASE_PTRS                         { LPUART1_BASE_PTR, LPUART2_BASE_PTR, LPUART3_BASE_PTR, LPUART4_BASE_PTR, LPUART5_BASE_PTR, LPUART6_BASE_PTR, LPUART7_BASE_PTR, LPUART8_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- LPUART - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Register_Accessor_Macros LPUART - Register accessor macros
 * @{
 */


/* LPUART - Register instance definitions */
/* LPUART1 */
#define LPUART1_VERID                            LPUART_VERID_REG(LPUART1_BASE_PTR)
#define LPUART1_PARAM                            LPUART_PARAM_REG(LPUART1_BASE_PTR)
#define LPUART1_GLOBAL                           LPUART_GLOBAL_REG(LPUART1_BASE_PTR)
#define LPUART1_PINCFG                           LPUART_PINCFG_REG(LPUART1_BASE_PTR)
#define LPUART1_BAUD                             LPUART_BAUD_REG(LPUART1_BASE_PTR)
#define LPUART1_STAT                             LPUART_STAT_REG(LPUART1_BASE_PTR)
#define LPUART1_CTRL                             LPUART_CTRL_REG(LPUART1_BASE_PTR)
#define LPUART1_DATA                             LPUART_DATA_REG(LPUART1_BASE_PTR)
#define LPUART1_MATCH                            LPUART_MATCH_REG(LPUART1_BASE_PTR)
#define LPUART1_MODIR                            LPUART_MODIR_REG(LPUART1_BASE_PTR)
#define LPUART1_FIFO                             LPUART_FIFO_REG(LPUART1_BASE_PTR)
#define LPUART1_WATER                            LPUART_WATER_REG(LPUART1_BASE_PTR)
/* LPUART2 */
#define LPUART2_VERID                            LPUART_VERID_REG(LPUART2_BASE_PTR)
#define LPUART2_PARAM                            LPUART_PARAM_REG(LPUART2_BASE_PTR)
#define LPUART2_GLOBAL                           LPUART_GLOBAL_REG(LPUART2_BASE_PTR)
#define LPUART2_PINCFG                           LPUART_PINCFG_REG(LPUART2_BASE_PTR)
#define LPUART2_BAUD                             LPUART_BAUD_REG(LPUART2_BASE_PTR)
#define LPUART2_STAT                             LPUART_STAT_REG(LPUART2_BASE_PTR)
#define LPUART2_CTRL                             LPUART_CTRL_REG(LPUART2_BASE_PTR)
#define LPUART2_DATA                             LPUART_DATA_REG(LPUART2_BASE_PTR)
#define LPUART2_MATCH                            LPUART_MATCH_REG(LPUART2_BASE_PTR)
#define LPUART2_MODIR                            LPUART_MODIR_REG(LPUART2_BASE_PTR)
#define LPUART2_FIFO                             LPUART_FIFO_REG(LPUART2_BASE_PTR)
#define LPUART2_WATER                            LPUART_WATER_REG(LPUART2_BASE_PTR)
/* LPUART3 */
#define LPUART3_VERID                            LPUART_VERID_REG(LPUART3_BASE_PTR)
#define LPUART3_PARAM                            LPUART_PARAM_REG(LPUART3_BASE_PTR)
#define LPUART3_GLOBAL                           LPUART_GLOBAL_REG(LPUART3_BASE_PTR)
#define LPUART3_PINCFG                           LPUART_PINCFG_REG(LPUART3_BASE_PTR)
#define LPUART3_BAUD                             LPUART_BAUD_REG(LPUART3_BASE_PTR)
#define LPUART3_STAT                             LPUART_STAT_REG(LPUART3_BASE_PTR)
#define LPUART3_CTRL                             LPUART_CTRL_REG(LPUART3_BASE_PTR)
#define LPUART3_DATA                             LPUART_DATA_REG(LPUART3_BASE_PTR)
#define LPUART3_MATCH                            LPUART_MATCH_REG(LPUART3_BASE_PTR)
#define LPUART3_MODIR                            LPUART_MODIR_REG(LPUART3_BASE_PTR)
#define LPUART3_FIFO                             LPUART_FIFO_REG(LPUART3_BASE_PTR)
#define LPUART3_WATER                            LPUART_WATER_REG(LPUART3_BASE_PTR)
/* LPUART4 */
#define LPUART4_VERID                            LPUART_VERID_REG(LPUART4_BASE_PTR)
#define LPUART4_PARAM                            LPUART_PARAM_REG(LPUART4_BASE_PTR)
#define LPUART4_GLOBAL                           LPUART_GLOBAL_REG(LPUART4_BASE_PTR)
#define LPUART4_PINCFG                           LPUART_PINCFG_REG(LPUART4_BASE_PTR)
#define LPUART4_BAUD                             LPUART_BAUD_REG(LPUART4_BASE_PTR)
#define LPUART4_STAT                             LPUART_STAT_REG(LPUART4_BASE_PTR)
#define LPUART4_CTRL                             LPUART_CTRL_REG(LPUART4_BASE_PTR)
#define LPUART4_DATA                             LPUART_DATA_REG(LPUART4_BASE_PTR)
#define LPUART4_MATCH                            LPUART_MATCH_REG(LPUART4_BASE_PTR)
#define LPUART4_MODIR                            LPUART_MODIR_REG(LPUART4_BASE_PTR)
#define LPUART4_FIFO                             LPUART_FIFO_REG(LPUART4_BASE_PTR)
#define LPUART4_WATER                            LPUART_WATER_REG(LPUART4_BASE_PTR)
/* LPUART5 */
#define LPUART5_VERID                            LPUART_VERID_REG(LPUART5_BASE_PTR)
#define LPUART5_PARAM                            LPUART_PARAM_REG(LPUART5_BASE_PTR)
#define LPUART5_GLOBAL                           LPUART_GLOBAL_REG(LPUART5_BASE_PTR)
#define LPUART5_PINCFG                           LPUART_PINCFG_REG(LPUART5_BASE_PTR)
#define LPUART5_BAUD                             LPUART_BAUD_REG(LPUART5_BASE_PTR)
#define LPUART5_STAT                             LPUART_STAT_REG(LPUART5_BASE_PTR)
#define LPUART5_CTRL                             LPUART_CTRL_REG(LPUART5_BASE_PTR)
#define LPUART5_DATA                             LPUART_DATA_REG(LPUART5_BASE_PTR)
#define LPUART5_MATCH                            LPUART_MATCH_REG(LPUART5_BASE_PTR)
#define LPUART5_MODIR                            LPUART_MODIR_REG(LPUART5_BASE_PTR)
#define LPUART5_FIFO                             LPUART_FIFO_REG(LPUART5_BASE_PTR)
#define LPUART5_WATER                            LPUART_WATER_REG(LPUART5_BASE_PTR)
/* LPUART6 */
#define LPUART6_VERID                            LPUART_VERID_REG(LPUART6_BASE_PTR)
#define LPUART6_PARAM                            LPUART_PARAM_REG(LPUART6_BASE_PTR)
#define LPUART6_GLOBAL                           LPUART_GLOBAL_REG(LPUART6_BASE_PTR)
#define LPUART6_PINCFG                           LPUART_PINCFG_REG(LPUART6_BASE_PTR)
#define LPUART6_BAUD                             LPUART_BAUD_REG(LPUART6_BASE_PTR)
#define LPUART6_STAT                             LPUART_STAT_REG(LPUART6_BASE_PTR)
#define LPUART6_CTRL                             LPUART_CTRL_REG(LPUART6_BASE_PTR)
#define LPUART6_DATA                             LPUART_DATA_REG(LPUART6_BASE_PTR)
#define LPUART6_MATCH                            LPUART_MATCH_REG(LPUART6_BASE_PTR)
#define LPUART6_MODIR                            LPUART_MODIR_REG(LPUART6_BASE_PTR)
#define LPUART6_FIFO                             LPUART_FIFO_REG(LPUART6_BASE_PTR)
#define LPUART6_WATER                            LPUART_WATER_REG(LPUART6_BASE_PTR)
/* LPUART7 */
#define LPUART7_VERID                            LPUART_VERID_REG(LPUART7_BASE_PTR)
#define LPUART7_PARAM                            LPUART_PARAM_REG(LPUART7_BASE_PTR)
#define LPUART7_GLOBAL                           LPUART_GLOBAL_REG(LPUART7_BASE_PTR)
#define LPUART7_PINCFG                           LPUART_PINCFG_REG(LPUART7_BASE_PTR)
#define LPUART7_BAUD                             LPUART_BAUD_REG(LPUART7_BASE_PTR)
#define LPUART7_STAT                             LPUART_STAT_REG(LPUART7_BASE_PTR)
#define LPUART7_CTRL                             LPUART_CTRL_REG(LPUART7_BASE_PTR)
#define LPUART7_DATA                             LPUART_DATA_REG(LPUART7_BASE_PTR)
#define LPUART7_MATCH                            LPUART_MATCH_REG(LPUART7_BASE_PTR)
#define LPUART7_MODIR                            LPUART_MODIR_REG(LPUART7_BASE_PTR)
#define LPUART7_FIFO                             LPUART_FIFO_REG(LPUART7_BASE_PTR)
#define LPUART7_WATER                            LPUART_WATER_REG(LPUART7_BASE_PTR)
/* LPUART8 */
#define LPUART8_VERID                            LPUART_VERID_REG(LPUART8_BASE_PTR)
#define LPUART8_PARAM                            LPUART_PARAM_REG(LPUART8_BASE_PTR)
#define LPUART8_GLOBAL                           LPUART_GLOBAL_REG(LPUART8_BASE_PTR)
#define LPUART8_PINCFG                           LPUART_PINCFG_REG(LPUART8_BASE_PTR)
#define LPUART8_BAUD                             LPUART_BAUD_REG(LPUART8_BASE_PTR)
#define LPUART8_STAT                             LPUART_STAT_REG(LPUART8_BASE_PTR)
#define LPUART8_CTRL                             LPUART_CTRL_REG(LPUART8_BASE_PTR)
#define LPUART8_DATA                             LPUART_DATA_REG(LPUART8_BASE_PTR)
#define LPUART8_MATCH                            LPUART_MATCH_REG(LPUART8_BASE_PTR)
#define LPUART8_MODIR                            LPUART_MODIR_REG(LPUART8_BASE_PTR)
#define LPUART8_FIFO                             LPUART_FIFO_REG(LPUART8_BASE_PTR)
#define LPUART8_WATER                            LPUART_WATER_REG(LPUART8_BASE_PTR)

/*!
 * @}
 */ /* end of group LPUART_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group LPUART_Peripheral */


/* ----------------------------------------------------------------------------
   -- NVIC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Peripheral NVIC
 * @{
 */

/** NVIC - Peripheral register structure */
typedef struct NVIC_MemMap {
  uint32_t ISER[5];                                /**< Interrupt Set Enable Register n, array offset: 0x0, array step: 0x4 */
  uint8_t RESERVED_0[108];
  uint32_t ICER[5];                                /**< Interrupt Clear Enable Register n, array offset: 0x80, array step: 0x4 */
  uint8_t RESERVED_1[108];
  uint32_t ISPR[5];                                /**< Interrupt Set Pending Register n, array offset: 0x100, array step: 0x4 */
  uint8_t RESERVED_2[108];
  uint32_t ICPR[5];                                /**< Interrupt Clear Pending Register n, array offset: 0x180, array step: 0x4 */
  uint8_t RESERVED_3[108];
  uint32_t IABR[5];                                /**< Interrupt Active bit Register n, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_4[236];
  uint8_t IP[160];                                 /**< Interrupt Priority Register 0..Interrupt Priority Register 159, array offset: 0x300, array step: 0x1 */
  uint8_t RESERVED_5[2656];
  uint32_t STIR[1];                                /**< Software Trigger Interrupt Register, array offset: 0xE00, array step: 0x4 */
} volatile *NVIC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- NVIC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Register_Accessor_Macros NVIC - Register accessor macros
 * @{
 */


/* NVIC - Register accessors */
#define NVIC_ISER_REG(base,index)                ((base)->ISER[index])
#define NVIC_ICER_REG(base,index)                ((base)->ICER[index])
#define NVIC_ISPR_REG(base,index)                ((base)->ISPR[index])
#define NVIC_ICPR_REG(base,index)                ((base)->ICPR[index])
#define NVIC_IABR_REG(base,index)                ((base)->IABR[index])
#define NVIC_IP_REG(base,index)                  ((base)->IP[index])
#define NVIC_STIR_REG(base,index)                ((base)->STIR[index])

/*!
 * @}
 */ /* end of group NVIC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- NVIC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Register_Masks NVIC Register Masks
 * @{
 */

