AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name ISER - Interrupt Set Enable Register n */
#define NVIC_ISER_SETENA_MASK                    (0xFFFFFFFFU)
#define NVIC_ISER_SETENA_SHIFT                   (0U)
#define NVIC_ISER_SETENA(x)                      (((uint32_t)(((uint32_t)(x)) << NVIC_ISER_SETENA_SHIFT)) & NVIC_ISER_SETENA_MASK)

/* The count of NVIC_ISER */
#define NVIC_ISER_COUNT                          (5U)

/*! @name ICER - Interrupt Clear Enable Register n */
#define NVIC_ICER_CLRENA_MASK                    (0xFFFFFFFFU)
#define NVIC_ICER_CLRENA_SHIFT                   (0U)
#define NVIC_ICER_CLRENA(x)                      (((uint32_t)(((uint32_t)(x)) << NVIC_ICER_CLRENA_SHIFT)) & NVIC_ICER_CLRENA_MASK)

/* The count of NVIC_ICER */
#define NVIC_ICER_COUNT                          (5U)

/*! @name ISPR - Interrupt Set Pending Register n */
#define NVIC_ISPR_SETPEND_MASK                   (0xFFFFFFFFU)
#define NVIC_ISPR_SETPEND_SHIFT                  (0U)
#define NVIC_ISPR_SETPEND(x)                     (((uint32_t)(((uint32_t)(x)) << NVIC_ISPR_SETPEND_SHIFT)) & NVIC_ISPR_SETPEND_MASK)

/* The count of NVIC_ISPR */
#define NVIC_ISPR_COUNT                          (5U)

/*! @name ICPR - Interrupt Clear Pending Register n */
#define NVIC_ICPR_CLRPEND_MASK                   (0xFFFFFFFFU)
#define NVIC_ICPR_CLRPEND_SHIFT                  (0U)
#define NVIC_ICPR_CLRPEND(x)                     (((uint32_t)(((uint32_t)(x)) << NVIC_ICPR_CLRPEND_SHIFT)) & NVIC_ICPR_CLRPEND_MASK)

/* The count of NVIC_ICPR */
#define NVIC_ICPR_COUNT                          (5U)

/*! @name IABR - Interrupt Active bit Register n */
#define NVIC_IABR_ACTIVE_MASK                    (0xFFFFFFFFU)
#define NVIC_IABR_ACTIVE_SHIFT                   (0U)
#define NVIC_IABR_ACTIVE(x)                      (((uint32_t)(((uint32_t)(x)) << NVIC_IABR_ACTIVE_SHIFT)) & NVIC_IABR_ACTIVE_MASK)

/* The count of NVIC_IABR */
#define NVIC_IABR_COUNT                          (5U)

/*! @name IP - Interrupt Priority Register 0..Interrupt Priority Register 159 */
#define NVIC_IP_PRI0_MASK                        (0xF0U)
#define NVIC_IP_PRI0_SHIFT                       (4U)
#define NVIC_IP_PRI0(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI0_SHIFT)) & NVIC_IP_PRI0_MASK)
#define NVIC_IP_PRI1_MASK                        (0xF0U)
#define NVIC_IP_PRI1_SHIFT                       (4U)
#define NVIC_IP_PRI1(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI1_SHIFT)) & NVIC_IP_PRI1_MASK)
#define NVIC_IP_PRI2_MASK                        (0xF0U)
#define NVIC_IP_PRI2_SHIFT                       (4U)
#define NVIC_IP_PRI2(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI2_SHIFT)) & NVIC_IP_PRI2_MASK)
#define NVIC_IP_PRI3_MASK                        (0xF0U)
#define NVIC_IP_PRI3_SHIFT                       (4U)
#define NVIC_IP_PRI3(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI3_SHIFT)) & NVIC_IP_PRI3_MASK)
#define NVIC_IP_PRI4_MASK                        (0xF0U)
#define NVIC_IP_PRI4_SHIFT                       (4U)
#define NVIC_IP_PRI4(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI4_SHIFT)) & NVIC_IP_PRI4_MASK)
#define NVIC_IP_PRI5_MASK                        (0xF0U)
#define NVIC_IP_PRI5_SHIFT                       (4U)
#define NVIC_IP_PRI5(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI5_SHIFT)) & NVIC_IP_PRI5_MASK)
#define NVIC_IP_PRI6_MASK                        (0xF0U)
#define NVIC_IP_PRI6_SHIFT                       (4U)
#define NVIC_IP_PRI6(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI6_SHIFT)) & NVIC_IP_PRI6_MASK)
#define NVIC_IP_PRI7_MASK                        (0xF0U)
#define NVIC_IP_PRI7_SHIFT                       (4U)
#define NVIC_IP_PRI7(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI7_SHIFT)) & NVIC_IP_PRI7_MASK)
#define NVIC_IP_PRI8_MASK                        (0xF0U)
#define NVIC_IP_PRI8_SHIFT                       (4U)
#define NVIC_IP_PRI8(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI8_SHIFT)) & NVIC_IP_PRI8_MASK)
#define NVIC_IP_PRI9_MASK                        (0xF0U)
#define NVIC_IP_PRI9_SHIFT                       (4U)
#define NVIC_IP_PRI9(x)                          (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI9_SHIFT)) & NVIC_IP_PRI9_MASK)
#define NVIC_IP_PRI10_MASK                       (0xF0U)
#define NVIC_IP_PRI10_SHIFT                      (4U)
#define NVIC_IP_PRI10(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI10_SHIFT)) & NVIC_IP_PRI10_MASK)
#define NVIC_IP_PRI11_MASK                       (0xF0U)
#define NVIC_IP_PRI11_SHIFT                      (4U)
#define NVIC_IP_PRI11(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI11_SHIFT)) & NVIC_IP_PRI11_MASK)
#define NVIC_IP_PRI12_MASK                       (0xF0U)
#define NVIC_IP_PRI12_SHIFT                      (4U)
#define NVIC_IP_PRI12(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI12_SHIFT)) & NVIC_IP_PRI12_MASK)
#define NVIC_IP_PRI13_MASK                       (0xF0U)
#define NVIC_IP_PRI13_SHIFT                      (4U)
#define NVIC_IP_PRI13(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI13_SHIFT)) & NVIC_IP_PRI13_MASK)
#define NVIC_IP_PRI14_MASK                       (0xF0U)
#define NVIC_IP_PRI14_SHIFT                      (4U)
#define NVIC_IP_PRI14(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI14_SHIFT)) & NVIC_IP_PRI14_MASK)
#define NVIC_IP_PRI15_MASK                       (0xF0U)
#define NVIC_IP_PRI15_SHIFT                      (4U)
#define NVIC_IP_PRI15(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI15_SHIFT)) & NVIC_IP_PRI15_MASK)
#define NVIC_IP_PRI16_MASK                       (0xF0U)
#define NVIC_IP_PRI16_SHIFT                      (4U)
#define NVIC_IP_PRI16(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI16_SHIFT)) & NVIC_IP_PRI16_MASK)
#define NVIC_IP_PRI17_MASK                       (0xF0U)
#define NVIC_IP_PRI17_SHIFT                      (4U)
#define NVIC_IP_PRI17(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI17_SHIFT)) & NVIC_IP_PRI17_MASK)
#define NVIC_IP_PRI18_MASK                       (0xF0U)
#define NVIC_IP_PRI18_SHIFT                      (4U)
#define NVIC_IP_PRI18(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI18_SHIFT)) & NVIC_IP_PRI18_MASK)
#define NVIC_IP_PRI19_MASK                       (0xF0U)
#define NVIC_IP_PRI19_SHIFT                      (4U)
#define NVIC_IP_PRI19(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI19_SHIFT)) & NVIC_IP_PRI19_MASK)
#define NVIC_IP_PRI20_MASK                       (0xF0U)
#define NVIC_IP_PRI20_SHIFT                      (4U)
#define NVIC_IP_PRI20(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI20_SHIFT)) & NVIC_IP_PRI20_MASK)
#define NVIC_IP_PRI21_MASK                       (0xF0U)
#define NVIC_IP_PRI21_SHIFT                      (4U)
#define NVIC_IP_PRI21(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI21_SHIFT)) & NVIC_IP_PRI21_MASK)
#define NVIC_IP_PRI22_MASK                       (0xF0U)
#define NVIC_IP_PRI22_SHIFT                      (4U)
#define NVIC_IP_PRI22(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI22_SHIFT)) & NVIC_IP_PRI22_MASK)
#define NVIC_IP_PRI23_MASK                       (0xF0U)
#define NVIC_IP_PRI23_SHIFT                      (4U)
#define NVIC_IP_PRI23(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI23_SHIFT)) & NVIC_IP_PRI23_MASK)
#define NVIC_IP_PRI24_MASK                       (0xF0U)
#define NVIC_IP_PRI24_SHIFT                      (4U)
#define NVIC_IP_PRI24(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI24_SHIFT)) & NVIC_IP_PRI24_MASK)
#define NVIC_IP_PRI25_MASK                       (0xF0U)
#define NVIC_IP_PRI25_SHIFT                      (4U)
#define NVIC_IP_PRI25(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI25_SHIFT)) & NVIC_IP_PRI25_MASK)
#define NVIC_IP_PRI26_MASK                       (0xF0U)
#define NVIC_IP_PRI26_SHIFT                      (4U)
#define NVIC_IP_PRI26(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI26_SHIFT)) & NVIC_IP_PRI26_MASK)
#define NVIC_IP_PRI27_MASK                       (0xF0U)
#define NVIC_IP_PRI27_SHIFT                      (4U)
#define NVIC_IP_PRI27(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI27_SHIFT)) & NVIC_IP_PRI27_MASK)
#define NVIC_IP_PRI28_MASK                       (0xF0U)
#define NVIC_IP_PRI28_SHIFT                      (4U)
#define NVIC_IP_PRI28(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI28_SHIFT)) & NVIC_IP_PRI28_MASK)
#define NVIC_IP_PRI29_MASK                       (0xF0U)
#define NVIC_IP_PRI29_SHIFT                      (4U)
#define NVIC_IP_PRI29(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI29_SHIFT)) & NVIC_IP_PRI29_MASK)
#define NVIC_IP_PRI30_MASK                       (0xF0U)
#define NVIC_IP_PRI30_SHIFT                      (4U)
#define NVIC_IP_PRI30(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI30_SHIFT)) & NVIC_IP_PRI30_MASK)
#define NVIC_IP_PRI31_MASK                       (0xF0U)
#define NVIC_IP_PRI31_SHIFT                      (4U)
#define NVIC_IP_PRI31(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI31_SHIFT)) & NVIC_IP_PRI31_MASK)
#define NVIC_IP_PRI32_MASK                       (0xF0U)
#define NVIC_IP_PRI32_SHIFT                      (4U)
#define NVIC_IP_PRI32(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI32_SHIFT)) & NVIC_IP_PRI32_MASK)
#define NVIC_IP_PRI33_MASK                       (0xF0U)
#define NVIC_IP_PRI33_SHIFT                      (4U)
#define NVIC_IP_PRI33(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI33_SHIFT)) & NVIC_IP_PRI33_MASK)
#define NVIC_IP_PRI34_MASK                       (0xF0U)
#define NVIC_IP_PRI34_SHIFT                      (4U)
#define NVIC_IP_PRI34(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI34_SHIFT)) & NVIC_IP_PRI34_MASK)
#define NVIC_IP_PRI35_MASK                       (0xF0U)
#define NVIC_IP_PRI35_SHIFT                      (4U)
#define NVIC_IP_PRI35(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI35_SHIFT)) & NVIC_IP_PRI35_MASK)
#define NVIC_IP_PRI36_MASK                       (0xF0U)
#define NVIC_IP_PRI36_SHIFT                      (4U)
#define NVIC_IP_PRI36(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI36_SHIFT)) & NVIC_IP_PRI36_MASK)
#define NVIC_IP_PRI37_MASK                       (0xF0U)
#define NVIC_IP_PRI37_SHIFT                      (4U)
#define NVIC_IP_PRI37(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI37_SHIFT)) & NVIC_IP_PRI37_MASK)
#define NVIC_IP_PRI38_MASK                       (0xF0U)
#define NVIC_IP_PRI38_SHIFT                      (4U)
#define NVIC_IP_PRI38(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI38_SHIFT)) & NVIC_IP_PRI38_MASK)
#define NVIC_IP_PRI39_MASK                       (0xF0U)
#define NVIC_IP_PRI39_SHIFT                      (4U)
#define NVIC_IP_PRI39(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI39_SHIFT)) & NVIC_IP_PRI39_MASK)
#define NVIC_IP_PRI40_MASK                       (0xF0U)
#define NVIC_IP_PRI40_SHIFT                      (4U)
#define NVIC_IP_PRI40(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI40_SHIFT)) & NVIC_IP_PRI40_MASK)
#define NVIC_IP_PRI41_MASK                       (0xF0U)
#define NVIC_IP_PRI41_SHIFT                      (4U)
#define NVIC_IP_PRI41(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI41_SHIFT)) & NVIC_IP_PRI41_MASK)
#define NVIC_IP_PRI42_MASK                       (0xF0U)
#define NVIC_IP_PRI42_SHIFT                      (4U)
#define NVIC_IP_PRI42(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI42_SHIFT)) & NVIC_IP_PRI42_MASK)
#define NVIC_IP_PRI43_MASK                       (0xF0U)
#define NVIC_IP_PRI43_SHIFT                      (4U)
#define NVIC_IP_PRI43(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI43_SHIFT)) & NVIC_IP_PRI43_MASK)
#define NVIC_IP_PRI44_MASK                       (0xF0U)
#define NVIC_IP_PRI44_SHIFT                      (4U)
#define NVIC_IP_PRI44(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI44_SHIFT)) & NVIC_IP_PRI44_MASK)
#define NVIC_IP_PRI45_MASK                       (0xF0U)
#define NVIC_IP_PRI45_SHIFT                      (4U)
#define NVIC_IP_PRI45(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI45_SHIFT)) & NVIC_IP_PRI45_MASK)
#define NVIC_IP_PRI46_MASK                       (0xF0U)
#define NVIC_IP_PRI46_SHIFT                      (4U)
#define NVIC_IP_PRI46(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI46_SHIFT)) & NVIC_IP_PRI46_MASK)
#define NVIC_IP_PRI47_MASK                       (0xF0U)
#define NVIC_IP_PRI47_SHIFT                      (4U)
#define NVIC_IP_PRI47(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI47_SHIFT)) & NVIC_IP_PRI47_MASK)
#define NVIC_IP_PRI48_MASK                       (0xF0U)
#define NVIC_IP_PRI48_SHIFT                      (4U)
#define NVIC_IP_PRI48(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI48_SHIFT)) & NVIC_IP_PRI48_MASK)
#define NVIC_IP_PRI49_MASK                       (0xF0U)
#define NVIC_IP_PRI49_SHIFT                      (4U)
#define NVIC_IP_PRI49(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI49_SHIFT)) & NVIC_IP_PRI49_MASK)
#define NVIC_IP_PRI50_MASK                       (0xF0U)
#define NVIC_IP_PRI50_SHIFT                      (4U)
#define NVIC_IP_PRI50(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI50_SHIFT)) & NVIC_IP_PRI50_MASK)
#define NVIC_IP_PRI51_MASK                       (0xF0U)
#define NVIC_IP_PRI51_SHIFT                      (4U)
#define NVIC_IP_PRI51(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI51_SHIFT)) & NVIC_IP_PRI51_MASK)
#define NVIC_IP_PRI52_MASK                       (0xF0U)
#define NVIC_IP_PRI52_SHIFT                      (4U)
#define NVIC_IP_PRI52(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI52_SHIFT)) & NVIC_IP_PRI52_MASK)
#define NVIC_IP_PRI53_MASK                       (0xF0U)
#define NVIC_IP_PRI53_SHIFT                      (4U)
#define NVIC_IP_PRI53(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI53_SHIFT)) & NVIC_IP_PRI53_MASK)
#define NVIC_IP_PRI54_MASK                       (0xF0U)
#define NVIC_IP_PRI54_SHIFT                      (4U)
#define NVIC_IP_PRI54(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI54_SHIFT)) & NVIC_IP_PRI54_MASK)
#define NVIC_IP_PRI55_MASK                       (0xF0U)
#define NVIC_IP_PRI55_SHIFT                      (4U)
#define NVIC_IP_PRI55(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI55_SHIFT)) & NVIC_IP_PRI55_MASK)
#define NVIC_IP_PRI56_MASK                       (0xF0U)
#define NVIC_IP_PRI56_SHIFT                      (4U)
#define NVIC_IP_PRI56(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI56_SHIFT)) & NVIC_IP_PRI56_MASK)
#define NVIC_IP_PRI57_MASK                       (0xF0U)
#define NVIC_IP_PRI57_SHIFT                      (4U)
#define NVIC_IP_PRI57(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI57_SHIFT)) & NVIC_IP_PRI57_MASK)
#define NVIC_IP_PRI58_MASK                       (0xF0U)
#define NVIC_IP_PRI58_SHIFT                      (4U)
#define NVIC_IP_PRI58(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI58_SHIFT)) & NVIC_IP_PRI58_MASK)
#define NVIC_IP_PRI59_MASK                       (0xF0U)
#define NVIC_IP_PRI59_SHIFT                      (4U)
#define NVIC_IP_PRI59(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI59_SHIFT)) & NVIC_IP_PRI59_MASK)
#define NVIC_IP_PRI60_MASK                       (0xF0U)
#define NVIC_IP_PRI60_SHIFT                      (4U)
#define NVIC_IP_PRI60(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI60_SHIFT)) & NVIC_IP_PRI60_MASK)
#define NVIC_IP_PRI61_MASK                       (0xF0U)
#define NVIC_IP_PRI61_SHIFT                      (4U)
#define NVIC_IP_PRI61(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI61_SHIFT)) & NVIC_IP_PRI61_MASK)
#define NVIC_IP_PRI62_MASK                       (0xF0U)
#define NVIC_IP_PRI62_SHIFT                      (4U)
#define NVIC_IP_PRI62(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI62_SHIFT)) & NVIC_IP_PRI62_MASK)
#define NVIC_IP_PRI63_MASK                       (0xF0U)
#define NVIC_IP_PRI63_SHIFT                      (4U)
#define NVIC_IP_PRI63(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI63_SHIFT)) & NVIC_IP_PRI63_MASK)
#define NVIC_IP_PRI64_MASK                       (0xF0U)
#define NVIC_IP_PRI64_SHIFT                      (4U)
#define NVIC_IP_PRI64(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI64_SHIFT)) & NVIC_IP_PRI64_MASK)
#define NVIC_IP_PRI65_MASK                       (0xF0U)
#define NVIC_IP_PRI65_SHIFT                      (4U)
#define NVIC_IP_PRI65(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI65_SHIFT)) & NVIC_IP_PRI65_MASK)
#define NVIC_IP_PRI66_MASK                       (0xF0U)
#define NVIC_IP_PRI66_SHIFT                      (4U)
#define NVIC_IP_PRI66(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI66_SHIFT)) & NVIC_IP_PRI66_MASK)
#define NVIC_IP_PRI67_MASK                       (0xF0U)
#define NVIC_IP_PRI67_SHIFT                      (4U)
#define NVIC_IP_PRI67(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI67_SHIFT)) & NVIC_IP_PRI67_MASK)
#define NVIC_IP_PRI68_MASK                       (0xF0U)
#define NVIC_IP_PRI68_SHIFT                      (4U)
#define NVIC_IP_PRI68(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI68_SHIFT)) & NVIC_IP_PRI68_MASK)
#define NVIC_IP_PRI69_MASK                       (0xF0U)
#define NVIC_IP_PRI69_SHIFT                      (4U)
#define NVIC_IP_PRI69(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI69_SHIFT)) & NVIC_IP_PRI69_MASK)
#define NVIC_IP_PRI70_MASK                       (0xF0U)
#define NVIC_IP_PRI70_SHIFT                      (4U)
#define NVIC_IP_PRI70(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI70_SHIFT)) & NVIC_IP_PRI70_MASK)
#define NVIC_IP_PRI71_MASK                       (0xF0U)
#define NVIC_IP_PRI71_SHIFT                      (4U)
#define NVIC_IP_PRI71(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI71_SHIFT)) & NVIC_IP_PRI71_MASK)
#define NVIC_IP_PRI72_MASK                       (0xF0U)
#define NVIC_IP_PRI72_SHIFT                      (4U)
#define NVIC_IP_PRI72(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI72_SHIFT)) & NVIC_IP_PRI72_MASK)
#define NVIC_IP_PRI73_MASK                       (0xF0U)
#define NVIC_IP_PRI73_SHIFT                      (4U)
#define NVIC_IP_PRI73(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI73_SHIFT)) & NVIC_IP_PRI73_MASK)
#define NVIC_IP_PRI74_MASK                       (0xF0U)
#define NVIC_IP_PRI74_SHIFT                      (4U)
#define NVIC_IP_PRI74(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI74_SHIFT)) & NVIC_IP_PRI74_MASK)
#define NVIC_IP_PRI75_MASK                       (0xF0U)
#define NVIC_IP_PRI75_SHIFT                      (4U)
#define NVIC_IP_PRI75(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI75_SHIFT)) & NVIC_IP_PRI75_MASK)
#define NVIC_IP_PRI76_MASK                       (0xF0U)
#define NVIC_IP_PRI76_SHIFT                      (4U)
#define NVIC_IP_PRI76(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI76_SHIFT)) & NVIC_IP_PRI76_MASK)
#define NVIC_IP_PRI77_MASK                       (0xF0U)
#define NVIC_IP_PRI77_SHIFT                      (4U)
#define NVIC_IP_PRI77(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI77_SHIFT)) & NVIC_IP_PRI77_MASK)
#define NVIC_IP_PRI78_MASK                       (0xF0U)
#define NVIC_IP_PRI78_SHIFT                      (4U)
#define NVIC_IP_PRI78(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI78_SHIFT)) & NVIC_IP_PRI78_MASK)
#define NVIC_IP_PRI79_MASK                       (0xF0U)
#define NVIC_IP_PRI79_SHIFT                      (4U)
#define NVIC_IP_PRI79(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI79_SHIFT)) & NVIC_IP_PRI79_MASK)
#define NVIC_IP_PRI80_MASK                       (0xF0U)
#define NVIC_IP_PRI80_SHIFT                      (4U)
#define NVIC_IP_PRI80(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI80_SHIFT)) & NVIC_IP_PRI80_MASK)
#define NVIC_IP_PRI81_MASK                       (0xF0U)
#define NVIC_IP_PRI81_SHIFT                      (4U)
#define NVIC_IP_PRI81(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI81_SHIFT)) & NVIC_IP_PRI81_MASK)
#define NVIC_IP_PRI82_MASK                       (0xF0U)
#define NVIC_IP_PRI82_SHIFT                      (4U)
#define NVIC_IP_PRI82(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI82_SHIFT)) & NVIC_IP_PRI82_MASK)
#define NVIC_IP_PRI83_MASK                       (0xF0U)
#define NVIC_IP_PRI83_SHIFT                      (4U)
#define NVIC_IP_PRI83(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI83_SHIFT)) & NVIC_IP_PRI83_MASK)
#define NVIC_IP_PRI84_MASK                       (0xF0U)
#define NVIC_IP_PRI84_SHIFT                      (4U)
#define NVIC_IP_PRI84(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI84_SHIFT)) & NVIC_IP_PRI84_MASK)
#define NVIC_IP_PRI85_MASK                       (0xF0U)
#define NVIC_IP_PRI85_SHIFT                      (4U)
#define NVIC_IP_PRI85(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI85_SHIFT)) & NVIC_IP_PRI85_MASK)
#define NVIC_IP_PRI86_MASK                       (0xF0U)
#define NVIC_IP_PRI86_SHIFT                      (4U)
#define NVIC_IP_PRI86(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI86_SHIFT)) & NVIC_IP_PRI86_MASK)
#define NVIC_IP_PRI87_MASK                       (0xF0U)
#define NVIC_IP_PRI87_SHIFT                      (4U)
#define NVIC_IP_PRI87(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI87_SHIFT)) & NVIC_IP_PRI87_MASK)
#define NVIC_IP_PRI88_MASK                       (0xF0U)
#define NVIC_IP_PRI88_SHIFT                      (4U)
#define NVIC_IP_PRI88(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI88_SHIFT)) & NVIC_IP_PRI88_MASK)
#define NVIC_IP_PRI89_MASK                       (0xF0U)
#define NVIC_IP_PRI89_SHIFT                      (4U)
#define NVIC_IP_PRI89(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI89_SHIFT)) & NVIC_IP_PRI89_MASK)
#define NVIC_IP_PRI90_MASK                       (0xF0U)
#define NVIC_IP_PRI90_SHIFT                      (4U)
#define NVIC_IP_PRI90(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI90_SHIFT)) & NVIC_IP_PRI90_MASK)
#define NVIC_IP_PRI91_MASK                       (0xF0U)
#define NVIC_IP_PRI91_SHIFT                      (4U)
#define NVIC_IP_PRI91(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI91_SHIFT)) & NVIC_IP_PRI91_MASK)
#define NVIC_IP_PRI92_MASK                       (0xF0U)
#define NVIC_IP_PRI92_SHIFT                      (4U)
#define NVIC_IP_PRI92(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI92_SHIFT)) & NVIC_IP_PRI92_MASK)
#define NVIC_IP_PRI93_MASK                       (0xF0U)
#define NVIC_IP_PRI93_SHIFT                      (4U)
#define NVIC_IP_PRI93(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI93_SHIFT)) & NVIC_IP_PRI93_MASK)
