AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
#define NVIC_IP_PRI94_MASK                       (0xF0U)
#define NVIC_IP_PRI94_SHIFT                      (4U)
#define NVIC_IP_PRI94(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI94_SHIFT)) & NVIC_IP_PRI94_MASK)
#define NVIC_IP_PRI95_MASK                       (0xF0U)
#define NVIC_IP_PRI95_SHIFT                      (4U)
#define NVIC_IP_PRI95(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI95_SHIFT)) & NVIC_IP_PRI95_MASK)
#define NVIC_IP_PRI96_MASK                       (0xF0U)
#define NVIC_IP_PRI96_SHIFT                      (4U)
#define NVIC_IP_PRI96(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI96_SHIFT)) & NVIC_IP_PRI96_MASK)
#define NVIC_IP_PRI97_MASK                       (0xF0U)
#define NVIC_IP_PRI97_SHIFT                      (4U)
#define NVIC_IP_PRI97(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI97_SHIFT)) & NVIC_IP_PRI97_MASK)
#define NVIC_IP_PRI98_MASK                       (0xF0U)
#define NVIC_IP_PRI98_SHIFT                      (4U)
#define NVIC_IP_PRI98(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI98_SHIFT)) & NVIC_IP_PRI98_MASK)
#define NVIC_IP_PRI99_MASK                       (0xF0U)
#define NVIC_IP_PRI99_SHIFT                      (4U)
#define NVIC_IP_PRI99(x)                         (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI99_SHIFT)) & NVIC_IP_PRI99_MASK)
#define NVIC_IP_PRI100_MASK                      (0xF0U)
#define NVIC_IP_PRI100_SHIFT                     (4U)
#define NVIC_IP_PRI100(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI100_SHIFT)) & NVIC_IP_PRI100_MASK)
#define NVIC_IP_PRI101_MASK                      (0xF0U)
#define NVIC_IP_PRI101_SHIFT                     (4U)
#define NVIC_IP_PRI101(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI101_SHIFT)) & NVIC_IP_PRI101_MASK)
#define NVIC_IP_PRI102_MASK                      (0xF0U)
#define NVIC_IP_PRI102_SHIFT                     (4U)
#define NVIC_IP_PRI102(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI102_SHIFT)) & NVIC_IP_PRI102_MASK)
#define NVIC_IP_PRI103_MASK                      (0xF0U)
#define NVIC_IP_PRI103_SHIFT                     (4U)
#define NVIC_IP_PRI103(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI103_SHIFT)) & NVIC_IP_PRI103_MASK)
#define NVIC_IP_PRI104_MASK                      (0xF0U)
#define NVIC_IP_PRI104_SHIFT                     (4U)
#define NVIC_IP_PRI104(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI104_SHIFT)) & NVIC_IP_PRI104_MASK)
#define NVIC_IP_PRI105_MASK                      (0xF0U)
#define NVIC_IP_PRI105_SHIFT                     (4U)
#define NVIC_IP_PRI105(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI105_SHIFT)) & NVIC_IP_PRI105_MASK)
#define NVIC_IP_PRI106_MASK                      (0xF0U)
#define NVIC_IP_PRI106_SHIFT                     (4U)
#define NVIC_IP_PRI106(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI106_SHIFT)) & NVIC_IP_PRI106_MASK)
#define NVIC_IP_PRI107_MASK                      (0xF0U)
#define NVIC_IP_PRI107_SHIFT                     (4U)
#define NVIC_IP_PRI107(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI107_SHIFT)) & NVIC_IP_PRI107_MASK)
#define NVIC_IP_PRI108_MASK                      (0xF0U)
#define NVIC_IP_PRI108_SHIFT                     (4U)
#define NVIC_IP_PRI108(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI108_SHIFT)) & NVIC_IP_PRI108_MASK)
#define NVIC_IP_PRI109_MASK                      (0xF0U)
#define NVIC_IP_PRI109_SHIFT                     (4U)
#define NVIC_IP_PRI109(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI109_SHIFT)) & NVIC_IP_PRI109_MASK)
#define NVIC_IP_PRI110_MASK                      (0xF0U)
#define NVIC_IP_PRI110_SHIFT                     (4U)
#define NVIC_IP_PRI110(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI110_SHIFT)) & NVIC_IP_PRI110_MASK)
#define NVIC_IP_PRI111_MASK                      (0xF0U)
#define NVIC_IP_PRI111_SHIFT                     (4U)
#define NVIC_IP_PRI111(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI111_SHIFT)) & NVIC_IP_PRI111_MASK)
#define NVIC_IP_PRI112_MASK                      (0xF0U)
#define NVIC_IP_PRI112_SHIFT                     (4U)
#define NVIC_IP_PRI112(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI112_SHIFT)) & NVIC_IP_PRI112_MASK)
#define NVIC_IP_PRI113_MASK                      (0xF0U)
#define NVIC_IP_PRI113_SHIFT                     (4U)
#define NVIC_IP_PRI113(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI113_SHIFT)) & NVIC_IP_PRI113_MASK)
#define NVIC_IP_PRI114_MASK                      (0xF0U)
#define NVIC_IP_PRI114_SHIFT                     (4U)
#define NVIC_IP_PRI114(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI114_SHIFT)) & NVIC_IP_PRI114_MASK)
#define NVIC_IP_PRI115_MASK                      (0xF0U)
#define NVIC_IP_PRI115_SHIFT                     (4U)
#define NVIC_IP_PRI115(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI115_SHIFT)) & NVIC_IP_PRI115_MASK)
#define NVIC_IP_PRI116_MASK                      (0xF0U)
#define NVIC_IP_PRI116_SHIFT                     (4U)
#define NVIC_IP_PRI116(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI116_SHIFT)) & NVIC_IP_PRI116_MASK)
#define NVIC_IP_PRI117_MASK                      (0xF0U)
#define NVIC_IP_PRI117_SHIFT                     (4U)
#define NVIC_IP_PRI117(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI117_SHIFT)) & NVIC_IP_PRI117_MASK)
#define NVIC_IP_PRI118_MASK                      (0xF0U)
#define NVIC_IP_PRI118_SHIFT                     (4U)
#define NVIC_IP_PRI118(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI118_SHIFT)) & NVIC_IP_PRI118_MASK)
#define NVIC_IP_PRI119_MASK                      (0xF0U)
#define NVIC_IP_PRI119_SHIFT                     (4U)
#define NVIC_IP_PRI119(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI119_SHIFT)) & NVIC_IP_PRI119_MASK)
#define NVIC_IP_PRI120_MASK                      (0xF0U)
#define NVIC_IP_PRI120_SHIFT                     (4U)
#define NVIC_IP_PRI120(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI120_SHIFT)) & NVIC_IP_PRI120_MASK)
#define NVIC_IP_PRI121_MASK                      (0xF0U)
#define NVIC_IP_PRI121_SHIFT                     (4U)
#define NVIC_IP_PRI121(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI121_SHIFT)) & NVIC_IP_PRI121_MASK)
#define NVIC_IP_PRI122_MASK                      (0xF0U)
#define NVIC_IP_PRI122_SHIFT                     (4U)
#define NVIC_IP_PRI122(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI122_SHIFT)) & NVIC_IP_PRI122_MASK)
#define NVIC_IP_PRI123_MASK                      (0xF0U)
#define NVIC_IP_PRI123_SHIFT                     (4U)
#define NVIC_IP_PRI123(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI123_SHIFT)) & NVIC_IP_PRI123_MASK)
#define NVIC_IP_PRI124_MASK                      (0xF0U)
#define NVIC_IP_PRI124_SHIFT                     (4U)
#define NVIC_IP_PRI124(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI124_SHIFT)) & NVIC_IP_PRI124_MASK)
#define NVIC_IP_PRI125_MASK                      (0xF0U)
#define NVIC_IP_PRI125_SHIFT                     (4U)
#define NVIC_IP_PRI125(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI125_SHIFT)) & NVIC_IP_PRI125_MASK)
#define NVIC_IP_PRI126_MASK                      (0xF0U)
#define NVIC_IP_PRI126_SHIFT                     (4U)
#define NVIC_IP_PRI126(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI126_SHIFT)) & NVIC_IP_PRI126_MASK)
#define NVIC_IP_PRI127_MASK                      (0xF0U)
#define NVIC_IP_PRI127_SHIFT                     (4U)
#define NVIC_IP_PRI127(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI127_SHIFT)) & NVIC_IP_PRI127_MASK)
#define NVIC_IP_PRI128_MASK                      (0xF0U)
#define NVIC_IP_PRI128_SHIFT                     (4U)
#define NVIC_IP_PRI128(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI128_SHIFT)) & NVIC_IP_PRI128_MASK)
#define NVIC_IP_PRI129_MASK                      (0xF0U)
#define NVIC_IP_PRI129_SHIFT                     (4U)
#define NVIC_IP_PRI129(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI129_SHIFT)) & NVIC_IP_PRI129_MASK)
#define NVIC_IP_PRI130_MASK                      (0xF0U)
#define NVIC_IP_PRI130_SHIFT                     (4U)
#define NVIC_IP_PRI130(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI130_SHIFT)) & NVIC_IP_PRI130_MASK)
#define NVIC_IP_PRI131_MASK                      (0xF0U)
#define NVIC_IP_PRI131_SHIFT                     (4U)
#define NVIC_IP_PRI131(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI131_SHIFT)) & NVIC_IP_PRI131_MASK)
#define NVIC_IP_PRI132_MASK                      (0xF0U)
#define NVIC_IP_PRI132_SHIFT                     (4U)
#define NVIC_IP_PRI132(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI132_SHIFT)) & NVIC_IP_PRI132_MASK)
#define NVIC_IP_PRI133_MASK                      (0xF0U)
#define NVIC_IP_PRI133_SHIFT                     (4U)
#define NVIC_IP_PRI133(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI133_SHIFT)) & NVIC_IP_PRI133_MASK)
#define NVIC_IP_PRI134_MASK                      (0xF0U)
#define NVIC_IP_PRI134_SHIFT                     (4U)
#define NVIC_IP_PRI134(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI134_SHIFT)) & NVIC_IP_PRI134_MASK)
#define NVIC_IP_PRI135_MASK                      (0xF0U)
#define NVIC_IP_PRI135_SHIFT                     (4U)
#define NVIC_IP_PRI135(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI135_SHIFT)) & NVIC_IP_PRI135_MASK)
#define NVIC_IP_PRI136_MASK                      (0xF0U)
#define NVIC_IP_PRI136_SHIFT                     (4U)
#define NVIC_IP_PRI136(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI136_SHIFT)) & NVIC_IP_PRI136_MASK)
#define NVIC_IP_PRI137_MASK                      (0xF0U)
#define NVIC_IP_PRI137_SHIFT                     (4U)
#define NVIC_IP_PRI137(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI137_SHIFT)) & NVIC_IP_PRI137_MASK)
#define NVIC_IP_PRI138_MASK                      (0xF0U)
#define NVIC_IP_PRI138_SHIFT                     (4U)
#define NVIC_IP_PRI138(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI138_SHIFT)) & NVIC_IP_PRI138_MASK)
#define NVIC_IP_PRI139_MASK                      (0xF0U)
#define NVIC_IP_PRI139_SHIFT                     (4U)
#define NVIC_IP_PRI139(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI139_SHIFT)) & NVIC_IP_PRI139_MASK)
#define NVIC_IP_PRI140_MASK                      (0xF0U)
#define NVIC_IP_PRI140_SHIFT                     (4U)
#define NVIC_IP_PRI140(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI140_SHIFT)) & NVIC_IP_PRI140_MASK)
#define NVIC_IP_PRI141_MASK                      (0xF0U)
#define NVIC_IP_PRI141_SHIFT                     (4U)
#define NVIC_IP_PRI141(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI141_SHIFT)) & NVIC_IP_PRI141_MASK)
#define NVIC_IP_PRI142_MASK                      (0xF0U)
#define NVIC_IP_PRI142_SHIFT                     (4U)
#define NVIC_IP_PRI142(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI142_SHIFT)) & NVIC_IP_PRI142_MASK)
#define NVIC_IP_PRI143_MASK                      (0xF0U)
#define NVIC_IP_PRI143_SHIFT                     (4U)
#define NVIC_IP_PRI143(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI143_SHIFT)) & NVIC_IP_PRI143_MASK)
#define NVIC_IP_PRI144_MASK                      (0xF0U)
#define NVIC_IP_PRI144_SHIFT                     (4U)
#define NVIC_IP_PRI144(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI144_SHIFT)) & NVIC_IP_PRI144_MASK)
#define NVIC_IP_PRI145_MASK                      (0xF0U)
#define NVIC_IP_PRI145_SHIFT                     (4U)
#define NVIC_IP_PRI145(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI145_SHIFT)) & NVIC_IP_PRI145_MASK)
#define NVIC_IP_PRI146_MASK                      (0xF0U)
#define NVIC_IP_PRI146_SHIFT                     (4U)
#define NVIC_IP_PRI146(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI146_SHIFT)) & NVIC_IP_PRI146_MASK)
#define NVIC_IP_PRI147_MASK                      (0xF0U)
#define NVIC_IP_PRI147_SHIFT                     (4U)
#define NVIC_IP_PRI147(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI147_SHIFT)) & NVIC_IP_PRI147_MASK)
#define NVIC_IP_PRI148_MASK                      (0xF0U)
#define NVIC_IP_PRI148_SHIFT                     (4U)
#define NVIC_IP_PRI148(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI148_SHIFT)) & NVIC_IP_PRI148_MASK)
#define NVIC_IP_PRI149_MASK                      (0xF0U)
#define NVIC_IP_PRI149_SHIFT                     (4U)
#define NVIC_IP_PRI149(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI149_SHIFT)) & NVIC_IP_PRI149_MASK)
#define NVIC_IP_PRI150_MASK                      (0xF0U)
#define NVIC_IP_PRI150_SHIFT                     (4U)
#define NVIC_IP_PRI150(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI150_SHIFT)) & NVIC_IP_PRI150_MASK)
#define NVIC_IP_PRI151_MASK                      (0xF0U)
#define NVIC_IP_PRI151_SHIFT                     (4U)
#define NVIC_IP_PRI151(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI151_SHIFT)) & NVIC_IP_PRI151_MASK)
#define NVIC_IP_PRI152_MASK                      (0xF0U)
#define NVIC_IP_PRI152_SHIFT                     (4U)
#define NVIC_IP_PRI152(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI152_SHIFT)) & NVIC_IP_PRI152_MASK)
#define NVIC_IP_PRI153_MASK                      (0xF0U)
#define NVIC_IP_PRI153_SHIFT                     (4U)
#define NVIC_IP_PRI153(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI153_SHIFT)) & NVIC_IP_PRI153_MASK)
#define NVIC_IP_PRI154_MASK                      (0xF0U)
#define NVIC_IP_PRI154_SHIFT                     (4U)
#define NVIC_IP_PRI154(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI154_SHIFT)) & NVIC_IP_PRI154_MASK)
#define NVIC_IP_PRI155_MASK                      (0xF0U)
#define NVIC_IP_PRI155_SHIFT                     (4U)
#define NVIC_IP_PRI155(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI155_SHIFT)) & NVIC_IP_PRI155_MASK)
#define NVIC_IP_PRI156_MASK                      (0xF0U)
#define NVIC_IP_PRI156_SHIFT                     (4U)
#define NVIC_IP_PRI156(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI156_SHIFT)) & NVIC_IP_PRI156_MASK)
#define NVIC_IP_PRI157_MASK                      (0xF0U)
#define NVIC_IP_PRI157_SHIFT                     (4U)
#define NVIC_IP_PRI157(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI157_SHIFT)) & NVIC_IP_PRI157_MASK)
#define NVIC_IP_PRI158_MASK                      (0xF0U)
#define NVIC_IP_PRI158_SHIFT                     (4U)
#define NVIC_IP_PRI158(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI158_SHIFT)) & NVIC_IP_PRI158_MASK)
#define NVIC_IP_PRI159_MASK                      (0xF0U)
#define NVIC_IP_PRI159_SHIFT                     (4U)
#define NVIC_IP_PRI159(x)                        (((uint8_t)(((uint8_t)(x)) << NVIC_IP_PRI159_SHIFT)) & NVIC_IP_PRI159_MASK)

