AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* The count of NVIC_IP */
#define NVIC_IP_COUNT                            (160U)

/*! @name STIR - Software Trigger Interrupt Register */
#define NVIC_STIR_INTID_MASK                     (0x1FFU)
#define NVIC_STIR_INTID_SHIFT                    (0U)
#define NVIC_STIR_INTID(x)                       (((uint32_t)(((uint32_t)(x)) << NVIC_STIR_INTID_SHIFT)) & NVIC_STIR_INTID_MASK)

/* The count of NVIC_STIR */
#define NVIC_STIR_COUNT                          (1U)


/*!
 * @}
 */ /* end of group NVIC_Register_Masks */


/* NVIC - Peripheral instance base addresses */
/** Peripheral NVIC base pointer */
#define NVIC_BASE_PTR                            ((NVIC_MemMapPtr)0xE000E100u)
/** Array initializer of NVIC peripheral base pointers */
#define NVIC_BASE_PTRS                           { NVIC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- NVIC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Register_Accessor_Macros NVIC - Register accessor macros
 * @{
 */


/* NVIC - Register instance definitions */
/* NVIC */
#define NVICISER0                                NVIC_ISER_REG(NVIC_BASE_PTR,0)
#define NVICISER1                                NVIC_ISER_REG(NVIC_BASE_PTR,1)
#define NVICISER2                                NVIC_ISER_REG(NVIC_BASE_PTR,2)
#define NVICISER3                                NVIC_ISER_REG(NVIC_BASE_PTR,3)
#define NVICISER4                                NVIC_ISER_REG(NVIC_BASE_PTR,4)
#define NVICICER0                                NVIC_ICER_REG(NVIC_BASE_PTR,0)
#define NVICICER1                                NVIC_ICER_REG(NVIC_BASE_PTR,1)
#define NVICICER2                                NVIC_ICER_REG(NVIC_BASE_PTR,2)
#define NVICICER3                                NVIC_ICER_REG(NVIC_BASE_PTR,3)
#define NVICICER4                                NVIC_ICER_REG(NVIC_BASE_PTR,4)
#define NVICISPR0                                NVIC_ISPR_REG(NVIC_BASE_PTR,0)
#define NVICISPR1                                NVIC_ISPR_REG(NVIC_BASE_PTR,1)
#define NVICISPR2                                NVIC_ISPR_REG(NVIC_BASE_PTR,2)
#define NVICISPR3                                NVIC_ISPR_REG(NVIC_BASE_PTR,3)
#define NVICISPR4                                NVIC_ISPR_REG(NVIC_BASE_PTR,4)
#define NVICICPR0                                NVIC_ICPR_REG(NVIC_BASE_PTR,0)
#define NVICICPR1                                NVIC_ICPR_REG(NVIC_BASE_PTR,1)
#define NVICICPR2                                NVIC_ICPR_REG(NVIC_BASE_PTR,2)
#define NVICICPR3                                NVIC_ICPR_REG(NVIC_BASE_PTR,3)
#define NVICICPR4                                NVIC_ICPR_REG(NVIC_BASE_PTR,4)
#define NVICIABR0                                NVIC_IABR_REG(NVIC_BASE_PTR,0)
#define NVICIABR1                                NVIC_IABR_REG(NVIC_BASE_PTR,1)
#define NVICIABR2                                NVIC_IABR_REG(NVIC_BASE_PTR,2)
#define NVICIABR3                                NVIC_IABR_REG(NVIC_BASE_PTR,3)
#define NVICIABR4                                NVIC_IABR_REG(NVIC_BASE_PTR,4)
#define NVICIP0                                  NVIC_IP_REG(NVIC_BASE_PTR,0)
#define NVICIP1                                  NVIC_IP_REG(NVIC_BASE_PTR,1)
#define NVICIP2                                  NVIC_IP_REG(NVIC_BASE_PTR,2)
#define NVICIP3                                  NVIC_IP_REG(NVIC_BASE_PTR,3)
#define NVICIP4                                  NVIC_IP_REG(NVIC_BASE_PTR,4)
#define NVICIP5                                  NVIC_IP_REG(NVIC_BASE_PTR,5)
#define NVICIP6                                  NVIC_IP_REG(NVIC_BASE_PTR,6)
#define NVICIP7                                  NVIC_IP_REG(NVIC_BASE_PTR,7)
#define NVICIP8                                  NVIC_IP_REG(NVIC_BASE_PTR,8)
#define NVICIP9                                  NVIC_IP_REG(NVIC_BASE_PTR,9)
#define NVICIP10                                 NVIC_IP_REG(NVIC_BASE_PTR,10)
#define NVICIP11                                 NVIC_IP_REG(NVIC_BASE_PTR,11)
#define NVICIP12                                 NVIC_IP_REG(NVIC_BASE_PTR,12)
#define NVICIP13                                 NVIC_IP_REG(NVIC_BASE_PTR,13)
#define NVICIP14                                 NVIC_IP_REG(NVIC_BASE_PTR,14)
#define NVICIP15                                 NVIC_IP_REG(NVIC_BASE_PTR,15)
#define NVICIP16                                 NVIC_IP_REG(NVIC_BASE_PTR,16)
#define NVICIP17                                 NVIC_IP_REG(NVIC_BASE_PTR,17)
#define NVICIP18                                 NVIC_IP_REG(NVIC_BASE_PTR,18)
#define NVICIP19                                 NVIC_IP_REG(NVIC_BASE_PTR,19)
#define NVICIP20                                 NVIC_IP_REG(NVIC_BASE_PTR,20)
#define NVICIP21                                 NVIC_IP_REG(NVIC_BASE_PTR,21)
#define NVICIP22                                 NVIC_IP_REG(NVIC_BASE_PTR,22)
#define NVICIP23                                 NVIC_IP_REG(NVIC_BASE_PTR,23)
#define NVICIP24                                 NVIC_IP_REG(NVIC_BASE_PTR,24)
#define NVICIP25                                 NVIC_IP_REG(NVIC_BASE_PTR,25)
#define NVICIP26                                 NVIC_IP_REG(NVIC_BASE_PTR,26)
#define NVICIP27                                 NVIC_IP_REG(NVIC_BASE_PTR,27)
#define NVICIP28                                 NVIC_IP_REG(NVIC_BASE_PTR,28)
#define NVICIP29                                 NVIC_IP_REG(NVIC_BASE_PTR,29)
#define NVICIP30                                 NVIC_IP_REG(NVIC_BASE_PTR,30)
#define NVICIP31                                 NVIC_IP_REG(NVIC_BASE_PTR,31)
#define NVICIP32                                 NVIC_IP_REG(NVIC_BASE_PTR,32)
#define NVICIP33                                 NVIC_IP_REG(NVIC_BASE_PTR,33)
#define NVICIP34                                 NVIC_IP_REG(NVIC_BASE_PTR,34)
#define NVICIP35                                 NVIC_IP_REG(NVIC_BASE_PTR,35)
#define NVICIP36                                 NVIC_IP_REG(NVIC_BASE_PTR,36)
#define NVICIP37                                 NVIC_IP_REG(NVIC_BASE_PTR,37)
#define NVICIP38                                 NVIC_IP_REG(NVIC_BASE_PTR,38)
#define NVICIP39                                 NVIC_IP_REG(NVIC_BASE_PTR,39)
#define NVICIP40                                 NVIC_IP_REG(NVIC_BASE_PTR,40)
#define NVICIP41                                 NVIC_IP_REG(NVIC_BASE_PTR,41)
#define NVICIP42                                 NVIC_IP_REG(NVIC_BASE_PTR,42)
#define NVICIP43                                 NVIC_IP_REG(NVIC_BASE_PTR,43)
#define NVICIP44                                 NVIC_IP_REG(NVIC_BASE_PTR,44)
#define NVICIP45                                 NVIC_IP_REG(NVIC_BASE_PTR,45)
#define NVICIP46                                 NVIC_IP_REG(NVIC_BASE_PTR,46)
#define NVICIP47                                 NVIC_IP_REG(NVIC_BASE_PTR,47)
#define NVICIP48                                 NVIC_IP_REG(NVIC_BASE_PTR,48)
#define NVICIP49                                 NVIC_IP_REG(NVIC_BASE_PTR,49)
#define NVICIP50                                 NVIC_IP_REG(NVIC_BASE_PTR,50)
#define NVICIP51                                 NVIC_IP_REG(NVIC_BASE_PTR,51)
#define NVICIP52                                 NVIC_IP_REG(NVIC_BASE_PTR,52)
#define NVICIP53                                 NVIC_IP_REG(NVIC_BASE_PTR,53)
#define NVICIP54                                 NVIC_IP_REG(NVIC_BASE_PTR,54)
#define NVICIP55                                 NVIC_IP_REG(NVIC_BASE_PTR,55)
#define NVICIP56                                 NVIC_IP_REG(NVIC_BASE_PTR,56)
#define NVICIP57                                 NVIC_IP_REG(NVIC_BASE_PTR,57)
#define NVICIP58                                 NVIC_IP_REG(NVIC_BASE_PTR,58)
#define NVICIP59                                 NVIC_IP_REG(NVIC_BASE_PTR,59)
#define NVICIP60                                 NVIC_IP_REG(NVIC_BASE_PTR,60)
#define NVICIP61                                 NVIC_IP_REG(NVIC_BASE_PTR,61)
#define NVICIP62                                 NVIC_IP_REG(NVIC_BASE_PTR,62)
#define NVICIP63                                 NVIC_IP_REG(NVIC_BASE_PTR,63)
#define NVICIP64                                 NVIC_IP_REG(NVIC_BASE_PTR,64)
#define NVICIP65                                 NVIC_IP_REG(NVIC_BASE_PTR,65)
#define NVICIP66                                 NVIC_IP_REG(NVIC_BASE_PTR,66)
#define NVICIP67                                 NVIC_IP_REG(NVIC_BASE_PTR,67)
#define NVICIP68                                 NVIC_IP_REG(NVIC_BASE_PTR,68)
#define NVICIP69                                 NVIC_IP_REG(NVIC_BASE_PTR,69)
#define NVICIP70                                 NVIC_IP_REG(NVIC_BASE_PTR,70)
#define NVICIP71                                 NVIC_IP_REG(NVIC_BASE_PTR,71)
#define NVICIP72                                 NVIC_IP_REG(NVIC_BASE_PTR,72)
#define NVICIP73                                 NVIC_IP_REG(NVIC_BASE_PTR,73)
#define NVICIP74                                 NVIC_IP_REG(NVIC_BASE_PTR,74)
#define NVICIP75                                 NVIC_IP_REG(NVIC_BASE_PTR,75)
#define NVICIP76                                 NVIC_IP_REG(NVIC_BASE_PTR,76)
#define NVICIP77                                 NVIC_IP_REG(NVIC_BASE_PTR,77)
#define NVICIP78                                 NVIC_IP_REG(NVIC_BASE_PTR,78)
#define NVICIP79                                 NVIC_IP_REG(NVIC_BASE_PTR,79)
#define NVICIP80                                 NVIC_IP_REG(NVIC_BASE_PTR,80)
#define NVICIP81                                 NVIC_IP_REG(NVIC_BASE_PTR,81)
#define NVICIP82                                 NVIC_IP_REG(NVIC_BASE_PTR,82)
#define NVICIP83                                 NVIC_IP_REG(NVIC_BASE_PTR,83)
#define NVICIP84                                 NVIC_IP_REG(NVIC_BASE_PTR,84)
#define NVICIP85                                 NVIC_IP_REG(NVIC_BASE_PTR,85)
#define NVICIP86                                 NVIC_IP_REG(NVIC_BASE_PTR,86)
#define NVICIP87                                 NVIC_IP_REG(NVIC_BASE_PTR,87)
#define NVICIP88                                 NVIC_IP_REG(NVIC_BASE_PTR,88)
#define NVICIP89                                 NVIC_IP_REG(NVIC_BASE_PTR,89)
#define NVICIP90                                 NVIC_IP_REG(NVIC_BASE_PTR,90)
#define NVICIP91                                 NVIC_IP_REG(NVIC_BASE_PTR,91)
#define NVICIP92                                 NVIC_IP_REG(NVIC_BASE_PTR,92)
#define NVICIP93                                 NVIC_IP_REG(NVIC_BASE_PTR,93)
#define NVICIP94                                 NVIC_IP_REG(NVIC_BASE_PTR,94)
#define NVICIP95                                 NVIC_IP_REG(NVIC_BASE_PTR,95)
#define NVICIP96                                 NVIC_IP_REG(NVIC_BASE_PTR,96)
#define NVICIP97                                 NVIC_IP_REG(NVIC_BASE_PTR,97)
#define NVICIP98                                 NVIC_IP_REG(NVIC_BASE_PTR,98)
#define NVICIP99                                 NVIC_IP_REG(NVIC_BASE_PTR,99)
#define NVICIP100                                NVIC_IP_REG(NVIC_BASE_PTR,100)
#define NVICIP101                                NVIC_IP_REG(NVIC_BASE_PTR,101)
#define NVICIP102                                NVIC_IP_REG(NVIC_BASE_PTR,102)
#define NVICIP103                                NVIC_IP_REG(NVIC_BASE_PTR,103)
#define NVICIP104                                NVIC_IP_REG(NVIC_BASE_PTR,104)
#define NVICIP105                                NVIC_IP_REG(NVIC_BASE_PTR,105)
#define NVICIP106                                NVIC_IP_REG(NVIC_BASE_PTR,106)
#define NVICIP107                                NVIC_IP_REG(NVIC_BASE_PTR,107)
#define NVICIP108                                NVIC_IP_REG(NVIC_BASE_PTR,108)
#define NVICIP109                                NVIC_IP_REG(NVIC_BASE_PTR,109)
#define NVICIP110                                NVIC_IP_REG(NVIC_BASE_PTR,110)
#define NVICIP111                                NVIC_IP_REG(NVIC_BASE_PTR,111)
#define NVICIP112                                NVIC_IP_REG(NVIC_BASE_PTR,112)
#define NVICIP113                                NVIC_IP_REG(NVIC_BASE_PTR,113)
#define NVICIP114                                NVIC_IP_REG(NVIC_BASE_PTR,114)
#define NVICIP115                                NVIC_IP_REG(NVIC_BASE_PTR,115)
#define NVICIP116                                NVIC_IP_REG(NVIC_BASE_PTR,116)
#define NVICIP117                                NVIC_IP_REG(NVIC_BASE_PTR,117)
#define NVICIP118                                NVIC_IP_REG(NVIC_BASE_PTR,118)
#define NVICIP119                                NVIC_IP_REG(NVIC_BASE_PTR,119)
#define NVICIP120                                NVIC_IP_REG(NVIC_BASE_PTR,120)
#define NVICIP121                                NVIC_IP_REG(NVIC_BASE_PTR,121)
#define NVICIP122                                NVIC_IP_REG(NVIC_BASE_PTR,122)
#define NVICIP123                                NVIC_IP_REG(NVIC_BASE_PTR,123)
#define NVICIP124                                NVIC_IP_REG(NVIC_BASE_PTR,124)
#define NVICIP125                                NVIC_IP_REG(NVIC_BASE_PTR,125)
#define NVICIP126                                NVIC_IP_REG(NVIC_BASE_PTR,126)
#define NVICIP127                                NVIC_IP_REG(NVIC_BASE_PTR,127)
#define NVICIP128                                NVIC_IP_REG(NVIC_BASE_PTR,128)
#define NVICIP129                                NVIC_IP_REG(NVIC_BASE_PTR,129)
#define NVICIP130                                NVIC_IP_REG(NVIC_BASE_PTR,130)
#define NVICIP131                                NVIC_IP_REG(NVIC_BASE_PTR,131)
#define NVICIP132                                NVIC_IP_REG(NVIC_BASE_PTR,132)
#define NVICIP133                                NVIC_IP_REG(NVIC_BASE_PTR,133)
#define NVICIP134                                NVIC_IP_REG(NVIC_BASE_PTR,134)
#define NVICIP135                                NVIC_IP_REG(NVIC_BASE_PTR,135)
#define NVICIP136                                NVIC_IP_REG(NVIC_BASE_PTR,136)
#define NVICIP137                                NVIC_IP_REG(NVIC_BASE_PTR,137)
#define NVICIP138                                NVIC_IP_REG(NVIC_BASE_PTR,138)
#define NVICIP139                                NVIC_IP_REG(NVIC_BASE_PTR,139)
#define NVICIP140                                NVIC_IP_REG(NVIC_BASE_PTR,140)
#define NVICIP141                                NVIC_IP_REG(NVIC_BASE_PTR,141)
#define NVICIP142                                NVIC_IP_REG(NVIC_BASE_PTR,142)
#define NVICIP143                                NVIC_IP_REG(NVIC_BASE_PTR,143)
#define NVICIP144                                NVIC_IP_REG(NVIC_BASE_PTR,144)
#define NVICIP145                                NVIC_IP_REG(NVIC_BASE_PTR,145)
#define NVICIP146                                NVIC_IP_REG(NVIC_BASE_PTR,146)
#define NVICIP147                                NVIC_IP_REG(NVIC_BASE_PTR,147)
#define NVICIP148                                NVIC_IP_REG(NVIC_BASE_PTR,148)
#define NVICIP149                                NVIC_IP_REG(NVIC_BASE_PTR,149)
#define NVICIP150                                NVIC_IP_REG(NVIC_BASE_PTR,150)
#define NVICIP151                                NVIC_IP_REG(NVIC_BASE_PTR,151)
#define NVICIP152                                NVIC_IP_REG(NVIC_BASE_PTR,152)
#define NVICIP153                                NVIC_IP_REG(NVIC_BASE_PTR,153)
#define NVICIP154                                NVIC_IP_REG(NVIC_BASE_PTR,154)
#define NVICIP155                                NVIC_IP_REG(NVIC_BASE_PTR,155)
#define NVICIP156                                NVIC_IP_REG(NVIC_BASE_PTR,156)
#define NVICIP157                                NVIC_IP_REG(NVIC_BASE_PTR,157)
#define NVICIP158                                NVIC_IP_REG(NVIC_BASE_PTR,158)
#define NVICIP159                                NVIC_IP_REG(NVIC_BASE_PTR,159)
#define NVICSTIR                                 NVIC_STIR_REG(NVIC_BASE_PTR,0)

/* NVIC - Register array accessors */
#define NVIC_ISER(index)                         NVIC_ISER_REG(NVIC_BASE_PTR,index)
#define NVIC_ICER(index)                         NVIC_ICER_REG(NVIC_BASE_PTR,index)
#define NVIC_ISPR(index)                         NVIC_ISPR_REG(NVIC_BASE_PTR,index)
#define NVIC_ICPR(index)                         NVIC_ICPR_REG(NVIC_BASE_PTR,index)
#define NVIC_IABR(index)                         NVIC_IABR_REG(NVIC_BASE_PTR,index)
#define NVIC_IP(index)                           NVIC_IP_REG(NVIC_BASE_PTR,index)

/*!
 * @}
 */ /* end of group NVIC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group NVIC_Peripheral */


/* ----------------------------------------------------------------------------
   -- OCOTP
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OCOTP_Peripheral OCOTP
 * @{
 */

