AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/** OCOTP - Peripheral register structure */
typedef struct OCOTP_MemMap {
  uint32_t CTRL;                                   /**< OTP Controller Control Register, offset: 0x0 */
  uint32_t CTRL_SET;                               /**< OTP Controller Control Register, offset: 0x4 */
  uint32_t CTRL_CLR;                               /**< OTP Controller Control Register, offset: 0x8 */
  uint32_t CTRL_TOG;                               /**< OTP Controller Control Register, offset: 0xC */
  uint32_t TIMING;                                 /**< OTP Controller Timing Register, offset: 0x10 */
  uint8_t RESERVED_0[12];
  uint32_t DATA;                                   /**< OTP Controller Write Data Register, offset: 0x20 */
  uint8_t RESERVED_1[12];
  uint32_t READ_CTRL;                              /**< OTP Controller Write Data Register, offset: 0x30 */
  uint8_t RESERVED_2[12];
  uint32_t READ_FUSE_DATA;                         /**< OTP Controller Read Data Register, offset: 0x40 */
  uint8_t RESERVED_3[12];
  uint32_t SW_STICKY;                              /**< Sticky bit Register, offset: 0x50 */
  uint8_t RESERVED_4[12];
  uint32_t SCS;                                    /**< Software Controllable Signals Register, offset: 0x60 */
  uint32_t SCS_SET;                                /**< Software Controllable Signals Register, offset: 0x64 */
  uint32_t SCS_CLR;                                /**< Software Controllable Signals Register, offset: 0x68 */
  uint32_t SCS_TOG;                                /**< Software Controllable Signals Register, offset: 0x6C */
  uint8_t RESERVED_5[32];
  uint32_t VERSION;                                /**< OTP Controller Version Register, offset: 0x90 */
  uint8_t RESERVED_6[108];
  uint32_t TIMING2;                                /**< OTP Controller Timing Register 2, offset: 0x100 */
  uint8_t RESERVED_7[764];
  uint32_t LOCK;                                   /**< Value of OTP Bank0 Word0 (Lock controls), offset: 0x400 */
  uint8_t RESERVED_8[12];
  uint32_t CFG0;                                   /**< Value of OTP Bank0 Word1 (Configuration and Manufacturing Info.), offset: 0x410 */
  uint8_t RESERVED_9[12];
  uint32_t CFG1;                                   /**< Value of OTP Bank0 Word2 (Configuration and Manufacturing Info.), offset: 0x420 */
  uint8_t RESERVED_10[12];
  uint32_t CFG2;                                   /**< Value of OTP Bank0 Word3 (Configuration and Manufacturing Info.), offset: 0x430 */
  uint8_t RESERVED_11[12];
  uint32_t CFG3;                                   /**< Value of OTP Bank0 Word4 (Configuration and Manufacturing Info.), offset: 0x440 */
  uint8_t RESERVED_12[12];
  uint32_t CFG4;                                   /**< Value of OTP Bank0 Word5 (Configuration and Manufacturing Info.), offset: 0x450 */
  uint8_t RESERVED_13[12];
  uint32_t CFG5;                                   /**< Value of OTP Bank0 Word6 (Configuration and Manufacturing Info.), offset: 0x460 */
  uint8_t RESERVED_14[12];
  uint32_t CFG6;                                   /**< Value of OTP Bank0 Word7 (Configuration and Manufacturing Info.), offset: 0x470 */
  uint8_t RESERVED_15[12];
  uint32_t MEM0;                                   /**< Value of OTP Bank1 Word0 (Memory Related Info.), offset: 0x480 */
  uint8_t RESERVED_16[12];
  uint32_t MEM1;                                   /**< Value of OTP Bank1 Word1 (Memory Related Info.), offset: 0x490 */
  uint8_t RESERVED_17[12];
  uint32_t MEM2;                                   /**< Value of OTP Bank1 Word2 (Memory Related Info.), offset: 0x4A0 */
  uint8_t RESERVED_18[12];
  uint32_t MEM3;                                   /**< Value of OTP Bank1 Word3 (Memory Related Info.), offset: 0x4B0 */
  uint8_t RESERVED_19[12];
  uint32_t MEM4;                                   /**< Value of OTP Bank1 Word4 (Memory Related Info.), offset: 0x4C0 */
  uint8_t RESERVED_20[12];
  uint32_t ANA0;                                   /**< Value of OTP Bank1 Word5 (Analog Info.), offset: 0x4D0 */
  uint8_t RESERVED_21[12];
  uint32_t ANA1;                                   /**< Value of OTP Bank1 Word6 (Analog Info.), offset: 0x4E0 */
  uint8_t RESERVED_22[12];
  uint32_t ANA2;                                   /**< Value of OTP Bank1 Word7 (Analog Info.), offset: 0x4F0 */
  uint8_t RESERVED_23[140];
  uint32_t SRK0;                                   /**< Shadow Register for OTP Bank3 Word0 (SRK Hash), offset: 0x580 */
  uint8_t RESERVED_24[12];
  uint32_t SRK1;                                   /**< Shadow Register for OTP Bank3 Word1 (SRK Hash), offset: 0x590 */
  uint8_t RESERVED_25[12];
  uint32_t SRK2;                                   /**< Shadow Register for OTP Bank3 Word2 (SRK Hash), offset: 0x5A0 */
  uint8_t RESERVED_26[12];
  uint32_t SRK3;                                   /**< Shadow Register for OTP Bank3 Word3 (SRK Hash), offset: 0x5B0 */
  uint8_t RESERVED_27[12];
  uint32_t SRK4;                                   /**< Shadow Register for OTP Bank3 Word4 (SRK Hash), offset: 0x5C0 */
  uint8_t RESERVED_28[12];
  uint32_t SRK5;                                   /**< Shadow Register for OTP Bank3 Word5 (SRK Hash), offset: 0x5D0 */
  uint8_t RESERVED_29[12];
  uint32_t SRK6;                                   /**< Shadow Register for OTP Bank3 Word6 (SRK Hash), offset: 0x5E0 */
  uint8_t RESERVED_30[12];
  uint32_t SRK7;                                   /**< Shadow Register for OTP Bank3 Word7 (SRK Hash), offset: 0x5F0 */
  uint8_t RESERVED_31[12];
  uint32_t SJC_RESP0;                              /**< Value of OTP Bank4 Word0 (Secure JTAG Response Field), offset: 0x600 */
  uint8_t RESERVED_32[12];
  uint32_t SJC_RESP1;                              /**< Value of OTP Bank4 Word1 (Secure JTAG Response Field), offset: 0x610 */
  uint8_t RESERVED_33[12];
  uint32_t MAC0;                                   /**< Value of OTP Bank4 Word2 (MAC Address), offset: 0x620 */
  uint8_t RESERVED_34[12];
  uint32_t MAC1;                                   /**< Value of OTP Bank4 Word3 (MAC Address), offset: 0x630 */
  uint8_t RESERVED_35[12];
  uint32_t GP3;                                    /**< Value of OTP Bank4 Word4 (MAC Address), offset: 0x640 */
  uint8_t RESERVED_36[28];
  uint32_t GP1;                                    /**< Value of OTP Bank4 Word6 (General Purpose Customer Defined Info), offset: 0x660 */
  uint8_t RESERVED_37[12];
  uint32_t GP2;                                    /**< Value of OTP Bank4 Word7 (General Purpose Customer Defined Info), offset: 0x670 */
  uint8_t RESERVED_38[12];
  uint32_t SW_GP1;                                 /**< Value of OTP Bank5 Word0 (SW GP1), offset: 0x680 */
  uint8_t RESERVED_39[12];
  uint32_t SW_GP20;                                /**< Value of OTP Bank5 Word1 (SW GP2), offset: 0x690 */
  uint8_t RESERVED_40[12];
  uint32_t SW_GP21;                                /**< Value of OTP Bank5 Word2 (SW GP2), offset: 0x6A0 */
  uint8_t RESERVED_41[12];
  uint32_t SW_GP22;                                /**< Value of OTP Bank5 Word3 (SW GP2), offset: 0x6B0 */
  uint8_t RESERVED_42[12];
  uint32_t SW_GP23;                                /**< Value of OTP Bank5 Word4 (SW GP2), offset: 0x6C0 */
  uint8_t RESERVED_43[12];
  uint32_t MISC_CONF0;                             /**< Value of OTP Bank5 Word5 (Misc Conf), offset: 0x6D0 */
  uint8_t RESERVED_44[12];
  uint32_t MISC_CONF1;                             /**< Value of OTP Bank5 Word6 (Misc Conf), offset: 0x6E0 */
  uint8_t RESERVED_45[12];
  uint32_t SRK_REVOKE;                             /**< Value of OTP Bank5 Word7 (SRK Revoke), offset: 0x6F0 */
} volatile *OCOTP_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- OCOTP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OCOTP_Register_Accessor_Macros OCOTP - Register accessor macros
 * @{
 */


/* OCOTP - Register accessors */
#define OCOTP_CTRL_REG(base)                     ((base)->CTRL)
#define OCOTP_CTRL_SET_REG(base)                 ((base)->CTRL_SET)
#define OCOTP_CTRL_CLR_REG(base)                 ((base)->CTRL_CLR)
#define OCOTP_CTRL_TOG_REG(base)                 ((base)->CTRL_TOG)
#define OCOTP_TIMING_REG(base)                   ((base)->TIMING)
#define OCOTP_DATA_REG(base)                     ((base)->DATA)
#define OCOTP_READ_CTRL_REG(base)                ((base)->READ_CTRL)
#define OCOTP_READ_FUSE_DATA_REG(base)           ((base)->READ_FUSE_DATA)
#define OCOTP_SW_STICKY_REG(base)                ((base)->SW_STICKY)
#define OCOTP_SCS_REG(base)                      ((base)->SCS)
#define OCOTP_SCS_SET_REG(base)                  ((base)->SCS_SET)
#define OCOTP_SCS_CLR_REG(base)                  ((base)->SCS_CLR)
#define OCOTP_SCS_TOG_REG(base)                  ((base)->SCS_TOG)
#define OCOTP_VERSION_REG(base)                  ((base)->VERSION)
#define OCOTP_TIMING2_REG(base)                  ((base)->TIMING2)
#define OCOTP_LOCK_REG(base)                     ((base)->LOCK)
#define OCOTP_CFG0_REG(base)                     ((base)->CFG0)
#define OCOTP_CFG1_REG(base)                     ((base)->CFG1)
#define OCOTP_CFG2_REG(base)                     ((base)->CFG2)
#define OCOTP_CFG3_REG(base)                     ((base)->CFG3)
#define OCOTP_CFG4_REG(base)                     ((base)->CFG4)
#define OCOTP_CFG5_REG(base)                     ((base)->CFG5)
#define OCOTP_CFG6_REG(base)                     ((base)->CFG6)
#define OCOTP_MEM0_REG(base)                     ((base)->MEM0)
#define OCOTP_MEM1_REG(base)                     ((base)->MEM1)
#define OCOTP_MEM2_REG(base)                     ((base)->MEM2)
#define OCOTP_MEM3_REG(base)                     ((base)->MEM3)
#define OCOTP_MEM4_REG(base)                     ((base)->MEM4)
#define OCOTP_ANA0_REG(base)                     ((base)->ANA0)
#define OCOTP_ANA1_REG(base)                     ((base)->ANA1)
#define OCOTP_ANA2_REG(base)                     ((base)->ANA2)
#define OCOTP_SRK0_REG(base)                     ((base)->SRK0)
#define OCOTP_SRK1_REG(base)                     ((base)->SRK1)
#define OCOTP_SRK2_REG(base)                     ((base)->SRK2)
#define OCOTP_SRK3_REG(base)                     ((base)->SRK3)
#define OCOTP_SRK4_REG(base)                     ((base)->SRK4)
#define OCOTP_SRK5_REG(base)                     ((base)->SRK5)
#define OCOTP_SRK6_REG(base)                     ((base)->SRK6)
#define OCOTP_SRK7_REG(base)                     ((base)->SRK7)
#define OCOTP_SJC_RESP0_REG(base)                ((base)->SJC_RESP0)
#define OCOTP_SJC_RESP1_REG(base)                ((base)->SJC_RESP1)
#define OCOTP_MAC0_REG(base)                     ((base)->MAC0)
#define OCOTP_MAC1_REG(base)                     ((base)->MAC1)
#define OCOTP_GP3_REG(base)                      ((base)->GP3)
#define OCOTP_GP1_REG(base)                      ((base)->GP1)
#define OCOTP_GP2_REG(base)                      ((base)->GP2)
#define OCOTP_SW_GP1_REG(base)                   ((base)->SW_GP1)
#define OCOTP_SW_GP20_REG(base)                  ((base)->SW_GP20)
#define OCOTP_SW_GP21_REG(base)                  ((base)->SW_GP21)
#define OCOTP_SW_GP22_REG(base)                  ((base)->SW_GP22)
#define OCOTP_SW_GP23_REG(base)                  ((base)->SW_GP23)
#define OCOTP_MISC_CONF0_REG(base)               ((base)->MISC_CONF0)
#define OCOTP_MISC_CONF1_REG(base)               ((base)->MISC_CONF1)
#define OCOTP_SRK_REVOKE_REG(base)               ((base)->SRK_REVOKE)

/*!
 * @}
 */ /* end of group OCOTP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- OCOTP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OCOTP_Register_Masks OCOTP Register Masks
 * @{
 */

/*! @name CTRL - OTP Controller Control Register */
#define OCOTP_CTRL_ADDR_MASK                     (0x3FU)
#define OCOTP_CTRL_ADDR_SHIFT                    (0U)
#define OCOTP_CTRL_ADDR(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_ADDR_SHIFT)) & OCOTP_CTRL_ADDR_MASK)
#define OCOTP_CTRL_BUSY_MASK                     (0x100U)
#define OCOTP_CTRL_BUSY_SHIFT                    (8U)
#define OCOTP_CTRL_ERROR_MASK                    (0x200U)
#define OCOTP_CTRL_ERROR_SHIFT                   (9U)
#define OCOTP_CTRL_RELOAD_SHADOWS_MASK           (0x400U)
#define OCOTP_CTRL_RELOAD_SHADOWS_SHIFT          (10U)
#define OCOTP_CTRL_WR_UNLOCK_MASK                (0xFFFF0000U)
#define OCOTP_CTRL_WR_UNLOCK_SHIFT               (16U)
#define OCOTP_CTRL_WR_UNLOCK(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_WR_UNLOCK_SHIFT)) & OCOTP_CTRL_WR_UNLOCK_MASK)

/*! @name CTRL_SET - OTP Controller Control Register */
#define OCOTP_CTRL_SET_ADDR_MASK                 (0x3FU)
#define OCOTP_CTRL_SET_ADDR_SHIFT                (0U)
#define OCOTP_CTRL_SET_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_SET_ADDR_SHIFT)) & OCOTP_CTRL_SET_ADDR_MASK)
#define OCOTP_CTRL_SET_BUSY_MASK                 (0x100U)
#define OCOTP_CTRL_SET_BUSY_SHIFT                (8U)
#define OCOTP_CTRL_SET_ERROR_MASK                (0x200U)
#define OCOTP_CTRL_SET_ERROR_SHIFT               (9U)
#define OCOTP_CTRL_SET_RELOAD_SHADOWS_MASK       (0x400U)
#define OCOTP_CTRL_SET_RELOAD_SHADOWS_SHIFT      (10U)
#define OCOTP_CTRL_SET_WR_UNLOCK_MASK            (0xFFFF0000U)
#define OCOTP_CTRL_SET_WR_UNLOCK_SHIFT           (16U)
#define OCOTP_CTRL_SET_WR_UNLOCK(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_SET_WR_UNLOCK_SHIFT)) & OCOTP_CTRL_SET_WR_UNLOCK_MASK)

/*! @name CTRL_CLR - OTP Controller Control Register */
#define OCOTP_CTRL_CLR_ADDR_MASK                 (0x3FU)
#define OCOTP_CTRL_CLR_ADDR_SHIFT                (0U)
#define OCOTP_CTRL_CLR_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_CLR_ADDR_SHIFT)) & OCOTP_CTRL_CLR_ADDR_MASK)
#define OCOTP_CTRL_CLR_BUSY_MASK                 (0x100U)
#define OCOTP_CTRL_CLR_BUSY_SHIFT                (8U)
#define OCOTP_CTRL_CLR_ERROR_MASK                (0x200U)
#define OCOTP_CTRL_CLR_ERROR_SHIFT               (9U)
#define OCOTP_CTRL_CLR_RELOAD_SHADOWS_MASK       (0x400U)
#define OCOTP_CTRL_CLR_RELOAD_SHADOWS_SHIFT      (10U)
#define OCOTP_CTRL_CLR_WR_UNLOCK_MASK            (0xFFFF0000U)
#define OCOTP_CTRL_CLR_WR_UNLOCK_SHIFT           (16U)
#define OCOTP_CTRL_CLR_WR_UNLOCK(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_CLR_WR_UNLOCK_SHIFT)) & OCOTP_CTRL_CLR_WR_UNLOCK_MASK)

/*! @name CTRL_TOG - OTP Controller Control Register */
#define OCOTP_CTRL_TOG_ADDR_MASK                 (0x3FU)
#define OCOTP_CTRL_TOG_ADDR_SHIFT                (0U)
#define OCOTP_CTRL_TOG_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_ADDR_SHIFT)) & OCOTP_CTRL_TOG_ADDR_MASK)
#define OCOTP_CTRL_TOG_BUSY_MASK                 (0x100U)
#define OCOTP_CTRL_TOG_BUSY_SHIFT                (8U)
#define OCOTP_CTRL_TOG_ERROR_MASK                (0x200U)
#define OCOTP_CTRL_TOG_ERROR_SHIFT               (9U)
#define OCOTP_CTRL_TOG_RELOAD_SHADOWS_MASK       (0x400U)
#define OCOTP_CTRL_TOG_RELOAD_SHADOWS_SHIFT      (10U)
#define OCOTP_CTRL_TOG_WR_UNLOCK_MASK            (0xFFFF0000U)
#define OCOTP_CTRL_TOG_WR_UNLOCK_SHIFT           (16U)
#define OCOTP_CTRL_TOG_WR_UNLOCK(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_WR_UNLOCK_SHIFT)) & OCOTP_CTRL_TOG_WR_UNLOCK_MASK)

