AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SRK7 - Shadow Register for OTP Bank3 Word7 (SRK Hash) */
#define OCOTP_SRK7_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_SRK7_BITS_SHIFT                    (0U)
#define OCOTP_SRK7_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_SRK7_BITS_SHIFT)) & OCOTP_SRK7_BITS_MASK)

/*! @name SJC_RESP0 - Value of OTP Bank4 Word0 (Secure JTAG Response Field) */
#define OCOTP_SJC_RESP0_BITS_MASK                (0xFFFFFFFFU)
#define OCOTP_SJC_RESP0_BITS_SHIFT               (0U)
#define OCOTP_SJC_RESP0_BITS(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_SJC_RESP0_BITS_SHIFT)) & OCOTP_SJC_RESP0_BITS_MASK)

/*! @name SJC_RESP1 - Value of OTP Bank4 Word1 (Secure JTAG Response Field) */
#define OCOTP_SJC_RESP1_BITS_MASK                (0xFFFFFFFFU)
#define OCOTP_SJC_RESP1_BITS_SHIFT               (0U)
#define OCOTP_SJC_RESP1_BITS(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_SJC_RESP1_BITS_SHIFT)) & OCOTP_SJC_RESP1_BITS_MASK)

/*! @name MAC0 - Value of OTP Bank4 Word2 (MAC Address) */
#define OCOTP_MAC0_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_MAC0_BITS_SHIFT                    (0U)
#define OCOTP_MAC0_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_MAC0_BITS_SHIFT)) & OCOTP_MAC0_BITS_MASK)

/*! @name MAC1 - Value of OTP Bank4 Word3 (MAC Address) */
#define OCOTP_MAC1_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_MAC1_BITS_SHIFT                    (0U)
#define OCOTP_MAC1_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_MAC1_BITS_SHIFT)) & OCOTP_MAC1_BITS_MASK)

/*! @name GP3 - Value of OTP Bank4 Word4 (MAC Address) */
#define OCOTP_GP3_BITS_MASK                      (0xFFFFFFFFU)
#define OCOTP_GP3_BITS_SHIFT                     (0U)
#define OCOTP_GP3_BITS(x)                        (((uint32_t)(((uint32_t)(x)) << OCOTP_GP3_BITS_SHIFT)) & OCOTP_GP3_BITS_MASK)

/*! @name GP1 - Value of OTP Bank4 Word6 (General Purpose Customer Defined Info) */
#define OCOTP_GP1_BITS_MASK                      (0xFFFFFFFFU)
#define OCOTP_GP1_BITS_SHIFT                     (0U)
#define OCOTP_GP1_BITS(x)                        (((uint32_t)(((uint32_t)(x)) << OCOTP_GP1_BITS_SHIFT)) & OCOTP_GP1_BITS_MASK)

/*! @name GP2 - Value of OTP Bank4 Word7 (General Purpose Customer Defined Info) */
#define OCOTP_GP2_BITS_MASK                      (0xFFFFFFFFU)
#define OCOTP_GP2_BITS_SHIFT                     (0U)
#define OCOTP_GP2_BITS(x)                        (((uint32_t)(((uint32_t)(x)) << OCOTP_GP2_BITS_SHIFT)) & OCOTP_GP2_BITS_MASK)

/*! @name SW_GP1 - Value of OTP Bank5 Word0 (SW GP1) */
#define OCOTP_SW_GP1_BITS_MASK                   (0xFFFFFFFFU)
#define OCOTP_SW_GP1_BITS_SHIFT                  (0U)
#define OCOTP_SW_GP1_BITS(x)                     (((uint32_t)(((uint32_t)(x)) << OCOTP_SW_GP1_BITS_SHIFT)) & OCOTP_SW_GP1_BITS_MASK)

/*! @name SW_GP20 - Value of OTP Bank5 Word1 (SW GP2) */
#define OCOTP_SW_GP20_BITS_MASK                  (0xFFFFFFFFU)
#define OCOTP_SW_GP20_BITS_SHIFT                 (0U)
#define OCOTP_SW_GP20_BITS(x)                    (((uint32_t)(((uint32_t)(x)) << OCOTP_SW_GP20_BITS_SHIFT)) & OCOTP_SW_GP20_BITS_MASK)

/*! @name SW_GP21 - Value of OTP Bank5 Word2 (SW GP2) */
#define OCOTP_SW_GP21_BITS_MASK                  (0xFFFFFFFFU)
#define OCOTP_SW_GP21_BITS_SHIFT                 (0U)
#define OCOTP_SW_GP21_BITS(x)                    (((uint32_t)(((uint32_t)(x)) << OCOTP_SW_GP21_BITS_SHIFT)) & OCOTP_SW_GP21_BITS_MASK)

/*! @name SW_GP22 - Value of OTP Bank5 Word3 (SW GP2) */
#define OCOTP_SW_GP22_BITS_MASK                  (0xFFFFFFFFU)
#define OCOTP_SW_GP22_BITS_SHIFT                 (0U)
#define OCOTP_SW_GP22_BITS(x)                    (((uint32_t)(((uint32_t)(x)) << OCOTP_SW_GP22_BITS_SHIFT)) & OCOTP_SW_GP22_BITS_MASK)

/*! @name SW_GP23 - Value of OTP Bank5 Word4 (SW GP2) */
#define OCOTP_SW_GP23_BITS_MASK                  (0xFFFFFFFFU)
#define OCOTP_SW_GP23_BITS_SHIFT                 (0U)
#define OCOTP_SW_GP23_BITS(x)                    (((uint32_t)(((uint32_t)(x)) << OCOTP_SW_GP23_BITS_SHIFT)) & OCOTP_SW_GP23_BITS_MASK)

/*! @name MISC_CONF0 - Value of OTP Bank5 Word5 (Misc Conf) */
#define OCOTP_MISC_CONF0_BITS_MASK               (0xFFFFFFFFU)
#define OCOTP_MISC_CONF0_BITS_SHIFT              (0U)
#define OCOTP_MISC_CONF0_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_MISC_CONF0_BITS_SHIFT)) & OCOTP_MISC_CONF0_BITS_MASK)

/*! @name MISC_CONF1 - Value of OTP Bank5 Word6 (Misc Conf) */
#define OCOTP_MISC_CONF1_BITS_MASK               (0xFFFFFFFFU)
#define OCOTP_MISC_CONF1_BITS_SHIFT              (0U)
#define OCOTP_MISC_CONF1_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_MISC_CONF1_BITS_SHIFT)) & OCOTP_MISC_CONF1_BITS_MASK)

/*! @name SRK_REVOKE - Value of OTP Bank5 Word7 (SRK Revoke) */
#define OCOTP_SRK_REVOKE_BITS_MASK               (0xFFFFFFFFU)
#define OCOTP_SRK_REVOKE_BITS_SHIFT              (0U)
#define OCOTP_SRK_REVOKE_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_SRK_REVOKE_BITS_SHIFT)) & OCOTP_SRK_REVOKE_BITS_MASK)


/*!
 * @}
 */ /* end of group OCOTP_Register_Masks */


/* OCOTP - Peripheral instance base addresses */
/** Peripheral OCOTP base pointer */
#define OCOTP_BASE_PTR                           ((OCOTP_MemMapPtr)0x401F4000u)
/** Array initializer of OCOTP peripheral base pointers */
#define OCOTP_BASE_PTRS                          { OCOTP_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- OCOTP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OCOTP_Register_Accessor_Macros OCOTP - Register accessor macros
 * @{
 */


/* OCOTP - Register instance definitions */
/* OCOTP */
#define OCOTP_HW_OCOTP_CTRL                      OCOTP_CTRL_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CTRL_SET                  OCOTP_CTRL_SET_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CTRL_CLR                  OCOTP_CTRL_CLR_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CTRL_TOG                  OCOTP_CTRL_TOG_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_TIMING                    OCOTP_TIMING_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_DATA                      OCOTP_DATA_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_READ_CTRL                 OCOTP_READ_CTRL_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_READ_FUSE_DATA            OCOTP_READ_FUSE_DATA_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SW_STICKY                 OCOTP_SW_STICKY_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SCS                       OCOTP_SCS_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SCS_SET                   OCOTP_SCS_SET_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SCS_CLR                   OCOTP_SCS_CLR_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SCS_TOG                   OCOTP_SCS_TOG_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_VERSION                   OCOTP_VERSION_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_TIMING2                   OCOTP_TIMING2_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_LOCK                      OCOTP_LOCK_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG0                      OCOTP_CFG0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG1                      OCOTP_CFG1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG2                      OCOTP_CFG2_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG3                      OCOTP_CFG3_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG4                      OCOTP_CFG4_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG5                      OCOTP_CFG5_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_CFG6                      OCOTP_CFG6_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MEM0                      OCOTP_MEM0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MEM1                      OCOTP_MEM1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MEM2                      OCOTP_MEM2_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MEM3                      OCOTP_MEM3_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MEM4                      OCOTP_MEM4_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_ANA0                      OCOTP_ANA0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_ANA1                      OCOTP_ANA1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_ANA2                      OCOTP_ANA2_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK0                      OCOTP_SRK0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK1                      OCOTP_SRK1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK2                      OCOTP_SRK2_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK3                      OCOTP_SRK3_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK4                      OCOTP_SRK4_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK5                      OCOTP_SRK5_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK6                      OCOTP_SRK6_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK7                      OCOTP_SRK7_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SJC_RESP0                 OCOTP_SJC_RESP0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SJC_RESP1                 OCOTP_SJC_RESP1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MAC0                      OCOTP_MAC0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MAC1                      OCOTP_MAC1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_GP3                       OCOTP_GP3_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_GP1                       OCOTP_GP1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_GP2                       OCOTP_GP2_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SW_GP1                    OCOTP_SW_GP1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SW_GP20                   OCOTP_SW_GP20_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SW_GP21                   OCOTP_SW_GP21_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SW_GP22                   OCOTP_SW_GP22_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SW_GP23                   OCOTP_SW_GP23_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MISC_CONF0                OCOTP_MISC_CONF0_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_MISC_CONF1                OCOTP_MISC_CONF1_REG(OCOTP_BASE_PTR)
#define OCOTP_HW_OCOTP_SRK_REVOKE                OCOTP_SRK_REVOKE_REG(OCOTP_BASE_PTR)

/*!
 * @}
 */ /* end of group OCOTP_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group OCOTP_Peripheral */


/* ----------------------------------------------------------------------------
   -- PGC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PGC_Peripheral PGC
 * @{
 */

/** PGC - Peripheral register structure */
typedef struct PGC_MemMap {
  uint8_t RESERVED_0[544];
  uint32_t MEGA_CTRL;                              /**< PGC Mega Control Register, offset: 0x220 */
  uint32_t MEGA_PUPSCR;                            /**< PGC Mega Power Up Sequence Control Register, offset: 0x224 */
  uint32_t MEGA_PDNSCR;                            /**< PGC Mega Pull Down Sequence Control Register, offset: 0x228 */
  uint32_t MEGA_SR;                                /**< PGC Mega Power Gating Controller Status Register, offset: 0x22C */
  uint8_t RESERVED_1[112];
  uint32_t CPU_CTRL;                               /**< PGC CPU Control Register, offset: 0x2A0 */
  uint32_t CPU_PUPSCR;                             /**< PGC CPU Power Up Sequence Control Register, offset: 0x2A4 */
  uint32_t CPU_PDNSCR;                             /**< PGC CPU Pull Down Sequence Control Register, offset: 0x2A8 */
  uint32_t CPU_SR;                                 /**< PGC CPU Power Gating Controller Status Register, offset: 0x2AC */
} volatile *PGC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- PGC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PGC_Register_Accessor_Macros PGC - Register accessor macros
 * @{
 */


/* PGC - Register accessors */
#define PGC_MEGA_CTRL_REG(base)                  ((base)->MEGA_CTRL)
#define PGC_MEGA_PUPSCR_REG(base)                ((base)->MEGA_PUPSCR)
#define PGC_MEGA_PDNSCR_REG(base)                ((base)->MEGA_PDNSCR)
#define PGC_MEGA_SR_REG(base)                    ((base)->MEGA_SR)
#define PGC_CPU_CTRL_REG(base)                   ((base)->CPU_CTRL)
#define PGC_CPU_PUPSCR_REG(base)                 ((base)->CPU_PUPSCR)
#define PGC_CPU_PDNSCR_REG(base)                 ((base)->CPU_PDNSCR)
#define PGC_CPU_SR_REG(base)                     ((base)->CPU_SR)

/*!
 * @}
 */ /* end of group PGC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- PGC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PGC_Register_Masks PGC Register Masks
 * @{
 */

/*! @name MEGA_CTRL - PGC Mega Control Register */
#define PGC_MEGA_CTRL_PCR_MASK                   (0x1U)
#define PGC_MEGA_CTRL_PCR_SHIFT                  (0U)

/*! @name MEGA_PUPSCR - PGC Mega Power Up Sequence Control Register */
#define PGC_MEGA_PUPSCR_SW_MASK                  (0x3FU)
#define PGC_MEGA_PUPSCR_SW_SHIFT                 (0U)
#define PGC_MEGA_PUPSCR_SW(x)                    (((uint32_t)(((uint32_t)(x)) << PGC_MEGA_PUPSCR_SW_SHIFT)) & PGC_MEGA_PUPSCR_SW_MASK)
#define PGC_MEGA_PUPSCR_SW2ISO_MASK              (0x3F00U)
#define PGC_MEGA_PUPSCR_SW2ISO_SHIFT             (8U)
#define PGC_MEGA_PUPSCR_SW2ISO(x)                (((uint32_t)(((uint32_t)(x)) << PGC_MEGA_PUPSCR_SW2ISO_SHIFT)) & PGC_MEGA_PUPSCR_SW2ISO_MASK)

/*! @name MEGA_PDNSCR - PGC Mega Pull Down Sequence Control Register */
#define PGC_MEGA_PDNSCR_ISO_MASK                 (0x3FU)
#define PGC_MEGA_PDNSCR_ISO_SHIFT                (0U)
#define PGC_MEGA_PDNSCR_ISO(x)                   (((uint32_t)(((uint32_t)(x)) << PGC_MEGA_PDNSCR_ISO_SHIFT)) & PGC_MEGA_PDNSCR_ISO_MASK)
#define PGC_MEGA_PDNSCR_ISO2SW_MASK              (0x3F00U)
#define PGC_MEGA_PDNSCR_ISO2SW_SHIFT             (8U)
#define PGC_MEGA_PDNSCR_ISO2SW(x)                (((uint32_t)(((uint32_t)(x)) << PGC_MEGA_PDNSCR_ISO2SW_SHIFT)) & PGC_MEGA_PDNSCR_ISO2SW_MASK)

/*! @name MEGA_SR - PGC Mega Power Gating Controller Status Register */
#define PGC_MEGA_SR_PSR_MASK                     (0x1U)
#define PGC_MEGA_SR_PSR_SHIFT                    (0U)

