AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name MCTRL2 - Master Control 2 Register */
#define PWM_MCTRL2_MONPLL_MASK                   (0x3U)
#define PWM_MCTRL2_MONPLL_SHIFT                  (0U)
#define PWM_MCTRL2_MONPLL(x)                     (((uint16_t)(((uint16_t)(x)) << PWM_MCTRL2_MONPLL_SHIFT)) & PWM_MCTRL2_MONPLL_MASK)

/*! @name FCTRL - Fault Control Register */
#define PWM_FCTRL_FIE_MASK                       (0xFU)
#define PWM_FCTRL_FIE_SHIFT                      (0U)
#define PWM_FCTRL_FIE(x)                         (((uint16_t)(((uint16_t)(x)) << PWM_FCTRL_FIE_SHIFT)) & PWM_FCTRL_FIE_MASK)
#define PWM_FCTRL_FSAFE_MASK                     (0xF0U)
#define PWM_FCTRL_FSAFE_SHIFT                    (4U)
#define PWM_FCTRL_FSAFE(x)                       (((uint16_t)(((uint16_t)(x)) << PWM_FCTRL_FSAFE_SHIFT)) & PWM_FCTRL_FSAFE_MASK)
#define PWM_FCTRL_FAUTO_MASK                     (0xF00U)
#define PWM_FCTRL_FAUTO_SHIFT                    (8U)
#define PWM_FCTRL_FAUTO(x)                       (((uint16_t)(((uint16_t)(x)) << PWM_FCTRL_FAUTO_SHIFT)) & PWM_FCTRL_FAUTO_MASK)
#define PWM_FCTRL_FLVL_MASK                      (0xF000U)
#define PWM_FCTRL_FLVL_SHIFT                     (12U)
#define PWM_FCTRL_FLVL(x)                        (((uint16_t)(((uint16_t)(x)) << PWM_FCTRL_FLVL_SHIFT)) & PWM_FCTRL_FLVL_MASK)

/*! @name FSTS - Fault Status Register */
#define PWM_FSTS_FFLAG_MASK                      (0xFU)
#define PWM_FSTS_FFLAG_SHIFT                     (0U)
#define PWM_FSTS_FFLAG(x)                        (((uint16_t)(((uint16_t)(x)) << PWM_FSTS_FFLAG_SHIFT)) & PWM_FSTS_FFLAG_MASK)
#define PWM_FSTS_FFULL_MASK                      (0xF0U)
#define PWM_FSTS_FFULL_SHIFT                     (4U)
#define PWM_FSTS_FFULL(x)                        (((uint16_t)(((uint16_t)(x)) << PWM_FSTS_FFULL_SHIFT)) & PWM_FSTS_FFULL_MASK)
#define PWM_FSTS_FFPIN_MASK                      (0xF00U)
#define PWM_FSTS_FFPIN_SHIFT                     (8U)
#define PWM_FSTS_FFPIN(x)                        (((uint16_t)(((uint16_t)(x)) << PWM_FSTS_FFPIN_SHIFT)) & PWM_FSTS_FFPIN_MASK)
#define PWM_FSTS_FHALF_MASK                      (0xF000U)
#define PWM_FSTS_FHALF_SHIFT                     (12U)
#define PWM_FSTS_FHALF(x)                        (((uint16_t)(((uint16_t)(x)) << PWM_FSTS_FHALF_SHIFT)) & PWM_FSTS_FHALF_MASK)

/*! @name FFILT - Fault Filter Register */
#define PWM_FFILT_FILT_PER_MASK                  (0xFFU)
#define PWM_FFILT_FILT_PER_SHIFT                 (0U)
#define PWM_FFILT_FILT_PER(x)                    (((uint16_t)(((uint16_t)(x)) << PWM_FFILT_FILT_PER_SHIFT)) & PWM_FFILT_FILT_PER_MASK)
#define PWM_FFILT_FILT_CNT_MASK                  (0x700U)
#define PWM_FFILT_FILT_CNT_SHIFT                 (8U)
#define PWM_FFILT_FILT_CNT(x)                    (((uint16_t)(((uint16_t)(x)) << PWM_FFILT_FILT_CNT_SHIFT)) & PWM_FFILT_FILT_CNT_MASK)
#define PWM_FFILT_GSTR_MASK                      (0x8000U)
#define PWM_FFILT_GSTR_SHIFT                     (15U)

/*! @name FTST - Fault Test Register */
#define PWM_FTST_FTEST_MASK                      (0x1U)
#define PWM_FTST_FTEST_SHIFT                     (0U)

/*! @name FCTRL2 - Fault Control 2 Register */
#define PWM_FCTRL2_NOCOMB_MASK                   (0xFU)
#define PWM_FCTRL2_NOCOMB_SHIFT                  (0U)
#define PWM_FCTRL2_NOCOMB(x)                     (((uint16_t)(((uint16_t)(x)) << PWM_FCTRL2_NOCOMB_SHIFT)) & PWM_FCTRL2_NOCOMB_MASK)


/*!
 * @}
 */ /* end of group PWM_Register_Masks */


/* PWM - Peripheral instance base addresses */
/** Peripheral PWM1 base pointer */
#define PWM1_BASE_PTR                            ((PWM_MemMapPtr)0x403DC000u)
/** Peripheral PWM2 base pointer */
#define PWM2_BASE_PTR                            ((PWM_MemMapPtr)0x403E0000u)
/** Peripheral PWM3 base pointer */
#define PWM3_BASE_PTR                            ((PWM_MemMapPtr)0x403E4000u)
/** Peripheral PWM4 base pointer */
#define PWM4_BASE_PTR                            ((PWM_MemMapPtr)0x403E8000u)
/** Array initializer of PWM peripheral base pointers */
#define PWM_BASE_PTRS                            { PWM1_BASE_PTR, PWM2_BASE_PTR, PWM3_BASE_PTR, PWM4_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- PWM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWM_Register_Accessor_Macros PWM - Register accessor macros
 * @{
 */


/* PWM - Register instance definitions */
/* PWM1 */
#define PWM1_SM0CNT                              PWM_CNT_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0INIT                             PWM_INIT_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CTRL2                            PWM_CTRL2_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CTRL                             PWM_CTRL_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0VAL0                             PWM_VAL0_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0VAL1                             PWM_VAL1_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0VAL2                             PWM_VAL2_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0VAL3                             PWM_VAL3_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0VAL4                             PWM_VAL4_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0VAL5                             PWM_VAL5_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0FRCTRL                           PWM_FRCTRL_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0OCTRL                            PWM_OCTRL_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0STS                              PWM_STS_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0INTEN                            PWM_INTEN_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0DMAEN                            PWM_DMAEN_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0TCTRL                            PWM_TCTRL_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0DISMAP0                          PWM_DISMAP_REG(PWM1_BASE_PTR,0,0)
#define PWM1_SM0DISMAP1                          PWM_DISMAP_REG(PWM1_BASE_PTR,0,1)
#define PWM1_SM0DTCNT0                           PWM_DTCNT0_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0DTCNT1                           PWM_DTCNT1_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL0                            PWM_CVAL0_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL1                            PWM_CVAL1_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL2                            PWM_CVAL2_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL3                            PWM_CVAL3_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL4                            PWM_CVAL4_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL5                            PWM_CVAL5_REG(PWM1_BASE_PTR,0)
#define PWM1_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1_BASE_PTR,0)
#define PWM1_SM1CNT                              PWM_CNT_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1INIT                             PWM_INIT_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CTRL2                            PWM_CTRL2_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CTRL                             PWM_CTRL_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1VAL0                             PWM_VAL0_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1VAL1                             PWM_VAL1_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1VAL2                             PWM_VAL2_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1VAL3                             PWM_VAL3_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1VAL4                             PWM_VAL4_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1VAL5                             PWM_VAL5_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1FRCTRL                           PWM_FRCTRL_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1OCTRL                            PWM_OCTRL_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1STS                              PWM_STS_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1INTEN                            PWM_INTEN_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1DMAEN                            PWM_DMAEN_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1TCTRL                            PWM_TCTRL_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1DISMAP0                          PWM_DISMAP_REG(PWM1_BASE_PTR,1,0)
#define PWM1_SM1DISMAP1                          PWM_DISMAP_REG(PWM1_BASE_PTR,1,1)
#define PWM1_SM1DTCNT0                           PWM_DTCNT0_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1DTCNT1                           PWM_DTCNT1_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL0                            PWM_CVAL0_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL1                            PWM_CVAL1_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL2                            PWM_CVAL2_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL3                            PWM_CVAL3_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL4                            PWM_CVAL4_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL5                            PWM_CVAL5_REG(PWM1_BASE_PTR,1)
#define PWM1_SM1CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1_BASE_PTR,1)
#define PWM1_SM2CNT                              PWM_CNT_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2INIT                             PWM_INIT_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CTRL2                            PWM_CTRL2_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CTRL                             PWM_CTRL_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2VAL0                             PWM_VAL0_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2FRACVAL1                         PWM_FRACVAL1_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2VAL1                             PWM_VAL1_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2FRACVAL2                         PWM_FRACVAL2_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2VAL2                             PWM_VAL2_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2FRACVAL3                         PWM_FRACVAL3_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2VAL3                             PWM_VAL3_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2FRACVAL4                         PWM_FRACVAL4_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2VAL4                             PWM_VAL4_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2FRACVAL5                         PWM_FRACVAL5_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2VAL5                             PWM_VAL5_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2FRCTRL                           PWM_FRCTRL_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2OCTRL                            PWM_OCTRL_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2STS                              PWM_STS_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2INTEN                            PWM_INTEN_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2DMAEN                            PWM_DMAEN_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2TCTRL                            PWM_TCTRL_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2DISMAP0                          PWM_DISMAP_REG(PWM1_BASE_PTR,2,0)
#define PWM1_SM2DISMAP1                          PWM_DISMAP_REG(PWM1_BASE_PTR,2,1)
#define PWM1_SM2DTCNT0                           PWM_DTCNT0_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2DTCNT1                           PWM_DTCNT1_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL0                            PWM_CVAL0_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL1                            PWM_CVAL1_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL2                            PWM_CVAL2_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL3                            PWM_CVAL3_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL4                            PWM_CVAL4_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL5                            PWM_CVAL5_REG(PWM1_BASE_PTR,2)
#define PWM1_SM2CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1_BASE_PTR,2)
#define PWM1_SM3CNT                              PWM_CNT_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3INIT                             PWM_INIT_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CTRL2                            PWM_CTRL2_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CTRL                             PWM_CTRL_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3VAL0                             PWM_VAL0_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3FRACVAL1                         PWM_FRACVAL1_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3VAL1                             PWM_VAL1_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3FRACVAL2                         PWM_FRACVAL2_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3VAL2                             PWM_VAL2_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3FRACVAL3                         PWM_FRACVAL3_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3VAL3                             PWM_VAL3_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3FRACVAL4                         PWM_FRACVAL4_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3VAL4                             PWM_VAL4_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3FRACVAL5                         PWM_FRACVAL5_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3VAL5                             PWM_VAL5_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3FRCTRL                           PWM_FRCTRL_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3OCTRL                            PWM_OCTRL_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3STS                              PWM_STS_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3INTEN                            PWM_INTEN_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3DMAEN                            PWM_DMAEN_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3TCTRL                            PWM_TCTRL_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3DISMAP0                          PWM_DISMAP_REG(PWM1_BASE_PTR,3,0)
#define PWM1_SM3DISMAP1                          PWM_DISMAP_REG(PWM1_BASE_PTR,3,1)
#define PWM1_SM3DTCNT0                           PWM_DTCNT0_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3DTCNT1                           PWM_DTCNT1_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL0                            PWM_CVAL0_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL1                            PWM_CVAL1_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL2                            PWM_CVAL2_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL3                            PWM_CVAL3_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL4                            PWM_CVAL4_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL5                            PWM_CVAL5_REG(PWM1_BASE_PTR,3)
#define PWM1_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1_BASE_PTR,3)
#define PWM1_OUTEN                               PWM_OUTEN_REG(PWM1_BASE_PTR)
#define PWM1_MASK                                PWM_MASK_REG(PWM1_BASE_PTR)
#define PWM1_SWCOUT                              PWM_SWCOUT_REG(PWM1_BASE_PTR)
#define PWM1_DTSRCSEL                            PWM_DTSRCSEL_REG(PWM1_BASE_PTR)
#define PWM1_MCTRL                               PWM_MCTRL_REG(PWM1_BASE_PTR)
#define PWM1_MCTRL2                              PWM_MCTRL2_REG(PWM1_BASE_PTR)
#define PWM1_FCTRL0                              PWM_FCTRL_REG(PWM1_BASE_PTR)
#define PWM1_FSTS0                               PWM_FSTS_REG(PWM1_BASE_PTR)
#define PWM1_FFILT0                              PWM_FFILT_REG(PWM1_BASE_PTR)
#define PWM1_FTST0                               PWM_FTST_REG(PWM1_BASE_PTR)
#define PWM1_FCTRL20                             PWM_FCTRL2_REG(PWM1_BASE_PTR)
/* PWM2 */
#define PWM2_SM0CNT                              PWM_CNT_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0INIT                             PWM_INIT_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CTRL2                            PWM_CTRL2_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CTRL                             PWM_CTRL_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0VAL0                             PWM_VAL0_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0VAL1                             PWM_VAL1_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0VAL2                             PWM_VAL2_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0VAL3                             PWM_VAL3_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0VAL4                             PWM_VAL4_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0VAL5                             PWM_VAL5_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0FRCTRL                           PWM_FRCTRL_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0OCTRL                            PWM_OCTRL_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0STS                              PWM_STS_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0INTEN                            PWM_INTEN_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0DMAEN                            PWM_DMAEN_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0TCTRL                            PWM_TCTRL_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0DISMAP0                          PWM_DISMAP_REG(PWM2_BASE_PTR,0,0)
#define PWM2_SM0DISMAP1                          PWM_DISMAP_REG(PWM2_BASE_PTR,0,1)
#define PWM2_SM0DTCNT0                           PWM_DTCNT0_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0DTCNT1                           PWM_DTCNT1_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL0                            PWM_CVAL0_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL1                            PWM_CVAL1_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL2                            PWM_CVAL2_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL3                            PWM_CVAL3_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL4                            PWM_CVAL4_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL5                            PWM_CVAL5_REG(PWM2_BASE_PTR,0)
#define PWM2_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWM2_BASE_PTR,0)
#define PWM2_SM1CNT                              PWM_CNT_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1INIT                             PWM_INIT_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1CTRL2                            PWM_CTRL2_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1CTRL                             PWM_CTRL_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1VAL0                             PWM_VAL0_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1VAL1                             PWM_VAL1_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1VAL2                             PWM_VAL2_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1VAL3                             PWM_VAL3_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1VAL4                             PWM_VAL4_REG(PWM2_BASE_PTR,1)
#define PWM2_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWM2_BASE_PTR,1)
