AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
#define PWM3_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWM3_BASE_PTR,3)
#define PWM3_SM3CVAL5                            PWM_CVAL5_REG(PWM3_BASE_PTR,3)
#define PWM3_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWM3_BASE_PTR,3)
#define PWM3_OUTEN                               PWM_OUTEN_REG(PWM3_BASE_PTR)
#define PWM3_MASK                                PWM_MASK_REG(PWM3_BASE_PTR)
#define PWM3_SWCOUT                              PWM_SWCOUT_REG(PWM3_BASE_PTR)
#define PWM3_DTSRCSEL                            PWM_DTSRCSEL_REG(PWM3_BASE_PTR)
#define PWM3_MCTRL                               PWM_MCTRL_REG(PWM3_BASE_PTR)
#define PWM3_MCTRL2                              PWM_MCTRL2_REG(PWM3_BASE_PTR)
#define PWM3_FCTRL0                              PWM_FCTRL_REG(PWM3_BASE_PTR)
#define PWM3_FSTS0                               PWM_FSTS_REG(PWM3_BASE_PTR)
#define PWM3_FFILT0                              PWM_FFILT_REG(PWM3_BASE_PTR)
#define PWM3_FTST0                               PWM_FTST_REG(PWM3_BASE_PTR)
#define PWM3_FCTRL20                             PWM_FCTRL2_REG(PWM3_BASE_PTR)
/* PWM4 */
#define PWM4_SM0CNT                              PWM_CNT_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0INIT                             PWM_INIT_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CTRL2                            PWM_CTRL2_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CTRL                             PWM_CTRL_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0VAL0                             PWM_VAL0_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0VAL1                             PWM_VAL1_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0VAL2                             PWM_VAL2_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0VAL3                             PWM_VAL3_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0VAL4                             PWM_VAL4_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0VAL5                             PWM_VAL5_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0FRCTRL                           PWM_FRCTRL_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0OCTRL                            PWM_OCTRL_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0STS                              PWM_STS_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0INTEN                            PWM_INTEN_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0DMAEN                            PWM_DMAEN_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0TCTRL                            PWM_TCTRL_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0DISMAP0                          PWM_DISMAP_REG(PWM4_BASE_PTR,0,0)
#define PWM4_SM0DISMAP1                          PWM_DISMAP_REG(PWM4_BASE_PTR,0,1)
#define PWM4_SM0DTCNT0                           PWM_DTCNT0_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0DTCNT1                           PWM_DTCNT1_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL0                            PWM_CVAL0_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL1                            PWM_CVAL1_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL2                            PWM_CVAL2_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL3                            PWM_CVAL3_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL4                            PWM_CVAL4_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL5                            PWM_CVAL5_REG(PWM4_BASE_PTR,0)
#define PWM4_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWM4_BASE_PTR,0)
#define PWM4_SM1CNT                              PWM_CNT_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1INIT                             PWM_INIT_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CTRL2                            PWM_CTRL2_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CTRL                             PWM_CTRL_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1VAL0                             PWM_VAL0_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1VAL1                             PWM_VAL1_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1VAL2                             PWM_VAL2_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1VAL3                             PWM_VAL3_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1VAL4                             PWM_VAL4_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1VAL5                             PWM_VAL5_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1FRCTRL                           PWM_FRCTRL_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1OCTRL                            PWM_OCTRL_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1STS                              PWM_STS_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1INTEN                            PWM_INTEN_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1DMAEN                            PWM_DMAEN_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1TCTRL                            PWM_TCTRL_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1DISMAP0                          PWM_DISMAP_REG(PWM4_BASE_PTR,1,0)
#define PWM4_SM1DISMAP1                          PWM_DISMAP_REG(PWM4_BASE_PTR,1,1)
#define PWM4_SM1DTCNT0                           PWM_DTCNT0_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1DTCNT1                           PWM_DTCNT1_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL0                            PWM_CVAL0_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL0CYC                         PWM_CVAL0CYC_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL1                            PWM_CVAL1_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL1CYC                         PWM_CVAL1CYC_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL2                            PWM_CVAL2_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL2CYC                         PWM_CVAL2CYC_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL3                            PWM_CVAL3_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL3CYC                         PWM_CVAL3CYC_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL4                            PWM_CVAL4_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL4CYC                         PWM_CVAL4CYC_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL5                            PWM_CVAL5_REG(PWM4_BASE_PTR,1)
#define PWM4_SM1CVAL5CYC                         PWM_CVAL5CYC_REG(PWM4_BASE_PTR,1)
#define PWM4_SM2CNT                              PWM_CNT_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2INIT                             PWM_INIT_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CTRL2                            PWM_CTRL2_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CTRL                             PWM_CTRL_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2VAL0                             PWM_VAL0_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2FRACVAL1                         PWM_FRACVAL1_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2VAL1                             PWM_VAL1_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2FRACVAL2                         PWM_FRACVAL2_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2VAL2                             PWM_VAL2_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2FRACVAL3                         PWM_FRACVAL3_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2VAL3                             PWM_VAL3_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2FRACVAL4                         PWM_FRACVAL4_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2VAL4                             PWM_VAL4_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2FRACVAL5                         PWM_FRACVAL5_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2VAL5                             PWM_VAL5_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2FRCTRL                           PWM_FRCTRL_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2OCTRL                            PWM_OCTRL_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2STS                              PWM_STS_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2INTEN                            PWM_INTEN_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2DMAEN                            PWM_DMAEN_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2TCTRL                            PWM_TCTRL_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2DISMAP0                          PWM_DISMAP_REG(PWM4_BASE_PTR,2,0)
#define PWM4_SM2DISMAP1                          PWM_DISMAP_REG(PWM4_BASE_PTR,2,1)
#define PWM4_SM2DTCNT0                           PWM_DTCNT0_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2DTCNT1                           PWM_DTCNT1_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL0                            PWM_CVAL0_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL0CYC                         PWM_CVAL0CYC_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL1                            PWM_CVAL1_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL1CYC                         PWM_CVAL1CYC_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL2                            PWM_CVAL2_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL2CYC                         PWM_CVAL2CYC_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL3                            PWM_CVAL3_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL3CYC                         PWM_CVAL3CYC_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL4                            PWM_CVAL4_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL4CYC                         PWM_CVAL4CYC_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL5                            PWM_CVAL5_REG(PWM4_BASE_PTR,2)
#define PWM4_SM2CVAL5CYC                         PWM_CVAL5CYC_REG(PWM4_BASE_PTR,2)
#define PWM4_SM3CNT                              PWM_CNT_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3INIT                             PWM_INIT_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CTRL2                            PWM_CTRL2_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CTRL                             PWM_CTRL_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3VAL0                             PWM_VAL0_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3FRACVAL1                         PWM_FRACVAL1_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3VAL1                             PWM_VAL1_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3FRACVAL2                         PWM_FRACVAL2_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3VAL2                             PWM_VAL2_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3FRACVAL3                         PWM_FRACVAL3_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3VAL3                             PWM_VAL3_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3FRACVAL4                         PWM_FRACVAL4_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3VAL4                             PWM_VAL4_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3FRACVAL5                         PWM_FRACVAL5_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3VAL5                             PWM_VAL5_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3FRCTRL                           PWM_FRCTRL_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3OCTRL                            PWM_OCTRL_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3STS                              PWM_STS_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3INTEN                            PWM_INTEN_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3DMAEN                            PWM_DMAEN_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3TCTRL                            PWM_TCTRL_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3DISMAP0                          PWM_DISMAP_REG(PWM4_BASE_PTR,3,0)
#define PWM4_SM3DISMAP1                          PWM_DISMAP_REG(PWM4_BASE_PTR,3,1)
#define PWM4_SM3DTCNT0                           PWM_DTCNT0_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3DTCNT1                           PWM_DTCNT1_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL0                            PWM_CVAL0_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL0CYC                         PWM_CVAL0CYC_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL1                            PWM_CVAL1_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL1CYC                         PWM_CVAL1CYC_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL2                            PWM_CVAL2_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL2CYC                         PWM_CVAL2CYC_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL3                            PWM_CVAL3_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL3CYC                         PWM_CVAL3CYC_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL4                            PWM_CVAL4_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL5                            PWM_CVAL5_REG(PWM4_BASE_PTR,3)
#define PWM4_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWM4_BASE_PTR,3)
#define PWM4_OUTEN                               PWM_OUTEN_REG(PWM4_BASE_PTR)
#define PWM4_MASK                                PWM_MASK_REG(PWM4_BASE_PTR)
#define PWM4_SWCOUT                              PWM_SWCOUT_REG(PWM4_BASE_PTR)
#define PWM4_DTSRCSEL                            PWM_DTSRCSEL_REG(PWM4_BASE_PTR)
#define PWM4_MCTRL                               PWM_MCTRL_REG(PWM4_BASE_PTR)
#define PWM4_MCTRL2                              PWM_MCTRL2_REG(PWM4_BASE_PTR)
#define PWM4_FCTRL0                              PWM_FCTRL_REG(PWM4_BASE_PTR)
#define PWM4_FSTS0                               PWM_FSTS_REG(PWM4_BASE_PTR)
#define PWM4_FFILT0                              PWM_FFILT_REG(PWM4_BASE_PTR)
#define PWM4_FTST0                               PWM_FTST_REG(PWM4_BASE_PTR)
#define PWM4_FCTRL20                             PWM_FCTRL2_REG(PWM4_BASE_PTR)

