AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* PWM - Register array accessors */
#define PWM1_CNT(index)                          PWM_CNT_REG(PWM1_BASE_PTR,index)
#define PWM2_CNT(index)                          PWM_CNT_REG(PWM2_BASE_PTR,index)
#define PWM3_CNT(index)                          PWM_CNT_REG(PWM3_BASE_PTR,index)
#define PWM4_CNT(index)                          PWM_CNT_REG(PWM4_BASE_PTR,index)
#define PWM1_INIT(index)                         PWM_INIT_REG(PWM1_BASE_PTR,index)
#define PWM2_INIT(index)                         PWM_INIT_REG(PWM2_BASE_PTR,index)
#define PWM3_INIT(index)                         PWM_INIT_REG(PWM3_BASE_PTR,index)
#define PWM4_INIT(index)                         PWM_INIT_REG(PWM4_BASE_PTR,index)
#define PWM1_CTRL2(index)                        PWM_CTRL2_REG(PWM1_BASE_PTR,index)
#define PWM2_CTRL2(index)                        PWM_CTRL2_REG(PWM2_BASE_PTR,index)
#define PWM3_CTRL2(index)                        PWM_CTRL2_REG(PWM3_BASE_PTR,index)
#define PWM4_CTRL2(index)                        PWM_CTRL2_REG(PWM4_BASE_PTR,index)
#define PWM1_CTRL(index)                         PWM_CTRL_REG(PWM1_BASE_PTR,index)
#define PWM2_CTRL(index)                         PWM_CTRL_REG(PWM2_BASE_PTR,index)
#define PWM3_CTRL(index)                         PWM_CTRL_REG(PWM3_BASE_PTR,index)
#define PWM4_CTRL(index)                         PWM_CTRL_REG(PWM4_BASE_PTR,index)
#define PWM1_VAL0(index)                         PWM_VAL0_REG(PWM1_BASE_PTR,index)
#define PWM2_VAL0(index)                         PWM_VAL0_REG(PWM2_BASE_PTR,index)
#define PWM3_VAL0(index)                         PWM_VAL0_REG(PWM3_BASE_PTR,index)
#define PWM4_VAL0(index)                         PWM_VAL0_REG(PWM4_BASE_PTR,index)
#define PWM1_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWM1_BASE_PTR,index)
#define PWM2_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWM2_BASE_PTR,index)
#define PWM3_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWM3_BASE_PTR,index)
#define PWM4_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWM4_BASE_PTR,index)
#define PWM1_VAL1(index)                         PWM_VAL1_REG(PWM1_BASE_PTR,index)
#define PWM2_VAL1(index)                         PWM_VAL1_REG(PWM2_BASE_PTR,index)
#define PWM3_VAL1(index)                         PWM_VAL1_REG(PWM3_BASE_PTR,index)
#define PWM4_VAL1(index)                         PWM_VAL1_REG(PWM4_BASE_PTR,index)
#define PWM1_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWM1_BASE_PTR,index)
#define PWM2_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWM2_BASE_PTR,index)
#define PWM3_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWM3_BASE_PTR,index)
#define PWM4_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWM4_BASE_PTR,index)
#define PWM1_VAL2(index)                         PWM_VAL2_REG(PWM1_BASE_PTR,index)
#define PWM2_VAL2(index)                         PWM_VAL2_REG(PWM2_BASE_PTR,index)
#define PWM3_VAL2(index)                         PWM_VAL2_REG(PWM3_BASE_PTR,index)
#define PWM4_VAL2(index)                         PWM_VAL2_REG(PWM4_BASE_PTR,index)
#define PWM1_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWM1_BASE_PTR,index)
#define PWM2_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWM2_BASE_PTR,index)
#define PWM3_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWM3_BASE_PTR,index)
#define PWM4_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWM4_BASE_PTR,index)
#define PWM1_VAL3(index)                         PWM_VAL3_REG(PWM1_BASE_PTR,index)
#define PWM2_VAL3(index)                         PWM_VAL3_REG(PWM2_BASE_PTR,index)
#define PWM3_VAL3(index)                         PWM_VAL3_REG(PWM3_BASE_PTR,index)
#define PWM4_VAL3(index)                         PWM_VAL3_REG(PWM4_BASE_PTR,index)
#define PWM1_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWM1_BASE_PTR,index)
#define PWM2_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWM2_BASE_PTR,index)
#define PWM3_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWM3_BASE_PTR,index)
#define PWM4_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWM4_BASE_PTR,index)
#define PWM1_VAL4(index)                         PWM_VAL4_REG(PWM1_BASE_PTR,index)
#define PWM2_VAL4(index)                         PWM_VAL4_REG(PWM2_BASE_PTR,index)
#define PWM3_VAL4(index)                         PWM_VAL4_REG(PWM3_BASE_PTR,index)
#define PWM4_VAL4(index)                         PWM_VAL4_REG(PWM4_BASE_PTR,index)
#define PWM1_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWM1_BASE_PTR,index)
#define PWM2_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWM2_BASE_PTR,index)
#define PWM3_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWM3_BASE_PTR,index)
#define PWM4_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWM4_BASE_PTR,index)
#define PWM1_VAL5(index)                         PWM_VAL5_REG(PWM1_BASE_PTR,index)
#define PWM2_VAL5(index)                         PWM_VAL5_REG(PWM2_BASE_PTR,index)
#define PWM3_VAL5(index)                         PWM_VAL5_REG(PWM3_BASE_PTR,index)
#define PWM4_VAL5(index)                         PWM_VAL5_REG(PWM4_BASE_PTR,index)
#define PWM1_FRCTRL(index)                       PWM_FRCTRL_REG(PWM1_BASE_PTR,index)
#define PWM2_FRCTRL(index)                       PWM_FRCTRL_REG(PWM2_BASE_PTR,index)
#define PWM3_FRCTRL(index)                       PWM_FRCTRL_REG(PWM3_BASE_PTR,index)
#define PWM4_FRCTRL(index)                       PWM_FRCTRL_REG(PWM4_BASE_PTR,index)
#define PWM1_OCTRL(index)                        PWM_OCTRL_REG(PWM1_BASE_PTR,index)
#define PWM2_OCTRL(index)                        PWM_OCTRL_REG(PWM2_BASE_PTR,index)
#define PWM3_OCTRL(index)                        PWM_OCTRL_REG(PWM3_BASE_PTR,index)
#define PWM4_OCTRL(index)                        PWM_OCTRL_REG(PWM4_BASE_PTR,index)
#define PWM1_STS(index)                          PWM_STS_REG(PWM1_BASE_PTR,index)
#define PWM2_STS(index)                          PWM_STS_REG(PWM2_BASE_PTR,index)
#define PWM3_STS(index)                          PWM_STS_REG(PWM3_BASE_PTR,index)
#define PWM4_STS(index)                          PWM_STS_REG(PWM4_BASE_PTR,index)
#define PWM1_INTEN(index)                        PWM_INTEN_REG(PWM1_BASE_PTR,index)
#define PWM2_INTEN(index)                        PWM_INTEN_REG(PWM2_BASE_PTR,index)
#define PWM3_INTEN(index)                        PWM_INTEN_REG(PWM3_BASE_PTR,index)
#define PWM4_INTEN(index)                        PWM_INTEN_REG(PWM4_BASE_PTR,index)
#define PWM1_DMAEN(index)                        PWM_DMAEN_REG(PWM1_BASE_PTR,index)
#define PWM2_DMAEN(index)                        PWM_DMAEN_REG(PWM2_BASE_PTR,index)
#define PWM3_DMAEN(index)                        PWM_DMAEN_REG(PWM3_BASE_PTR,index)
#define PWM4_DMAEN(index)                        PWM_DMAEN_REG(PWM4_BASE_PTR,index)
#define PWM1_TCTRL(index)                        PWM_TCTRL_REG(PWM1_BASE_PTR,index)
#define PWM2_TCTRL(index)                        PWM_TCTRL_REG(PWM2_BASE_PTR,index)
#define PWM3_TCTRL(index)                        PWM_TCTRL_REG(PWM3_BASE_PTR,index)
#define PWM4_TCTRL(index)                        PWM_TCTRL_REG(PWM4_BASE_PTR,index)
#define PWM1_DISMAP(index,index2)                PWM_DISMAP_REG(PWM1_BASE_PTR,index,index2)
#define PWM2_DISMAP(index,index2)                PWM_DISMAP_REG(PWM2_BASE_PTR,index,index2)
#define PWM3_DISMAP(index,index2)                PWM_DISMAP_REG(PWM3_BASE_PTR,index,index2)
#define PWM4_DISMAP(index,index2)                PWM_DISMAP_REG(PWM4_BASE_PTR,index,index2)
#define PWM1_DTCNT0(index)                       PWM_DTCNT0_REG(PWM1_BASE_PTR,index)
#define PWM2_DTCNT0(index)                       PWM_DTCNT0_REG(PWM2_BASE_PTR,index)
#define PWM3_DTCNT0(index)                       PWM_DTCNT0_REG(PWM3_BASE_PTR,index)
#define PWM4_DTCNT0(index)                       PWM_DTCNT0_REG(PWM4_BASE_PTR,index)
#define PWM1_DTCNT1(index)                       PWM_DTCNT1_REG(PWM1_BASE_PTR,index)
#define PWM2_DTCNT1(index)                       PWM_DTCNT1_REG(PWM2_BASE_PTR,index)
#define PWM3_DTCNT1(index)                       PWM_DTCNT1_REG(PWM3_BASE_PTR,index)
#define PWM4_DTCNT1(index)                       PWM_DTCNT1_REG(PWM4_BASE_PTR,index)
#define PWM1_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWM1_BASE_PTR,index)
#define PWM2_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWM2_BASE_PTR,index)
#define PWM3_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWM3_BASE_PTR,index)
#define PWM4_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWM4_BASE_PTR,index)
#define PWM1_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWM1_BASE_PTR,index)
#define PWM2_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWM2_BASE_PTR,index)
#define PWM3_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWM3_BASE_PTR,index)
#define PWM4_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWM4_BASE_PTR,index)
#define PWM1_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWM1_BASE_PTR,index)
#define PWM2_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWM2_BASE_PTR,index)
#define PWM3_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWM3_BASE_PTR,index)
#define PWM4_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWM4_BASE_PTR,index)
#define PWM1_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWM1_BASE_PTR,index)
#define PWM2_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWM2_BASE_PTR,index)
#define PWM3_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWM3_BASE_PTR,index)
#define PWM4_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWM4_BASE_PTR,index)
#define PWM1_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWM1_BASE_PTR,index)
#define PWM2_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWM2_BASE_PTR,index)
#define PWM3_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWM3_BASE_PTR,index)
#define PWM4_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWM4_BASE_PTR,index)
#define PWM1_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWM1_BASE_PTR,index)
#define PWM2_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWM2_BASE_PTR,index)
#define PWM3_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWM3_BASE_PTR,index)
#define PWM4_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL0(index)                        PWM_CVAL0_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL0(index)                        PWM_CVAL0_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL0(index)                        PWM_CVAL0_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL0(index)                        PWM_CVAL0_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL1(index)                        PWM_CVAL1_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL1(index)                        PWM_CVAL1_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL1(index)                        PWM_CVAL1_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL1(index)                        PWM_CVAL1_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL2(index)                        PWM_CVAL2_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL2(index)                        PWM_CVAL2_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL2(index)                        PWM_CVAL2_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL2(index)                        PWM_CVAL2_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL3(index)                        PWM_CVAL3_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL3(index)                        PWM_CVAL3_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL3(index)                        PWM_CVAL3_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL3(index)                        PWM_CVAL3_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL4(index)                        PWM_CVAL4_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL4(index)                        PWM_CVAL4_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL4(index)                        PWM_CVAL4_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL4(index)                        PWM_CVAL4_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL5(index)                        PWM_CVAL5_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL5(index)                        PWM_CVAL5_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL5(index)                        PWM_CVAL5_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL5(index)                        PWM_CVAL5_REG(PWM4_BASE_PTR,index)
#define PWM1_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWM1_BASE_PTR,index)
#define PWM2_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWM2_BASE_PTR,index)
#define PWM3_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWM3_BASE_PTR,index)
#define PWM4_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWM4_BASE_PTR,index)

/*!
 * @}
 */ /* end of group PWM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group PWM_Peripheral */


/* ----------------------------------------------------------------------------
   -- PXP
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PXP_Peripheral PXP
 * @{
 */

/** PXP - Peripheral register structure */
typedef struct PXP_MemMap {
  uint32_t CTRL;                                   /**< Control Register 0, offset: 0x0 */
  uint32_t CTRL_SET;                               /**< Control Register 0, offset: 0x4 */
  uint32_t CTRL_CLR;                               /**< Control Register 0, offset: 0x8 */
  uint32_t CTRL_TOG;                               /**< Control Register 0, offset: 0xC */
  uint32_t STAT;                                   /**< Status Register, offset: 0x10 */
  uint32_t STAT_SET;                               /**< Status Register, offset: 0x14 */
  uint32_t STAT_CLR;                               /**< Status Register, offset: 0x18 */
  uint32_t STAT_TOG;                               /**< Status Register, offset: 0x1C */
  uint32_t OUT_CTRL;                               /**< Output Buffer Control Register, offset: 0x20 */
  uint32_t OUT_CTRL_SET;                           /**< Output Buffer Control Register, offset: 0x24 */
  uint32_t OUT_CTRL_CLR;                           /**< Output Buffer Control Register, offset: 0x28 */
  uint32_t OUT_CTRL_TOG;                           /**< Output Buffer Control Register, offset: 0x2C */
  uint32_t OUT_BUF;                                /**< Output Frame Buffer Pointer, offset: 0x30 */
  uint8_t RESERVED_0[12];
  uint32_t OUT_BUF2;                               /**< Output Frame Buffer Pointer #2, offset: 0x40 */
  uint8_t RESERVED_1[12];
  uint32_t OUT_PITCH;                              /**< Output Buffer Pitch, offset: 0x50 */
  uint8_t RESERVED_2[12];
  uint32_t OUT_LRC;                                /**< Output Surface Lower Right Coordinate, offset: 0x60 */
  uint8_t RESERVED_3[12];
  uint32_t OUT_PS_ULC;                             /**< Processed Surface Upper Left Coordinate, offset: 0x70 */
  uint8_t RESERVED_4[12];
  uint32_t OUT_PS_LRC;                             /**< Processed Surface Lower Right Coordinate, offset: 0x80 */
  uint8_t RESERVED_5[12];
  uint32_t OUT_AS_ULC;                             /**< Alpha Surface Upper Left Coordinate, offset: 0x90 */
  uint8_t RESERVED_6[12];
  uint32_t OUT_AS_LRC;                             /**< Alpha Surface Lower Right Coordinate, offset: 0xA0 */
  uint8_t RESERVED_7[12];
  uint32_t PS_CTRL;                                /**< Processed Surface (PS) Control Register, offset: 0xB0 */
  uint32_t PS_CTRL_SET;                            /**< Processed Surface (PS) Control Register, offset: 0xB4 */
  uint32_t PS_CTRL_CLR;                            /**< Processed Surface (PS) Control Register, offset: 0xB8 */
  uint32_t PS_CTRL_TOG;                            /**< Processed Surface (PS) Control Register, offset: 0xBC */
  uint32_t PS_BUF;                                 /**< PS Input Buffer Address, offset: 0xC0 */
  uint8_t RESERVED_8[12];
  uint32_t PS_UBUF;                                /**< PS U/Cb or 2 Plane UV Input Buffer Address, offset: 0xD0 */
  uint8_t RESERVED_9[12];
  uint32_t PS_VBUF;                                /**< PS V/Cr Input Buffer Address, offset: 0xE0 */
  uint8_t RESERVED_10[12];
  uint32_t PS_PITCH;                               /**< Processed Surface Pitch, offset: 0xF0 */
  uint8_t RESERVED_11[12];
  uint32_t PS_BACKGROUND;                          /**< PS Background Color, offset: 0x100 */
  uint8_t RESERVED_12[12];
  uint32_t PS_SCALE;                               /**< PS Scale Factor Register, offset: 0x110 */
  uint8_t RESERVED_13[12];
  uint32_t PS_OFFSET;                              /**< PS Scale Offset Register, offset: 0x120 */
  uint8_t RESERVED_14[12];
  uint32_t PS_CLRKEYLOW;                           /**< PS Color Key Low, offset: 0x130 */
  uint8_t RESERVED_15[12];
  uint32_t PS_CLRKEYHIGH;                          /**< PS Color Key High, offset: 0x140 */
  uint8_t RESERVED_16[12];
  uint32_t AS_CTRL;                                /**< Alpha Surface Control, offset: 0x150 */
  uint8_t RESERVED_17[12];
  uint32_t AS_BUF;                                 /**< Alpha Surface Buffer Pointer, offset: 0x160 */
  uint8_t RESERVED_18[12];
  uint32_t AS_PITCH;                               /**< Alpha Surface Pitch, offset: 0x170 */
  uint8_t RESERVED_19[12];
  uint32_t AS_CLRKEYLOW;                           /**< Overlay Color Key Low, offset: 0x180 */
  uint8_t RESERVED_20[12];
  uint32_t AS_CLRKEYHIGH;                          /**< Overlay Color Key High, offset: 0x190 */
  uint8_t RESERVED_21[12];
  uint32_t CSC1_COEF0;                             /**< Color Space Conversion Coefficient Register 0, offset: 0x1A0 */
  uint8_t RESERVED_22[12];
  uint32_t CSC1_COEF1;                             /**< Color Space Conversion Coefficient Register 1, offset: 0x1B0 */
  uint8_t RESERVED_23[12];
  uint32_t CSC1_COEF2;                             /**< Color Space Conversion Coefficient Register 2, offset: 0x1C0 */
  uint8_t RESERVED_24[348];
  uint32_t POWER;                                  /**< PXP Power Control Register, offset: 0x320 */
  uint8_t RESERVED_25[220];
  uint32_t NEXT;                                   /**< Next Frame Pointer, offset: 0x400 */
  uint8_t RESERVED_26[60];
  uint32_t PORTER_DUFF_CTRL;                       /**< PXP Alpha Engine A Control Register., offset: 0x440 */
} volatile *PXP_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- PXP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PXP_Register_Accessor_Macros PXP - Register accessor macros
 * @{
 */


/* PXP - Register accessors */
#define PXP_CTRL_REG(base)                       ((base)->CTRL)
#define PXP_CTRL_SET_REG(base)                   ((base)->CTRL_SET)
#define PXP_CTRL_CLR_REG(base)                   ((base)->CTRL_CLR)
#define PXP_CTRL_TOG_REG(base)                   ((base)->CTRL_TOG)
#define PXP_STAT_REG(base)                       ((base)->STAT)
#define PXP_STAT_SET_REG(base)                   ((base)->STAT_SET)
#define PXP_STAT_CLR_REG(base)                   ((base)->STAT_CLR)
#define PXP_STAT_TOG_REG(base)                   ((base)->STAT_TOG)
#define PXP_OUT_CTRL_REG(base)                   ((base)->OUT_CTRL)
#define PXP_OUT_CTRL_SET_REG(base)               ((base)->OUT_CTRL_SET)
#define PXP_OUT_CTRL_CLR_REG(base)               ((base)->OUT_CTRL_CLR)
#define PXP_OUT_CTRL_TOG_REG(base)               ((base)->OUT_CTRL_TOG)
#define PXP_OUT_BUF_REG(base)                    ((base)->OUT_BUF)
#define PXP_OUT_BUF2_REG(base)                   ((base)->OUT_BUF2)
#define PXP_OUT_PITCH_REG(base)                  ((base)->OUT_PITCH)
#define PXP_OUT_LRC_REG(base)                    ((base)->OUT_LRC)
#define PXP_OUT_PS_ULC_REG(base)                 ((base)->OUT_PS_ULC)
#define PXP_OUT_PS_LRC_REG(base)                 ((base)->OUT_PS_LRC)
#define PXP_OUT_AS_ULC_REG(base)                 ((base)->OUT_AS_ULC)
#define PXP_OUT_AS_LRC_REG(base)                 ((base)->OUT_AS_LRC)
#define PXP_PS_CTRL_REG(base)                    ((base)->PS_CTRL)
#define PXP_PS_CTRL_SET_REG(base)                ((base)->PS_CTRL_SET)
#define PXP_PS_CTRL_CLR_REG(base)                ((base)->PS_CTRL_CLR)
#define PXP_PS_CTRL_TOG_REG(base)                ((base)->PS_CTRL_TOG)
#define PXP_PS_BUF_REG(base)                     ((base)->PS_BUF)
#define PXP_PS_UBUF_REG(base)                    ((base)->PS_UBUF)
#define PXP_PS_VBUF_REG(base)                    ((base)->PS_VBUF)
#define PXP_PS_PITCH_REG(base)                   ((base)->PS_PITCH)
#define PXP_PS_BACKGROUND_REG(base)              ((base)->PS_BACKGROUND)
#define PXP_PS_SCALE_REG(base)                   ((base)->PS_SCALE)
#define PXP_PS_OFFSET_REG(base)                  ((base)->PS_OFFSET)
#define PXP_PS_CLRKEYLOW_REG(base)               ((base)->PS_CLRKEYLOW)
#define PXP_PS_CLRKEYHIGH_REG(base)              ((base)->PS_CLRKEYHIGH)
#define PXP_AS_CTRL_REG(base)                    ((base)->AS_CTRL)
#define PXP_AS_BUF_REG(base)                     ((base)->AS_BUF)
#define PXP_AS_PITCH_REG(base)                   ((base)->AS_PITCH)
#define PXP_AS_CLRKEYLOW_REG(base)               ((base)->AS_CLRKEYLOW)
#define PXP_AS_CLRKEYHIGH_REG(base)              ((base)->AS_CLRKEYHIGH)
#define PXP_CSC1_COEF0_REG(base)                 ((base)->CSC1_COEF0)
#define PXP_CSC1_COEF1_REG(base)                 ((base)->CSC1_COEF1)
#define PXP_CSC1_COEF2_REG(base)                 ((base)->CSC1_COEF2)
#define PXP_POWER_REG(base)                      ((base)->POWER)
#define PXP_NEXT_REG(base)                       ((base)->NEXT)
#define PXP_PORTER_DUFF_CTRL_REG(base)           ((base)->PORTER_DUFF_CTRL)

/*!
 * @}
 */ /* end of group PXP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- PXP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PXP_Register_Masks PXP Register Masks
 * @{
 */

