AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name PORTER_DUFF_CTRL - PXP Alpha Engine A Control Register. */
#define PXP_PORTER_DUFF_CTRL_POTER_DUFF_ENABLE_MASK (0x1U)
#define PXP_PORTER_DUFF_CTRL_POTER_DUFF_ENABLE_SHIFT (0U)
#define PXP_PORTER_DUFF_CTRL_S0_S1_FACTOR_MODE_MASK (0x6U)
#define PXP_PORTER_DUFF_CTRL_S0_S1_FACTOR_MODE_SHIFT (1U)
#define PXP_PORTER_DUFF_CTRL_S0_S1_FACTOR_MODE(x) (((uint32_t)(((uint32_t)(x)) << PXP_PORTER_DUFF_CTRL_S0_S1_FACTOR_MODE_SHIFT)) & PXP_PORTER_DUFF_CTRL_S0_S1_FACTOR_MODE_MASK)
#define PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MODE_MASK (0x18U)
#define PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MODE_SHIFT (3U)
#define PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MODE_SHIFT)) & PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MODE_MASK)
#define PXP_PORTER_DUFF_CTRL_S0_ALPHA_MODE_MASK  (0x20U)
#define PXP_PORTER_DUFF_CTRL_S0_ALPHA_MODE_SHIFT (5U)
#define PXP_PORTER_DUFF_CTRL_S0_COLOR_MODE_MASK  (0x40U)
#define PXP_PORTER_DUFF_CTRL_S0_COLOR_MODE_SHIFT (6U)
#define PXP_PORTER_DUFF_CTRL_S1_S0_FACTOR_MODE_MASK (0x300U)
#define PXP_PORTER_DUFF_CTRL_S1_S0_FACTOR_MODE_SHIFT (8U)
#define PXP_PORTER_DUFF_CTRL_S1_S0_FACTOR_MODE(x) (((uint32_t)(((uint32_t)(x)) << PXP_PORTER_DUFF_CTRL_S1_S0_FACTOR_MODE_SHIFT)) & PXP_PORTER_DUFF_CTRL_S1_S0_FACTOR_MODE_MASK)
#define PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MODE_MASK (0xC00U)
#define PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MODE_SHIFT (10U)
#define PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MODE_SHIFT)) & PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MODE_MASK)
#define PXP_PORTER_DUFF_CTRL_S1_ALPHA_MODE_MASK  (0x1000U)
#define PXP_PORTER_DUFF_CTRL_S1_ALPHA_MODE_SHIFT (12U)
#define PXP_PORTER_DUFF_CTRL_S1_COLOR_MODE_MASK  (0x2000U)
#define PXP_PORTER_DUFF_CTRL_S1_COLOR_MODE_SHIFT (13U)
#define PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MASK (0xFF0000U)
#define PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_SHIFT (16U)
#define PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA(x)  (((uint32_t)(((uint32_t)(x)) << PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_SHIFT)) & PXP_PORTER_DUFF_CTRL_S0_GLOBAL_ALPHA_MASK)
#define PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MASK (0xFF000000U)
#define PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_SHIFT (24U)
#define PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA(x)  (((uint32_t)(((uint32_t)(x)) << PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_SHIFT)) & PXP_PORTER_DUFF_CTRL_S1_GLOBAL_ALPHA_MASK)


/*!
 * @}
 */ /* end of group PXP_Register_Masks */


/* PXP - Peripheral instance base addresses */
/** Peripheral PXP base pointer */
#define PXP_BASE_PTR                             ((PXP_MemMapPtr)0x402B4000u)
/** Array initializer of PXP peripheral base pointers */
#define PXP_BASE_PTRS                            { PXP_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- PXP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PXP_Register_Accessor_Macros PXP - Register accessor macros
 * @{
 */


/* PXP - Register instance definitions */
/* PXP */
#define PXP_CTRL                                 PXP_CTRL_REG(PXP_BASE_PTR)
#define PXP_CTRL_SET                             PXP_CTRL_SET_REG(PXP_BASE_PTR)
#define PXP_CTRL_CLR                             PXP_CTRL_CLR_REG(PXP_BASE_PTR)
#define PXP_CTRL_TOG                             PXP_CTRL_TOG_REG(PXP_BASE_PTR)
#define PXP_STAT                                 PXP_STAT_REG(PXP_BASE_PTR)
#define PXP_STAT_SET                             PXP_STAT_SET_REG(PXP_BASE_PTR)
#define PXP_STAT_CLR                             PXP_STAT_CLR_REG(PXP_BASE_PTR)
#define PXP_STAT_TOG                             PXP_STAT_TOG_REG(PXP_BASE_PTR)
#define PXP_OUT_CTRL                             PXP_OUT_CTRL_REG(PXP_BASE_PTR)
#define PXP_OUT_CTRL_SET                         PXP_OUT_CTRL_SET_REG(PXP_BASE_PTR)
#define PXP_OUT_CTRL_CLR                         PXP_OUT_CTRL_CLR_REG(PXP_BASE_PTR)
#define PXP_OUT_CTRL_TOG                         PXP_OUT_CTRL_TOG_REG(PXP_BASE_PTR)
#define PXP_OUT_BUF                              PXP_OUT_BUF_REG(PXP_BASE_PTR)
#define PXP_OUT_BUF2                             PXP_OUT_BUF2_REG(PXP_BASE_PTR)
#define PXP_OUT_PITCH                            PXP_OUT_PITCH_REG(PXP_BASE_PTR)
#define PXP_OUT_LRC                              PXP_OUT_LRC_REG(PXP_BASE_PTR)
#define PXP_OUT_PS_ULC                           PXP_OUT_PS_ULC_REG(PXP_BASE_PTR)
#define PXP_OUT_PS_LRC                           PXP_OUT_PS_LRC_REG(PXP_BASE_PTR)
#define PXP_OUT_AS_ULC                           PXP_OUT_AS_ULC_REG(PXP_BASE_PTR)
#define PXP_OUT_AS_LRC                           PXP_OUT_AS_LRC_REG(PXP_BASE_PTR)
#define PXP_PS_CTRL                              PXP_PS_CTRL_REG(PXP_BASE_PTR)
#define PXP_PS_CTRL_SET                          PXP_PS_CTRL_SET_REG(PXP_BASE_PTR)
#define PXP_PS_CTRL_CLR                          PXP_PS_CTRL_CLR_REG(PXP_BASE_PTR)
#define PXP_PS_CTRL_TOG                          PXP_PS_CTRL_TOG_REG(PXP_BASE_PTR)
#define PXP_PS_BUF                               PXP_PS_BUF_REG(PXP_BASE_PTR)
#define PXP_PS_UBUF                              PXP_PS_UBUF_REG(PXP_BASE_PTR)
#define PXP_PS_VBUF                              PXP_PS_VBUF_REG(PXP_BASE_PTR)
#define PXP_PS_PITCH                             PXP_PS_PITCH_REG(PXP_BASE_PTR)
#define PXP_PS_BACKGROUND                        PXP_PS_BACKGROUND_REG(PXP_BASE_PTR)
#define PXP_PS_SCALE                             PXP_PS_SCALE_REG(PXP_BASE_PTR)
#define PXP_PS_OFFSET                            PXP_PS_OFFSET_REG(PXP_BASE_PTR)
#define PXP_PS_CLRKEYLOW                         PXP_PS_CLRKEYLOW_REG(PXP_BASE_PTR)
#define PXP_PS_CLRKEYHIGH                        PXP_PS_CLRKEYHIGH_REG(PXP_BASE_PTR)
#define PXP_AS_CTRL                              PXP_AS_CTRL_REG(PXP_BASE_PTR)
#define PXP_AS_BUF                               PXP_AS_BUF_REG(PXP_BASE_PTR)
#define PXP_AS_PITCH                             PXP_AS_PITCH_REG(PXP_BASE_PTR)
#define PXP_AS_CLRKEYLOW                         PXP_AS_CLRKEYLOW_REG(PXP_BASE_PTR)
#define PXP_AS_CLRKEYHIGH                        PXP_AS_CLRKEYHIGH_REG(PXP_BASE_PTR)
#define PXP_CSC1_COEF0                           PXP_CSC1_COEF0_REG(PXP_BASE_PTR)
#define PXP_CSC1_COEF1                           PXP_CSC1_COEF1_REG(PXP_BASE_PTR)
#define PXP_CSC1_COEF2                           PXP_CSC1_COEF2_REG(PXP_BASE_PTR)
#define PXP_POWER                                PXP_POWER_REG(PXP_BASE_PTR)
#define PXP_NEXT                                 PXP_NEXT_REG(PXP_BASE_PTR)
#define PXP_PORTER_DUFF_CTRL                     PXP_PORTER_DUFF_CTRL_REG(PXP_BASE_PTR)

/*!
 * @}
 */ /* end of group PXP_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group PXP_Peripheral */


/* ----------------------------------------------------------------------------
   -- ROMC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ROMC_Peripheral ROMC
 * @{
 */

