AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/** RTWDOG - Peripheral register structure */
typedef struct RTWDOG_MemMap {
  uint32_t CS;                                     /**< Watchdog Control and Status Register, offset: 0x0 */
  uint32_t CNT;                                    /**< Watchdog Counter Register, offset: 0x4 */
  uint32_t TOVAL;                                  /**< Watchdog Timeout Value Register, offset: 0x8 */
  uint32_t WIN;                                    /**< Watchdog Window Register, offset: 0xC */
} volatile *RTWDOG_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- RTWDOG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTWDOG_Register_Accessor_Macros RTWDOG - Register accessor macros
 * @{
 */


/* RTWDOG - Register accessors */
#define RTWDOG_CS_REG(base)                      ((base)->CS)
#define RTWDOG_CNT_REG(base)                     ((base)->CNT)
#define RTWDOG_TOVAL_REG(base)                   ((base)->TOVAL)
#define RTWDOG_WIN_REG(base)                     ((base)->WIN)

/*!
 * @}
 */ /* end of group RTWDOG_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- RTWDOG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTWDOG_Register_Masks RTWDOG Register Masks
 * @{
 */

/*! @name CS - Watchdog Control and Status Register */
#define RTWDOG_CS_STOP_MASK                      (0x1U)
#define RTWDOG_CS_STOP_SHIFT                     (0U)
#define RTWDOG_CS_WAIT_MASK                      (0x2U)
#define RTWDOG_CS_WAIT_SHIFT                     (1U)
#define RTWDOG_CS_DBG_MASK                       (0x4U)
#define RTWDOG_CS_DBG_SHIFT                      (2U)
#define RTWDOG_CS_TST_MASK                       (0x18U)
#define RTWDOG_CS_TST_SHIFT                      (3U)
#define RTWDOG_CS_TST(x)                         (((uint32_t)(((uint32_t)(x)) << RTWDOG_CS_TST_SHIFT)) & RTWDOG_CS_TST_MASK)
#define RTWDOG_CS_UPDATE_MASK                    (0x20U)
#define RTWDOG_CS_UPDATE_SHIFT                   (5U)
#define RTWDOG_CS_INT_MASK                       (0x40U)
#define RTWDOG_CS_INT_SHIFT                      (6U)
#define RTWDOG_CS_EN_MASK                        (0x80U)
#define RTWDOG_CS_EN_SHIFT                       (7U)
#define RTWDOG_CS_CLK_MASK                       (0x300U)
#define RTWDOG_CS_CLK_SHIFT                      (8U)
#define RTWDOG_CS_CLK(x)                         (((uint32_t)(((uint32_t)(x)) << RTWDOG_CS_CLK_SHIFT)) & RTWDOG_CS_CLK_MASK)
#define RTWDOG_CS_RCS_MASK                       (0x400U)
#define RTWDOG_CS_RCS_SHIFT                      (10U)
#define RTWDOG_CS_ULK_MASK                       (0x800U)
#define RTWDOG_CS_ULK_SHIFT                      (11U)
#define RTWDOG_CS_PRES_MASK                      (0x1000U)
#define RTWDOG_CS_PRES_SHIFT                     (12U)
#define RTWDOG_CS_CMD32EN_MASK                   (0x2000U)
#define RTWDOG_CS_CMD32EN_SHIFT                  (13U)
#define RTWDOG_CS_FLG_MASK                       (0x4000U)
#define RTWDOG_CS_FLG_SHIFT                      (14U)
#define RTWDOG_CS_WIN_MASK                       (0x8000U)
#define RTWDOG_CS_WIN_SHIFT                      (15U)

/*! @name CNT - Watchdog Counter Register */
#define RTWDOG_CNT_CNTLOW_MASK                   (0xFFU)
#define RTWDOG_CNT_CNTLOW_SHIFT                  (0U)
#define RTWDOG_CNT_CNTLOW(x)                     (((uint32_t)(((uint32_t)(x)) << RTWDOG_CNT_CNTLOW_SHIFT)) & RTWDOG_CNT_CNTLOW_MASK)
#define RTWDOG_CNT_CNTHIGH_MASK                  (0xFF00U)
#define RTWDOG_CNT_CNTHIGH_SHIFT                 (8U)
#define RTWDOG_CNT_CNTHIGH(x)                    (((uint32_t)(((uint32_t)(x)) << RTWDOG_CNT_CNTHIGH_SHIFT)) & RTWDOG_CNT_CNTHIGH_MASK)

/*! @name TOVAL - Watchdog Timeout Value Register */
#define RTWDOG_TOVAL_TOVALLOW_MASK               (0xFFU)
#define RTWDOG_TOVAL_TOVALLOW_SHIFT              (0U)
#define RTWDOG_TOVAL_TOVALLOW(x)                 (((uint32_t)(((uint32_t)(x)) << RTWDOG_TOVAL_TOVALLOW_SHIFT)) & RTWDOG_TOVAL_TOVALLOW_MASK)
#define RTWDOG_TOVAL_TOVALHIGH_MASK              (0xFF00U)
#define RTWDOG_TOVAL_TOVALHIGH_SHIFT             (8U)
#define RTWDOG_TOVAL_TOVALHIGH(x)                (((uint32_t)(((uint32_t)(x)) << RTWDOG_TOVAL_TOVALHIGH_SHIFT)) & RTWDOG_TOVAL_TOVALHIGH_MASK)

/*! @name WIN - Watchdog Window Register */
#define RTWDOG_WIN_WINLOW_MASK                   (0xFFU)
#define RTWDOG_WIN_WINLOW_SHIFT                  (0U)
#define RTWDOG_WIN_WINLOW(x)                     (((uint32_t)(((uint32_t)(x)) << RTWDOG_WIN_WINLOW_SHIFT)) & RTWDOG_WIN_WINLOW_MASK)
#define RTWDOG_WIN_WINHIGH_MASK                  (0xFF00U)
#define RTWDOG_WIN_WINHIGH_SHIFT                 (8U)
#define RTWDOG_WIN_WINHIGH(x)                    (((uint32_t)(((uint32_t)(x)) << RTWDOG_WIN_WINHIGH_SHIFT)) & RTWDOG_WIN_WINHIGH_MASK)


/*!
 * @}
 */ /* end of group RTWDOG_Register_Masks */


/* RTWDOG - Peripheral instance base addresses */
/** Peripheral RTWDOG base pointer */
#define RTWDOG_BASE_PTR                          ((RTWDOG_MemMapPtr)0x400BC000u)
/** Array initializer of RTWDOG peripheral base pointers */
#define RTWDOG_BASE_PTRS                         { RTWDOG_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- RTWDOG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTWDOG_Register_Accessor_Macros RTWDOG - Register accessor macros
 * @{
 */


/* RTWDOG - Register instance definitions */
/* RTWDOG */
#define RTWDOG_CS                                RTWDOG_CS_REG(RTWDOG_BASE_PTR)
#define RTWDOG_CNT                               RTWDOG_CNT_REG(RTWDOG_BASE_PTR)
#define RTWDOG_TOVAL                             RTWDOG_TOVAL_REG(RTWDOG_BASE_PTR)
#define RTWDOG_WIN                               RTWDOG_WIN_REG(RTWDOG_BASE_PTR)

/*!
 * @}
 */ /* end of group RTWDOG_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group RTWDOG_Peripheral */


/* ----------------------------------------------------------------------------
   -- SCB
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCB_Peripheral SCB
 * @{
 */

/** SCB - Peripheral register structure */
typedef struct SCB_MemMap {
  uint8_t RESERVED_0[8];
  uint32_t ACTLR;                                  /**< Auxiliary Control Register,, offset: 0x8 */
  uint8_t RESERVED_1[3316];
  uint32_t CPUID;                                  /**< CPUID Base Register, offset: 0xD00 */
  uint32_t ICSR;                                   /**< Interrupt Control and State Register, offset: 0xD04 */
  uint32_t VTOR;                                   /**< Vector Table Offset Register, offset: 0xD08 */
  uint32_t AIRCR;                                  /**< Application Interrupt and Reset Control Register, offset: 0xD0C */
  uint32_t SCR;                                    /**< System Control Register, offset: 0xD10 */
  uint32_t CCR;                                    /**< Configuration and Control Register, offset: 0xD14 */
  uint32_t SHPR1;                                  /**< System Handler Priority Register 1, offset: 0xD18 */
  uint32_t SHPR2;                                  /**< System Handler Priority Register 2, offset: 0xD1C */
  uint32_t SHPR3;                                  /**< System Handler Priority Register 3, offset: 0xD20 */
  uint32_t SHCSR;                                  /**< System Handler Control and State Register, offset: 0xD24 */
  uint32_t CFSR;                                   /**< Configurable Fault Status Register, offset: 0xD28 */
  uint32_t HFSR;                                   /**< HardFault Status register, offset: 0xD2C */
  uint32_t DFSR;                                   /**< Debug Fault Status Register, offset: 0xD30 */
  uint32_t MMFAR;                                  /**< MemManage Fault Address Register, offset: 0xD34 */
  uint32_t BFAR;                                   /**< BusFault Address Register, offset: 0xD38 */
  uint8_t RESERVED_2[4];
  uint32_t ID_PFR0;                                /**< Processor Feature Register 0, offset: 0xD40 */
  uint32_t ID_PFR1;                                /**< Processor Feature Register 1, offset: 0xD44 */
  uint32_t ID_DFR0;                                /**< Debug Feature Register, offset: 0xD48 */
  uint32_t ID_AFR0;                                /**< Auxiliary Feature Register, offset: 0xD4C */
  uint32_t ID_MMFR0;                               /**< Memory Model Feature Register 0, offset: 0xD50 */
  uint32_t ID_MMFR1;                               /**< Memory Model Feature Register 1, offset: 0xD54 */
  uint32_t ID_MMFR2;                               /**< Memory Model Feature Register 2, offset: 0xD58 */
  uint32_t ID_MMFR3;                               /**< Memory Model Feature Register 3, offset: 0xD5C */
  uint32_t ID_ISAR0;                               /**< Instruction Set Attributes Register 0, offset: 0xD60 */
  uint32_t ID_ISAR1;                               /**< Instruction Set Attributes Register 1, offset: 0xD64 */
  uint32_t ID_ISAR2;                               /**< Instruction Set Attributes Register 2, offset: 0xD68 */
  uint32_t ID_ISAR3;                               /**< Instruction Set Attributes Register 3, offset: 0xD6C */
  uint32_t ID_ISAR4;                               /**< Instruction Set Attributes Register 4, offset: 0xD70 */
  uint8_t RESERVED_3[4];
  uint32_t CLIDR;                                  /**< Cache Level ID register, offset: 0xD78 */
  uint32_t CTR;                                    /**< Cache Type register, offset: 0xD7C */
  uint32_t CCSIDR;                                 /**< Cache Size ID Register, offset: 0xD80 */
  uint32_t CSSELR;                                 /**< Cache Size Selection Register, offset: 0xD84 */
  uint32_t CPACR;                                  /**< Coprocessor Access Control Register, offset: 0xD88 */
  uint8_t RESERVED_4[372];
  uint32_t STIR;                                   /**< Instruction cache invalidate all to Point of Unification (PoU), offset: 0xF00 */
  uint8_t RESERVED_5[76];
  uint32_t ICIALLU;                                /**< Instruction cache invalidate all to Point of Unification (PoU), offset: 0xF50 */
  uint8_t RESERVED_6[4];
  uint32_t ICIMVAU;                                /**< Instruction cache invalidate by address to PoU, offset: 0xF58 */
  uint32_t DCIMVAC;                                /**< Data cache invalidate by address to Point of Coherency (PoC), offset: 0xF5C */
  uint32_t DCISW;                                  /**< Data cache invalidate by set/way, offset: 0xF60 */
  uint32_t DCCMVAU;                                /**< Data cache by address to PoU, offset: 0xF64 */
  uint32_t DCCMVAC;                                /**< Data cache clean by address to PoC, offset: 0xF68 */
  uint32_t DCCSW;                                  /**< Data cache clean by set/way, offset: 0xF6C */
  uint32_t DCCIMVAC;                               /**< Data cache clean and invalidate by address to PoC, offset: 0xF70 */
  uint32_t DCCISW;                                 /**< Data cache clean and invalidate by set/way, offset: 0xF74 */
  uint8_t RESERVED_7[24];
  uint32_t CM7_ITCMCR;                             /**< Instruction Tightly-Coupled Memory Control Register, offset: 0xF90 */
  uint32_t CM7_DTCMCR;                             /**< Data Tightly-Coupled Memory Control Register, offset: 0xF94 */
  uint32_t CM7_AHBPCR;                             /**< AHBP Control Register, offset: 0xF98 */
  uint32_t CM7_CACR;                               /**< L1 Cache Control Register, offset: 0xF9C */
  uint32_t CM7_AHBSCR;                             /**< AHB Slave Control Register, offset: 0xFA0 */
  uint8_t RESERVED_8[4];
  uint32_t CM7_ABFSR;                              /**< Auxiliary Bus Fault Status Register, offset: 0xFA8 */
} volatile *SCB_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- SCB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCB_Register_Accessor_Macros SCB - Register accessor macros
 * @{
 */


/* SCB - Register accessors */
#define SCB_ACTLR_REG(base)                      ((base)->ACTLR)
#define SCB_CPUID_REG(base)                      ((base)->CPUID)
#define SCB_ICSR_REG(base)                       ((base)->ICSR)
#define SCB_VTOR_REG(base)                       ((base)->VTOR)
#define SCB_AIRCR_REG(base)                      ((base)->AIRCR)
#define SCB_SCR_REG(base)                        ((base)->SCR)
#define SCB_CCR_REG(base)                        ((base)->CCR)
#define SCB_SHPR1_REG(base)                      ((base)->SHPR1)
#define SCB_SHPR2_REG(base)                      ((base)->SHPR2)
#define SCB_SHPR3_REG(base)                      ((base)->SHPR3)
#define SCB_SHCSR_REG(base)                      ((base)->SHCSR)
#define SCB_CFSR_REG(base)                       ((base)->CFSR)
#define SCB_HFSR_REG(base)                       ((base)->HFSR)
#define SCB_DFSR_REG(base)                       ((base)->DFSR)
#define SCB_MMFAR_REG(base)                      ((base)->MMFAR)
#define SCB_BFAR_REG(base)                       ((base)->BFAR)
#define SCB_ID_PFR0_REG(base)                    ((base)->ID_PFR0)
#define SCB_ID_PFR1_REG(base)                    ((base)->ID_PFR1)
#define SCB_ID_DFR0_REG(base)                    ((base)->ID_DFR0)
#define SCB_ID_AFR0_REG(base)                    ((base)->ID_AFR0)
#define SCB_ID_MMFR0_REG(base)                   ((base)->ID_MMFR0)
#define SCB_ID_MMFR1_REG(base)                   ((base)->ID_MMFR1)
#define SCB_ID_MMFR2_REG(base)                   ((base)->ID_MMFR2)
#define SCB_ID_MMFR3_REG(base)                   ((base)->ID_MMFR3)
#define SCB_ID_ISAR0_REG(base)                   ((base)->ID_ISAR0)
#define SCB_ID_ISAR1_REG(base)                   ((base)->ID_ISAR1)
#define SCB_ID_ISAR2_REG(base)                   ((base)->ID_ISAR2)
#define SCB_ID_ISAR3_REG(base)                   ((base)->ID_ISAR3)
#define SCB_ID_ISAR4_REG(base)                   ((base)->ID_ISAR4)
#define SCB_CLIDR_REG(base)                      ((base)->CLIDR)
#define SCB_CTR_REG(base)                        ((base)->CTR)
#define SCB_CCSIDR_REG(base)                     ((base)->CCSIDR)
#define SCB_CSSELR_REG(base)                     ((base)->CSSELR)
#define SCB_CPACR_REG(base)                      ((base)->CPACR)
#define SCB_STIR_REG(base)                       ((base)->STIR)
#define SCB_ICIALLU_REG(base)                    ((base)->ICIALLU)
#define SCB_ICIMVAU_REG(base)                    ((base)->ICIMVAU)
#define SCB_DCIMVAC_REG(base)                    ((base)->DCIMVAC)
#define SCB_DCISW_REG(base)                      ((base)->DCISW)
#define SCB_DCCMVAU_REG(base)                    ((base)->DCCMVAU)
#define SCB_DCCMVAC_REG(base)                    ((base)->DCCMVAC)
#define SCB_DCCSW_REG(base)                      ((base)->DCCSW)
#define SCB_DCCIMVAC_REG(base)                   ((base)->DCCIMVAC)
#define SCB_DCCISW_REG(base)                     ((base)->DCCISW)
#define SCB_CM7_ITCMCR_REG(base)                 ((base)->CM7_ITCMCR)
#define SCB_CM7_DTCMCR_REG(base)                 ((base)->CM7_DTCMCR)
#define SCB_CM7_AHBPCR_REG(base)                 ((base)->CM7_AHBPCR)
#define SCB_CM7_CACR_REG(base)                   ((base)->CM7_CACR)
#define SCB_CM7_AHBSCR_REG(base)                 ((base)->CM7_AHBSCR)
#define SCB_CM7_ABFSR_REG(base)                  ((base)->CM7_ABFSR)

/*!
 * @}
 */ /* end of group SCB_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- SCB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCB_Register_Masks SCB Register Masks
 * @{
 */

/*! @name ACTLR - Auxiliary Control Register, */
#define SCB_ACTLR_DISFOLD_MASK                   (0x4U)
#define SCB_ACTLR_DISFOLD_SHIFT                  (2U)
#define SCB_ACTLR_FPEXCODIS_MASK                 (0x400U)
#define SCB_ACTLR_FPEXCODIS_SHIFT                (10U)
#define SCB_ACTLR_DISRAMODE_MASK                 (0x800U)
#define SCB_ACTLR_DISRAMODE_SHIFT                (11U)
#define SCB_ACTLR_DISITMATBFLUSH_MASK            (0x1000U)
#define SCB_ACTLR_DISITMATBFLUSH_SHIFT           (12U)
#define SCB_ACTLR_DISBTACREAD_MASK               (0x2000U)
#define SCB_ACTLR_DISBTACREAD_SHIFT              (13U)
#define SCB_ACTLR_DISBTACALLOC_MASK              (0x4000U)
#define SCB_ACTLR_DISBTACALLOC_SHIFT             (14U)
#define SCB_ACTLR_DISCRITAXIRUR_MASK             (0x8000U)
#define SCB_ACTLR_DISCRITAXIRUR_SHIFT            (15U)
#define SCB_ACTLR_DISDI_MASK                     (0x1F0000U)
#define SCB_ACTLR_DISDI_SHIFT                    (16U)
#define SCB_ACTLR_DISDI(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_ACTLR_DISDI_SHIFT)) & SCB_ACTLR_DISDI_MASK)
#define SCB_ACTLR_DISISSCH1_MASK                 (0x3E00000U)
#define SCB_ACTLR_DISISSCH1_SHIFT                (21U)
#define SCB_ACTLR_DISISSCH1(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_ACTLR_DISISSCH1_SHIFT)) & SCB_ACTLR_DISISSCH1_MASK)
#define SCB_ACTLR_DISDYNADD_MASK                 (0x4000000U)
#define SCB_ACTLR_DISDYNADD_SHIFT                (26U)
#define SCB_ACTLR_DISCRITAXIRUW_MASK             (0x8000000U)
#define SCB_ACTLR_DISCRITAXIRUW_SHIFT            (27U)
#define SCB_ACTLR_DISFPUISSOPT_MASK              (0x10000000U)
#define SCB_ACTLR_DISFPUISSOPT_SHIFT             (28U)

/*! @name CPUID - CPUID Base Register */
#define SCB_CPUID_REVISION_MASK                  (0xFU)
#define SCB_CPUID_REVISION_SHIFT                 (0U)
#define SCB_CPUID_REVISION(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_CPUID_REVISION_SHIFT)) & SCB_CPUID_REVISION_MASK)
#define SCB_CPUID_PARTNO_MASK                    (0xFFF0U)
#define SCB_CPUID_PARTNO_SHIFT                   (4U)
#define SCB_CPUID_PARTNO(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_CPUID_PARTNO_SHIFT)) & SCB_CPUID_PARTNO_MASK)
#define SCB_CPUID_ARCHITECTURE_MASK              (0xF0000U)
#define SCB_CPUID_ARCHITECTURE_SHIFT             (16U)
#define SCB_CPUID_ARCHITECTURE(x)                (((uint32_t)(((uint32_t)(x)) << SCB_CPUID_ARCHITECTURE_SHIFT)) & SCB_CPUID_ARCHITECTURE_MASK)
#define SCB_CPUID_VARIANT_MASK                   (0xF00000U)
#define SCB_CPUID_VARIANT_SHIFT                  (20U)
#define SCB_CPUID_VARIANT(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_CPUID_VARIANT_SHIFT)) & SCB_CPUID_VARIANT_MASK)
#define SCB_CPUID_IMPLEMENTER_MASK               (0xFF000000U)
#define SCB_CPUID_IMPLEMENTER_SHIFT              (24U)
#define SCB_CPUID_IMPLEMENTER(x)                 (((uint32_t)(((uint32_t)(x)) << SCB_CPUID_IMPLEMENTER_SHIFT)) & SCB_CPUID_IMPLEMENTER_MASK)

/*! @name ICSR - Interrupt Control and State Register */
#define SCB_ICSR_VECTACTIVE_MASK                 (0x1FFU)
#define SCB_ICSR_VECTACTIVE_SHIFT                (0U)
#define SCB_ICSR_VECTACTIVE(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_ICSR_VECTACTIVE_SHIFT)) & SCB_ICSR_VECTACTIVE_MASK)
#define SCB_ICSR_RETTOBASE_MASK                  (0x800U)
#define SCB_ICSR_RETTOBASE_SHIFT                 (11U)
#define SCB_ICSR_VECTPENDING_MASK                (0x1FF000U)
#define SCB_ICSR_VECTPENDING_SHIFT               (12U)
#define SCB_ICSR_VECTPENDING(x)                  (((uint32_t)(((uint32_t)(x)) << SCB_ICSR_VECTPENDING_SHIFT)) & SCB_ICSR_VECTPENDING_MASK)
#define SCB_ICSR_ISRPENDING_MASK                 (0x400000U)
#define SCB_ICSR_ISRPENDING_SHIFT                (22U)
#define SCB_ICSR_PENDSTCLR_MASK                  (0x2000000U)
#define SCB_ICSR_PENDSTCLR_SHIFT                 (25U)
#define SCB_ICSR_PENDSTSET_MASK                  (0x4000000U)
#define SCB_ICSR_PENDSTSET_SHIFT                 (26U)
#define SCB_ICSR_PENDSVCLR_MASK                  (0x8000000U)
#define SCB_ICSR_PENDSVCLR_SHIFT                 (27U)
#define SCB_ICSR_PENDSVSET_MASK                  (0x10000000U)
#define SCB_ICSR_PENDSVSET_SHIFT                 (28U)
#define SCB_ICSR_NMIPENDSET_MASK                 (0x80000000U)
#define SCB_ICSR_NMIPENDSET_SHIFT                (31U)

/*! @name VTOR - Vector Table Offset Register */
#define SCB_VTOR_TBLOFF_MASK                     (0xFFFFFF80U)
#define SCB_VTOR_TBLOFF_SHIFT                    (7U)
#define SCB_VTOR_TBLOFF(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_VTOR_TBLOFF_SHIFT)) & SCB_VTOR_TBLOFF_MASK)

