AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name AIRCR - Application Interrupt and Reset Control Register */
#define SCB_AIRCR_VECTRESET_MASK                 (0x1U)
#define SCB_AIRCR_VECTRESET_SHIFT                (0U)
#define SCB_AIRCR_VECTCLRACTIVE_MASK             (0x2U)
#define SCB_AIRCR_VECTCLRACTIVE_SHIFT            (1U)
#define SCB_AIRCR_SYSRESETREQ_MASK               (0x4U)
#define SCB_AIRCR_SYSRESETREQ_SHIFT              (2U)
#define SCB_AIRCR_PRIGROUP_MASK                  (0x700U)
#define SCB_AIRCR_PRIGROUP_SHIFT                 (8U)
#define SCB_AIRCR_PRIGROUP(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_AIRCR_PRIGROUP_SHIFT)) & SCB_AIRCR_PRIGROUP_MASK)
#define SCB_AIRCR_ENDIANNESS_MASK                (0x8000U)
#define SCB_AIRCR_ENDIANNESS_SHIFT               (15U)
#define SCB_AIRCR_VECTKEY_MASK                   (0xFFFF0000U)
#define SCB_AIRCR_VECTKEY_SHIFT                  (16U)
#define SCB_AIRCR_VECTKEY(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_AIRCR_VECTKEY_SHIFT)) & SCB_AIRCR_VECTKEY_MASK)

/*! @name SCR - System Control Register */
#define SCB_SCR_SLEEPONEXIT_MASK                 (0x2U)
#define SCB_SCR_SLEEPONEXIT_SHIFT                (1U)
#define SCB_SCR_SLEEPDEEP_MASK                   (0x4U)
#define SCB_SCR_SLEEPDEEP_SHIFT                  (2U)
#define SCB_SCR_SEVONPEND_MASK                   (0x10U)
#define SCB_SCR_SEVONPEND_SHIFT                  (4U)

/*! @name CCR - Configuration and Control Register */
#define SCB_CCR_NONBASETHRDENA_MASK              (0x1U)
#define SCB_CCR_NONBASETHRDENA_SHIFT             (0U)
#define SCB_CCR_USERSETMPEND_MASK                (0x2U)
#define SCB_CCR_USERSETMPEND_SHIFT               (1U)
#define SCB_CCR_UNALIGN_TRP_MASK                 (0x8U)
#define SCB_CCR_UNALIGN_TRP_SHIFT                (3U)
#define SCB_CCR_DIV_0_TRP_MASK                   (0x10U)
#define SCB_CCR_DIV_0_TRP_SHIFT                  (4U)
#define SCB_CCR_BFHFNMIGN_MASK                   (0x100U)
#define SCB_CCR_BFHFNMIGN_SHIFT                  (8U)
#define SCB_CCR_STKALIGN_MASK                    (0x200U)
#define SCB_CCR_STKALIGN_SHIFT                   (9U)
#define SCB_CCR_DC_MASK                          (0x10000U)
#define SCB_CCR_DC_SHIFT                         (16U)
#define SCB_CCR_IC_MASK                          (0x20000U)
#define SCB_CCR_IC_SHIFT                         (17U)
#define SCB_CCR_BP_MASK                          (0x40000U)
#define SCB_CCR_BP_SHIFT                         (18U)

/*! @name SHPR1 - System Handler Priority Register 1 */
#define SCB_SHPR1_PRI_4_MASK                     (0xFFU)
#define SCB_SHPR1_PRI_4_SHIFT                    (0U)
#define SCB_SHPR1_PRI_4(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_SHPR1_PRI_4_SHIFT)) & SCB_SHPR1_PRI_4_MASK)
#define SCB_SHPR1_PRI_5_MASK                     (0xFF00U)
#define SCB_SHPR1_PRI_5_SHIFT                    (8U)
#define SCB_SHPR1_PRI_5(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_SHPR1_PRI_5_SHIFT)) & SCB_SHPR1_PRI_5_MASK)
#define SCB_SHPR1_PRI_6_MASK                     (0xFF0000U)
#define SCB_SHPR1_PRI_6_SHIFT                    (16U)
#define SCB_SHPR1_PRI_6(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_SHPR1_PRI_6_SHIFT)) & SCB_SHPR1_PRI_6_MASK)

/*! @name SHPR2 - System Handler Priority Register 2 */
#define SCB_SHPR2_PRI_11_MASK                    (0xFF000000U)
#define SCB_SHPR2_PRI_11_SHIFT                   (24U)
#define SCB_SHPR2_PRI_11(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_SHPR2_PRI_11_SHIFT)) & SCB_SHPR2_PRI_11_MASK)

/*! @name SHPR3 - System Handler Priority Register 3 */
#define SCB_SHPR3_PRI_14_MASK                    (0xFF0000U)
#define SCB_SHPR3_PRI_14_SHIFT                   (16U)
#define SCB_SHPR3_PRI_14(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_SHPR3_PRI_14_SHIFT)) & SCB_SHPR3_PRI_14_MASK)
#define SCB_SHPR3_PRI_15_MASK                    (0xFF000000U)
#define SCB_SHPR3_PRI_15_SHIFT                   (24U)
#define SCB_SHPR3_PRI_15(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_SHPR3_PRI_15_SHIFT)) & SCB_SHPR3_PRI_15_MASK)

/*! @name SHCSR - System Handler Control and State Register */
#define SCB_SHCSR_MEMFAULTACT_MASK               (0x1U)
#define SCB_SHCSR_MEMFAULTACT_SHIFT              (0U)
#define SCB_SHCSR_BUSFAULTACT_MASK               (0x2U)
#define SCB_SHCSR_BUSFAULTACT_SHIFT              (1U)
#define SCB_SHCSR_USGFAULTACT_MASK               (0x8U)
#define SCB_SHCSR_USGFAULTACT_SHIFT              (3U)
#define SCB_SHCSR_SVCALLACT_MASK                 (0x80U)
#define SCB_SHCSR_SVCALLACT_SHIFT                (7U)
#define SCB_SHCSR_MONITORACT_MASK                (0x100U)
#define SCB_SHCSR_MONITORACT_SHIFT               (8U)
#define SCB_SHCSR_PENDSVACT_MASK                 (0x400U)
#define SCB_SHCSR_PENDSVACT_SHIFT                (10U)
#define SCB_SHCSR_SYSTICKACT_MASK                (0x800U)
#define SCB_SHCSR_SYSTICKACT_SHIFT               (11U)
#define SCB_SHCSR_USGFAULTPENDED_MASK            (0x1000U)
#define SCB_SHCSR_USGFAULTPENDED_SHIFT           (12U)
#define SCB_SHCSR_MEMFAULTPENDED_MASK            (0x2000U)
#define SCB_SHCSR_MEMFAULTPENDED_SHIFT           (13U)
#define SCB_SHCSR_BUSFAULTPENDED_MASK            (0x4000U)
#define SCB_SHCSR_BUSFAULTPENDED_SHIFT           (14U)
#define SCB_SHCSR_SVCALLPENDED_MASK              (0x8000U)
#define SCB_SHCSR_SVCALLPENDED_SHIFT             (15U)
#define SCB_SHCSR_MEMFAULTENA_MASK               (0x10000U)
#define SCB_SHCSR_MEMFAULTENA_SHIFT              (16U)
#define SCB_SHCSR_BUSFAULTENA_MASK               (0x20000U)
#define SCB_SHCSR_BUSFAULTENA_SHIFT              (17U)
#define SCB_SHCSR_USGFAULTENA_MASK               (0x40000U)
#define SCB_SHCSR_USGFAULTENA_SHIFT              (18U)

/*! @name CFSR - Configurable Fault Status Register */
#define SCB_CFSR_IACCVIOL_MASK                   (0x1U)
#define SCB_CFSR_IACCVIOL_SHIFT                  (0U)
#define SCB_CFSR_DACCVIOL_MASK                   (0x2U)
#define SCB_CFSR_DACCVIOL_SHIFT                  (1U)
#define SCB_CFSR_MUNSTKERR_MASK                  (0x8U)
#define SCB_CFSR_MUNSTKERR_SHIFT                 (3U)
#define SCB_CFSR_MSTKERR_MASK                    (0x10U)
#define SCB_CFSR_MSTKERR_SHIFT                   (4U)
#define SCB_CFSR_MLSPERR_MASK                    (0x20U)
#define SCB_CFSR_MLSPERR_SHIFT                   (5U)
#define SCB_CFSR_MMARVALID_MASK                  (0x80U)
#define SCB_CFSR_MMARVALID_SHIFT                 (7U)
#define SCB_CFSR_IBUSERR_MASK                    (0x100U)
#define SCB_CFSR_IBUSERR_SHIFT                   (8U)
#define SCB_CFSR_PRECISERR_MASK                  (0x200U)
#define SCB_CFSR_PRECISERR_SHIFT                 (9U)
#define SCB_CFSR_IMPRECISERR_MASK                (0x400U)
#define SCB_CFSR_IMPRECISERR_SHIFT               (10U)
#define SCB_CFSR_UNSTKERR_MASK                   (0x800U)
#define SCB_CFSR_UNSTKERR_SHIFT                  (11U)
#define SCB_CFSR_STKERR_MASK                     (0x1000U)
#define SCB_CFSR_STKERR_SHIFT                    (12U)
#define SCB_CFSR_LSPERR_MASK                     (0x2000U)
#define SCB_CFSR_LSPERR_SHIFT                    (13U)
#define SCB_CFSR_BFARVALID_MASK                  (0x8000U)
#define SCB_CFSR_BFARVALID_SHIFT                 (15U)
#define SCB_CFSR_UNDEFINSTR_MASK                 (0x10000U)
#define SCB_CFSR_UNDEFINSTR_SHIFT                (16U)
#define SCB_CFSR_INVSTATE_MASK                   (0x20000U)
#define SCB_CFSR_INVSTATE_SHIFT                  (17U)
#define SCB_CFSR_INVPC_MASK                      (0x40000U)
#define SCB_CFSR_INVPC_SHIFT                     (18U)
#define SCB_CFSR_NOCP_MASK                       (0x80000U)
#define SCB_CFSR_NOCP_SHIFT                      (19U)
#define SCB_CFSR_UNALIGNED_MASK                  (0x1000000U)
#define SCB_CFSR_UNALIGNED_SHIFT                 (24U)
#define SCB_CFSR_DIVBYZERO_MASK                  (0x2000000U)
#define SCB_CFSR_DIVBYZERO_SHIFT                 (25U)

/*! @name HFSR - HardFault Status register */
#define SCB_HFSR_VECTTBL_MASK                    (0x2U)
#define SCB_HFSR_VECTTBL_SHIFT                   (1U)
#define SCB_HFSR_FORCED_MASK                     (0x40000000U)
#define SCB_HFSR_FORCED_SHIFT                    (30U)
#define SCB_HFSR_DEBUGEVT_MASK                   (0x80000000U)
#define SCB_HFSR_DEBUGEVT_SHIFT                  (31U)

