AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name DFSR - Debug Fault Status Register */
#define SCB_DFSR_HALTED_MASK                     (0x1U)
#define SCB_DFSR_HALTED_SHIFT                    (0U)
#define SCB_DFSR_BKPT_MASK                       (0x2U)
#define SCB_DFSR_BKPT_SHIFT                      (1U)
#define SCB_DFSR_DWTTRAP_MASK                    (0x4U)
#define SCB_DFSR_DWTTRAP_SHIFT                   (2U)
#define SCB_DFSR_VCATCH_MASK                     (0x8U)
#define SCB_DFSR_VCATCH_SHIFT                    (3U)
#define SCB_DFSR_EXTERNAL_MASK                   (0x10U)
#define SCB_DFSR_EXTERNAL_SHIFT                  (4U)

/*! @name MMFAR - MemManage Fault Address Register */
#define SCB_MMFAR_ADDRESS_MASK                   (0xFFFFFFFFU)
#define SCB_MMFAR_ADDRESS_SHIFT                  (0U)
#define SCB_MMFAR_ADDRESS(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_MMFAR_ADDRESS_SHIFT)) & SCB_MMFAR_ADDRESS_MASK)

/*! @name BFAR - BusFault Address Register */
#define SCB_BFAR_ADDRESS_MASK                    (0xFFFFFFFFU)
#define SCB_BFAR_ADDRESS_SHIFT                   (0U)
#define SCB_BFAR_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_BFAR_ADDRESS_SHIFT)) & SCB_BFAR_ADDRESS_MASK)

/*! @name ID_PFR0 - Processor Feature Register 0 */
#define SCB_ID_PFR0_STATE0_MASK                  (0xFU)
#define SCB_ID_PFR0_STATE0_SHIFT                 (0U)
#define SCB_ID_PFR0_STATE0(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_ID_PFR0_STATE0_SHIFT)) & SCB_ID_PFR0_STATE0_MASK)
#define SCB_ID_PFR0_STATE1_MASK                  (0xF0U)
#define SCB_ID_PFR0_STATE1_SHIFT                 (4U)
#define SCB_ID_PFR0_STATE1(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_ID_PFR0_STATE1_SHIFT)) & SCB_ID_PFR0_STATE1_MASK)
#define SCB_ID_PFR0_STATE2_MASK                  (0xF00U)
#define SCB_ID_PFR0_STATE2_SHIFT                 (8U)
#define SCB_ID_PFR0_STATE2(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_ID_PFR0_STATE2_SHIFT)) & SCB_ID_PFR0_STATE2_MASK)
#define SCB_ID_PFR0_STATE3_MASK                  (0xF000U)
#define SCB_ID_PFR0_STATE3_SHIFT                 (12U)
#define SCB_ID_PFR0_STATE3(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_ID_PFR0_STATE3_SHIFT)) & SCB_ID_PFR0_STATE3_MASK)

/*! @name ID_PFR1 - Processor Feature Register 1 */
#define SCB_ID_PFR1_PROGMODEL_MASK               (0xF00U)
#define SCB_ID_PFR1_PROGMODEL_SHIFT              (8U)
#define SCB_ID_PFR1_PROGMODEL(x)                 (((uint32_t)(((uint32_t)(x)) << SCB_ID_PFR1_PROGMODEL_SHIFT)) & SCB_ID_PFR1_PROGMODEL_MASK)

/*! @name ID_DFR0 - Debug Feature Register */
#define SCB_ID_DFR0_DEBUGMODEL_MASK              (0xF00000U)
#define SCB_ID_DFR0_DEBUGMODEL_SHIFT             (20U)
#define SCB_ID_DFR0_DEBUGMODEL(x)                (((uint32_t)(((uint32_t)(x)) << SCB_ID_DFR0_DEBUGMODEL_SHIFT)) & SCB_ID_DFR0_DEBUGMODEL_MASK)

/*! @name ID_AFR0 - Auxiliary Feature Register */
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED0_MASK (0xFU)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED0_SHIFT (0U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED0(x)   (((uint32_t)(((uint32_t)(x)) << SCB_ID_AFR0_IMPLEMENTATION_DEFINED0_SHIFT)) & SCB_ID_AFR0_IMPLEMENTATION_DEFINED0_MASK)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED1_MASK (0xF0U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED1_SHIFT (4U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED1(x)   (((uint32_t)(((uint32_t)(x)) << SCB_ID_AFR0_IMPLEMENTATION_DEFINED1_SHIFT)) & SCB_ID_AFR0_IMPLEMENTATION_DEFINED1_MASK)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED2_MASK (0xF00U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED2_SHIFT (8U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED2(x)   (((uint32_t)(((uint32_t)(x)) << SCB_ID_AFR0_IMPLEMENTATION_DEFINED2_SHIFT)) & SCB_ID_AFR0_IMPLEMENTATION_DEFINED2_MASK)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED3_MASK (0xF000U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED3_SHIFT (12U)
#define SCB_ID_AFR0_IMPLEMENTATION_DEFINED3(x)   (((uint32_t)(((uint32_t)(x)) << SCB_ID_AFR0_IMPLEMENTATION_DEFINED3_SHIFT)) & SCB_ID_AFR0_IMPLEMENTATION_DEFINED3_MASK)

/*! @name ID_MMFR0 - Memory Model Feature Register 0 */
#define SCB_ID_MMFR0_PMSASUPPORT_MASK            (0xF0U)
#define SCB_ID_MMFR0_PMSASUPPORT_SHIFT           (4U)
#define SCB_ID_MMFR0_PMSASUPPORT(x)              (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR0_PMSASUPPORT_SHIFT)) & SCB_ID_MMFR0_PMSASUPPORT_MASK)
#define SCB_ID_MMFR0_OUTERMOST_SHAREABILITY_MASK (0xF00U)
#define SCB_ID_MMFR0_OUTERMOST_SHAREABILITY_SHIFT (8U)
#define SCB_ID_MMFR0_OUTERMOST_SHAREABILITY(x)   (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR0_OUTERMOST_SHAREABILITY_SHIFT)) & SCB_ID_MMFR0_OUTERMOST_SHAREABILITY_MASK)
#define SCB_ID_MMFR0_SHAREABILITY_LEVELS_MASK    (0xF000U)
#define SCB_ID_MMFR0_SHAREABILITY_LEVELS_SHIFT   (12U)
#define SCB_ID_MMFR0_SHAREABILITY_LEVELS(x)      (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR0_SHAREABILITY_LEVELS_SHIFT)) & SCB_ID_MMFR0_SHAREABILITY_LEVELS_MASK)
#define SCB_ID_MMFR0_TCM_SUPPORT_MASK            (0xF0000U)
#define SCB_ID_MMFR0_TCM_SUPPORT_SHIFT           (16U)
#define SCB_ID_MMFR0_TCM_SUPPORT(x)              (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR0_TCM_SUPPORT_SHIFT)) & SCB_ID_MMFR0_TCM_SUPPORT_MASK)
#define SCB_ID_MMFR0_AUXILIARY_REGISTERS_MASK    (0xF00000U)
#define SCB_ID_MMFR0_AUXILIARY_REGISTERS_SHIFT   (20U)
#define SCB_ID_MMFR0_AUXILIARY_REGISTERS(x)      (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR0_AUXILIARY_REGISTERS_SHIFT)) & SCB_ID_MMFR0_AUXILIARY_REGISTERS_MASK)

/*! @name ID_MMFR1 - Memory Model Feature Register 1 */
#define SCB_ID_MMFR1_ID_MMFR1_MASK               (0xFFFFFFFFU)
#define SCB_ID_MMFR1_ID_MMFR1_SHIFT              (0U)
#define SCB_ID_MMFR1_ID_MMFR1(x)                 (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR1_ID_MMFR1_SHIFT)) & SCB_ID_MMFR1_ID_MMFR1_MASK)

/*! @name ID_MMFR2 - Memory Model Feature Register 2 */
#define SCB_ID_MMFR2_WFI_STALL_MASK              (0xF000000U)
#define SCB_ID_MMFR2_WFI_STALL_SHIFT             (24U)
#define SCB_ID_MMFR2_WFI_STALL(x)                (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR2_WFI_STALL_SHIFT)) & SCB_ID_MMFR2_WFI_STALL_MASK)

/*! @name ID_MMFR3 - Memory Model Feature Register 3 */
#define SCB_ID_MMFR3_ID_MMFR3_MASK               (0xFFFFFFFFU)
#define SCB_ID_MMFR3_ID_MMFR3_SHIFT              (0U)
#define SCB_ID_MMFR3_ID_MMFR3(x)                 (((uint32_t)(((uint32_t)(x)) << SCB_ID_MMFR3_ID_MMFR3_SHIFT)) & SCB_ID_MMFR3_ID_MMFR3_MASK)

/*! @name ID_ISAR0 - Instruction Set Attributes Register 0 */
#define SCB_ID_ISAR0_BITCOUNT_INSTRS_MASK        (0xF0U)
#define SCB_ID_ISAR0_BITCOUNT_INSTRS_SHIFT       (4U)
#define SCB_ID_ISAR0_BITCOUNT_INSTRS(x)          (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR0_BITCOUNT_INSTRS_SHIFT)) & SCB_ID_ISAR0_BITCOUNT_INSTRS_MASK)
#define SCB_ID_ISAR0_BITFIELD_INSTRS_MASK        (0xF00U)
#define SCB_ID_ISAR0_BITFIELD_INSTRS_SHIFT       (8U)
#define SCB_ID_ISAR0_BITFIELD_INSTRS(x)          (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR0_BITFIELD_INSTRS_SHIFT)) & SCB_ID_ISAR0_BITFIELD_INSTRS_MASK)
#define SCB_ID_ISAR0_CMPBRANCH_INSTRS_MASK       (0xF000U)
#define SCB_ID_ISAR0_CMPBRANCH_INSTRS_SHIFT      (12U)
#define SCB_ID_ISAR0_CMPBRANCH_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR0_CMPBRANCH_INSTRS_SHIFT)) & SCB_ID_ISAR0_CMPBRANCH_INSTRS_MASK)
#define SCB_ID_ISAR0_COPROC_INSTRS_MASK          (0xF0000U)
#define SCB_ID_ISAR0_COPROC_INSTRS_SHIFT         (16U)
#define SCB_ID_ISAR0_COPROC_INSTRS(x)            (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR0_COPROC_INSTRS_SHIFT)) & SCB_ID_ISAR0_COPROC_INSTRS_MASK)
#define SCB_ID_ISAR0_DEBUG_INSTRS_MASK           (0xF00000U)
#define SCB_ID_ISAR0_DEBUG_INSTRS_SHIFT          (20U)
#define SCB_ID_ISAR0_DEBUG_INSTRS(x)             (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR0_DEBUG_INSTRS_SHIFT)) & SCB_ID_ISAR0_DEBUG_INSTRS_MASK)
#define SCB_ID_ISAR0_DIVIDE_INSTRS_MASK          (0xF000000U)
#define SCB_ID_ISAR0_DIVIDE_INSTRS_SHIFT         (24U)
#define SCB_ID_ISAR0_DIVIDE_INSTRS(x)            (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR0_DIVIDE_INSTRS_SHIFT)) & SCB_ID_ISAR0_DIVIDE_INSTRS_MASK)

/*! @name ID_ISAR1 - Instruction Set Attributes Register 1 */
#define SCB_ID_ISAR1_EXTEND_INSTRS_MASK          (0xF000U)
#define SCB_ID_ISAR1_EXTEND_INSTRS_SHIFT         (12U)
#define SCB_ID_ISAR1_EXTEND_INSTRS(x)            (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR1_EXTEND_INSTRS_SHIFT)) & SCB_ID_ISAR1_EXTEND_INSTRS_MASK)
#define SCB_ID_ISAR1_IFTHEN_INSTRS_MASK          (0xF0000U)
#define SCB_ID_ISAR1_IFTHEN_INSTRS_SHIFT         (16U)
#define SCB_ID_ISAR1_IFTHEN_INSTRS(x)            (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR1_IFTHEN_INSTRS_SHIFT)) & SCB_ID_ISAR1_IFTHEN_INSTRS_MASK)
#define SCB_ID_ISAR1_IMMEDIATE_INSTRS_MASK       (0xF00000U)
#define SCB_ID_ISAR1_IMMEDIATE_INSTRS_SHIFT      (20U)
#define SCB_ID_ISAR1_IMMEDIATE_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR1_IMMEDIATE_INSTRS_SHIFT)) & SCB_ID_ISAR1_IMMEDIATE_INSTRS_MASK)
#define SCB_ID_ISAR1_INTERWORK_INSTRS_MASK       (0xF000000U)
#define SCB_ID_ISAR1_INTERWORK_INSTRS_SHIFT      (24U)
#define SCB_ID_ISAR1_INTERWORK_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR1_INTERWORK_INSTRS_SHIFT)) & SCB_ID_ISAR1_INTERWORK_INSTRS_MASK)

/*! @name ID_ISAR2 - Instruction Set Attributes Register 2 */
#define SCB_ID_ISAR2_LOADSTORE_INSTRS_MASK       (0xFU)
#define SCB_ID_ISAR2_LOADSTORE_INSTRS_SHIFT      (0U)
#define SCB_ID_ISAR2_LOADSTORE_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_LOADSTORE_INSTRS_SHIFT)) & SCB_ID_ISAR2_LOADSTORE_INSTRS_MASK)
#define SCB_ID_ISAR2_MEMHINT_INSTRS_MASK         (0xF0U)
#define SCB_ID_ISAR2_MEMHINT_INSTRS_SHIFT        (4U)
#define SCB_ID_ISAR2_MEMHINT_INSTRS(x)           (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_MEMHINT_INSTRS_SHIFT)) & SCB_ID_ISAR2_MEMHINT_INSTRS_MASK)
#define SCB_ID_ISAR2_MULTIACCESSINT_INSTRS_MASK  (0xF00U)
#define SCB_ID_ISAR2_MULTIACCESSINT_INSTRS_SHIFT (8U)
#define SCB_ID_ISAR2_MULTIACCESSINT_INSTRS(x)    (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_MULTIACCESSINT_INSTRS_SHIFT)) & SCB_ID_ISAR2_MULTIACCESSINT_INSTRS_MASK)
#define SCB_ID_ISAR2_MULT_INSTRS_MASK            (0xF000U)
#define SCB_ID_ISAR2_MULT_INSTRS_SHIFT           (12U)
#define SCB_ID_ISAR2_MULT_INSTRS(x)              (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_MULT_INSTRS_SHIFT)) & SCB_ID_ISAR2_MULT_INSTRS_MASK)
#define SCB_ID_ISAR2_MULTS_INSTRS_MASK           (0xF0000U)
#define SCB_ID_ISAR2_MULTS_INSTRS_SHIFT          (16U)
#define SCB_ID_ISAR2_MULTS_INSTRS(x)             (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_MULTS_INSTRS_SHIFT)) & SCB_ID_ISAR2_MULTS_INSTRS_MASK)
#define SCB_ID_ISAR2_MULTU_INSTRS_MASK           (0xF00000U)
#define SCB_ID_ISAR2_MULTU_INSTRS_SHIFT          (20U)
#define SCB_ID_ISAR2_MULTU_INSTRS(x)             (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_MULTU_INSTRS_SHIFT)) & SCB_ID_ISAR2_MULTU_INSTRS_MASK)
#define SCB_ID_ISAR2_REVERSAL_INSTRS_MASK        (0xF0000000U)
#define SCB_ID_ISAR2_REVERSAL_INSTRS_SHIFT       (28U)
#define SCB_ID_ISAR2_REVERSAL_INSTRS(x)          (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR2_REVERSAL_INSTRS_SHIFT)) & SCB_ID_ISAR2_REVERSAL_INSTRS_MASK)

/*! @name ID_ISAR3 - Instruction Set Attributes Register 3 */
#define SCB_ID_ISAR3_SATURATE_INSTRS_MASK        (0xFU)
#define SCB_ID_ISAR3_SATURATE_INSTRS_SHIFT       (0U)
#define SCB_ID_ISAR3_SATURATE_INSTRS(x)          (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_SATURATE_INSTRS_SHIFT)) & SCB_ID_ISAR3_SATURATE_INSTRS_MASK)
#define SCB_ID_ISAR3_SIMD_INSTRS_MASK            (0xF0U)
#define SCB_ID_ISAR3_SIMD_INSTRS_SHIFT           (4U)
#define SCB_ID_ISAR3_SIMD_INSTRS(x)              (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_SIMD_INSTRS_SHIFT)) & SCB_ID_ISAR3_SIMD_INSTRS_MASK)
#define SCB_ID_ISAR3_SVC_INSTRS_MASK             (0xF00U)
#define SCB_ID_ISAR3_SVC_INSTRS_SHIFT            (8U)
#define SCB_ID_ISAR3_SVC_INSTRS(x)               (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_SVC_INSTRS_SHIFT)) & SCB_ID_ISAR3_SVC_INSTRS_MASK)
#define SCB_ID_ISAR3_SYNCHPRIM_INSTRS_MASK       (0xF000U)
#define SCB_ID_ISAR3_SYNCHPRIM_INSTRS_SHIFT      (12U)
#define SCB_ID_ISAR3_SYNCHPRIM_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_SYNCHPRIM_INSTRS_SHIFT)) & SCB_ID_ISAR3_SYNCHPRIM_INSTRS_MASK)
#define SCB_ID_ISAR3_TABBRANCH_INSTRS_MASK       (0xF0000U)
#define SCB_ID_ISAR3_TABBRANCH_INSTRS_SHIFT      (16U)
#define SCB_ID_ISAR3_TABBRANCH_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_TABBRANCH_INSTRS_SHIFT)) & SCB_ID_ISAR3_TABBRANCH_INSTRS_MASK)
#define SCB_ID_ISAR3_THUMBCOPY_INSTRS_MASK       (0xF00000U)
#define SCB_ID_ISAR3_THUMBCOPY_INSTRS_SHIFT      (20U)
#define SCB_ID_ISAR3_THUMBCOPY_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_THUMBCOPY_INSTRS_SHIFT)) & SCB_ID_ISAR3_THUMBCOPY_INSTRS_MASK)
#define SCB_ID_ISAR3_TRUENOP_INSTRS_MASK         (0xF000000U)
#define SCB_ID_ISAR3_TRUENOP_INSTRS_SHIFT        (24U)
#define SCB_ID_ISAR3_TRUENOP_INSTRS(x)           (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR3_TRUENOP_INSTRS_SHIFT)) & SCB_ID_ISAR3_TRUENOP_INSTRS_MASK)

/*! @name ID_ISAR4 - Instruction Set Attributes Register 4 */
#define SCB_ID_ISAR4_UNPRIV_INSTRS_MASK          (0xFU)
#define SCB_ID_ISAR4_UNPRIV_INSTRS_SHIFT         (0U)
#define SCB_ID_ISAR4_UNPRIV_INSTRS(x)            (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR4_UNPRIV_INSTRS_SHIFT)) & SCB_ID_ISAR4_UNPRIV_INSTRS_MASK)
#define SCB_ID_ISAR4_WITHSHIFTS_INSTRS_MASK      (0xF0U)
#define SCB_ID_ISAR4_WITHSHIFTS_INSTRS_SHIFT     (4U)
#define SCB_ID_ISAR4_WITHSHIFTS_INSTRS(x)        (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR4_WITHSHIFTS_INSTRS_SHIFT)) & SCB_ID_ISAR4_WITHSHIFTS_INSTRS_MASK)
#define SCB_ID_ISAR4_WRITEBACK_INSTRS_MASK       (0xF00U)
#define SCB_ID_ISAR4_WRITEBACK_INSTRS_SHIFT      (8U)
#define SCB_ID_ISAR4_WRITEBACK_INSTRS(x)         (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR4_WRITEBACK_INSTRS_SHIFT)) & SCB_ID_ISAR4_WRITEBACK_INSTRS_MASK)
#define SCB_ID_ISAR4_BARRIER_INSTRS_MASK         (0xF0000U)
#define SCB_ID_ISAR4_BARRIER_INSTRS_SHIFT        (16U)
#define SCB_ID_ISAR4_BARRIER_INSTRS(x)           (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR4_BARRIER_INSTRS_SHIFT)) & SCB_ID_ISAR4_BARRIER_INSTRS_MASK)
#define SCB_ID_ISAR4_SYNCHPRIM_INSTRS_FRAC_MASK  (0xF00000U)
#define SCB_ID_ISAR4_SYNCHPRIM_INSTRS_FRAC_SHIFT (20U)
#define SCB_ID_ISAR4_SYNCHPRIM_INSTRS_FRAC(x)    (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR4_SYNCHPRIM_INSTRS_FRAC_SHIFT)) & SCB_ID_ISAR4_SYNCHPRIM_INSTRS_FRAC_MASK)
#define SCB_ID_ISAR4_PSR_M_INSTRS_MASK           (0xF000000U)
#define SCB_ID_ISAR4_PSR_M_INSTRS_SHIFT          (24U)
#define SCB_ID_ISAR4_PSR_M_INSTRS(x)             (((uint32_t)(((uint32_t)(x)) << SCB_ID_ISAR4_PSR_M_INSTRS_SHIFT)) & SCB_ID_ISAR4_PSR_M_INSTRS_MASK)

/*! @name CLIDR - Cache Level ID register */
#define SCB_CLIDR_CL1_MASK                       (0x7U)
#define SCB_CLIDR_CL1_SHIFT                      (0U)
#define SCB_CLIDR_CL1(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL1_SHIFT)) & SCB_CLIDR_CL1_MASK)
#define SCB_CLIDR_CL2_MASK                       (0x38U)
#define SCB_CLIDR_CL2_SHIFT                      (3U)
#define SCB_CLIDR_CL2(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL2_SHIFT)) & SCB_CLIDR_CL2_MASK)
#define SCB_CLIDR_CL3_MASK                       (0x1C0U)
#define SCB_CLIDR_CL3_SHIFT                      (6U)
#define SCB_CLIDR_CL3(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL3_SHIFT)) & SCB_CLIDR_CL3_MASK)
#define SCB_CLIDR_CL4_MASK                       (0xE00U)
#define SCB_CLIDR_CL4_SHIFT                      (9U)
#define SCB_CLIDR_CL4(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL4_SHIFT)) & SCB_CLIDR_CL4_MASK)
#define SCB_CLIDR_CL5_MASK                       (0x7000U)
#define SCB_CLIDR_CL5_SHIFT                      (12U)
#define SCB_CLIDR_CL5(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL5_SHIFT)) & SCB_CLIDR_CL5_MASK)
#define SCB_CLIDR_CL6_MASK                       (0x38000U)
#define SCB_CLIDR_CL6_SHIFT                      (15U)
#define SCB_CLIDR_CL6(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL6_SHIFT)) & SCB_CLIDR_CL6_MASK)
#define SCB_CLIDR_CL7_MASK                       (0x1C0000U)
#define SCB_CLIDR_CL7_SHIFT                      (18U)
#define SCB_CLIDR_CL7(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_CL7_SHIFT)) & SCB_CLIDR_CL7_MASK)
#define SCB_CLIDR_LOUIS_MASK                     (0xE00000U)
#define SCB_CLIDR_LOUIS_SHIFT                    (21U)
#define SCB_CLIDR_LOUIS(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_LOUIS_SHIFT)) & SCB_CLIDR_LOUIS_MASK)
#define SCB_CLIDR_LOC_MASK                       (0x7000000U)
#define SCB_CLIDR_LOC_SHIFT                      (24U)
#define SCB_CLIDR_LOC(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_LOC_SHIFT)) & SCB_CLIDR_LOC_MASK)
#define SCB_CLIDR_LOU_MASK                       (0x38000000U)
#define SCB_CLIDR_LOU_SHIFT                      (27U)
#define SCB_CLIDR_LOU(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CLIDR_LOU_SHIFT)) & SCB_CLIDR_LOU_MASK)

/*! @name CTR - Cache Type register */
#define SCB_CTR_IMINLINE_MASK                    (0xFU)
#define SCB_CTR_IMINLINE_SHIFT                   (0U)
#define SCB_CTR_IMINLINE(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_CTR_IMINLINE_SHIFT)) & SCB_CTR_IMINLINE_MASK)
#define SCB_CTR_DMINLINE_MASK                    (0xF0000U)
#define SCB_CTR_DMINLINE_SHIFT                   (16U)
#define SCB_CTR_DMINLINE(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_CTR_DMINLINE_SHIFT)) & SCB_CTR_DMINLINE_MASK)
#define SCB_CTR_ERG_MASK                         (0xF00000U)
#define SCB_CTR_ERG_SHIFT                        (20U)
#define SCB_CTR_ERG(x)                           (((uint32_t)(((uint32_t)(x)) << SCB_CTR_ERG_SHIFT)) & SCB_CTR_ERG_MASK)
#define SCB_CTR_CWG_MASK                         (0xF000000U)
#define SCB_CTR_CWG_SHIFT                        (24U)
#define SCB_CTR_CWG(x)                           (((uint32_t)(((uint32_t)(x)) << SCB_CTR_CWG_SHIFT)) & SCB_CTR_CWG_MASK)
#define SCB_CTR_FORMAT_MASK                      (0xE0000000U)
#define SCB_CTR_FORMAT_SHIFT                     (29U)
#define SCB_CTR_FORMAT(x)                        (((uint32_t)(((uint32_t)(x)) << SCB_CTR_FORMAT_SHIFT)) & SCB_CTR_FORMAT_MASK)

/*! @name CCSIDR - Cache Size ID Register */
#define SCB_CCSIDR_LINESIZE_MASK                 (0x7U)
#define SCB_CCSIDR_LINESIZE_SHIFT                (0U)
#define SCB_CCSIDR_LINESIZE(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_CCSIDR_LINESIZE_SHIFT)) & SCB_CCSIDR_LINESIZE_MASK)
#define SCB_CCSIDR_ASSOCIATIVITY_MASK            (0x1FF8U)
#define SCB_CCSIDR_ASSOCIATIVITY_SHIFT           (3U)
#define SCB_CCSIDR_ASSOCIATIVITY(x)              (((uint32_t)(((uint32_t)(x)) << SCB_CCSIDR_ASSOCIATIVITY_SHIFT)) & SCB_CCSIDR_ASSOCIATIVITY_MASK)
#define SCB_CCSIDR_NUMSETS_MASK                  (0xFFFE000U)
#define SCB_CCSIDR_NUMSETS_SHIFT                 (13U)
#define SCB_CCSIDR_NUMSETS(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_CCSIDR_NUMSETS_SHIFT)) & SCB_CCSIDR_NUMSETS_MASK)
#define SCB_CCSIDR_WA_MASK                       (0x10000000U)
#define SCB_CCSIDR_WA_SHIFT                      (28U)
#define SCB_CCSIDR_RA_MASK                       (0x20000000U)
#define SCB_CCSIDR_RA_SHIFT                      (29U)
#define SCB_CCSIDR_WB_MASK                       (0x40000000U)
#define SCB_CCSIDR_WB_SHIFT                      (30U)
#define SCB_CCSIDR_WT_MASK                       (0x80000000U)
#define SCB_CCSIDR_WT_SHIFT                      (31U)

