AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name CSSELR - Cache Size Selection Register */
#define SCB_CSSELR_IND_MASK                      (0x1U)
#define SCB_CSSELR_IND_SHIFT                     (0U)
#define SCB_CSSELR_LEVEL_MASK                    (0xEU)
#define SCB_CSSELR_LEVEL_SHIFT                   (1U)
#define SCB_CSSELR_LEVEL(x)                      (((uint32_t)(((uint32_t)(x)) << SCB_CSSELR_LEVEL_SHIFT)) & SCB_CSSELR_LEVEL_MASK)

/*! @name CPACR - Coprocessor Access Control Register */
#define SCB_CPACR_CP0_MASK                       (0x3U)
#define SCB_CPACR_CP0_SHIFT                      (0U)
#define SCB_CPACR_CP0(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP0_SHIFT)) & SCB_CPACR_CP0_MASK)
#define SCB_CPACR_CP1_MASK                       (0xCU)
#define SCB_CPACR_CP1_SHIFT                      (2U)
#define SCB_CPACR_CP1(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP1_SHIFT)) & SCB_CPACR_CP1_MASK)
#define SCB_CPACR_CP2_MASK                       (0x30U)
#define SCB_CPACR_CP2_SHIFT                      (4U)
#define SCB_CPACR_CP2(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP2_SHIFT)) & SCB_CPACR_CP2_MASK)
#define SCB_CPACR_CP3_MASK                       (0xC0U)
#define SCB_CPACR_CP3_SHIFT                      (6U)
#define SCB_CPACR_CP3(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP3_SHIFT)) & SCB_CPACR_CP3_MASK)
#define SCB_CPACR_CP4_MASK                       (0x300U)
#define SCB_CPACR_CP4_SHIFT                      (8U)
#define SCB_CPACR_CP4(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP4_SHIFT)) & SCB_CPACR_CP4_MASK)
#define SCB_CPACR_CP5_MASK                       (0xC00U)
#define SCB_CPACR_CP5_SHIFT                      (10U)
#define SCB_CPACR_CP5(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP5_SHIFT)) & SCB_CPACR_CP5_MASK)
#define SCB_CPACR_CP6_MASK                       (0x3000U)
#define SCB_CPACR_CP6_SHIFT                      (12U)
#define SCB_CPACR_CP6(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP6_SHIFT)) & SCB_CPACR_CP6_MASK)
#define SCB_CPACR_CP7_MASK                       (0xC000U)
#define SCB_CPACR_CP7_SHIFT                      (14U)
#define SCB_CPACR_CP7(x)                         (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP7_SHIFT)) & SCB_CPACR_CP7_MASK)
#define SCB_CPACR_CP10_MASK                      (0x300000U)
#define SCB_CPACR_CP10_SHIFT                     (20U)
#define SCB_CPACR_CP10(x)                        (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP10_SHIFT)) & SCB_CPACR_CP10_MASK)
#define SCB_CPACR_CP11_MASK                      (0xC00000U)
#define SCB_CPACR_CP11_SHIFT                     (22U)
#define SCB_CPACR_CP11(x)                        (((uint32_t)(((uint32_t)(x)) << SCB_CPACR_CP11_SHIFT)) & SCB_CPACR_CP11_MASK)

/*! @name STIR - Instruction cache invalidate all to Point of Unification (PoU) */
#define SCB_STIR_INTID_MASK                      (0x1FFU)
#define SCB_STIR_INTID_SHIFT                     (0U)
#define SCB_STIR_INTID(x)                        (((uint32_t)(((uint32_t)(x)) << SCB_STIR_INTID_SHIFT)) & SCB_STIR_INTID_MASK)

/*! @name ICIALLU - Instruction cache invalidate all to Point of Unification (PoU) */
#define SCB_ICIALLU_ICIALLU_MASK                 (0xFFFFFFFFU)
#define SCB_ICIALLU_ICIALLU_SHIFT                (0U)
#define SCB_ICIALLU_ICIALLU(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_ICIALLU_ICIALLU_SHIFT)) & SCB_ICIALLU_ICIALLU_MASK)

/*! @name ICIMVAU - Instruction cache invalidate by address to PoU */
#define SCB_ICIMVAU_ICIMVAU_MASK                 (0xFFFFFFFFU)
#define SCB_ICIMVAU_ICIMVAU_SHIFT                (0U)
#define SCB_ICIMVAU_ICIMVAU(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_ICIMVAU_ICIMVAU_SHIFT)) & SCB_ICIMVAU_ICIMVAU_MASK)

/*! @name DCIMVAC - Data cache invalidate by address to Point of Coherency (PoC) */
#define SCB_DCIMVAC_DCIMVAC_MASK                 (0xFFFFFFFFU)
#define SCB_DCIMVAC_DCIMVAC_SHIFT                (0U)
#define SCB_DCIMVAC_DCIMVAC(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_DCIMVAC_DCIMVAC_SHIFT)) & SCB_DCIMVAC_DCIMVAC_MASK)

/*! @name DCISW - Data cache invalidate by set/way */
#define SCB_DCISW_DCISW_MASK                     (0xFFFFFFFFU)
#define SCB_DCISW_DCISW_SHIFT                    (0U)
#define SCB_DCISW_DCISW(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_DCISW_DCISW_SHIFT)) & SCB_DCISW_DCISW_MASK)

/*! @name DCCMVAU - Data cache by address to PoU */
#define SCB_DCCMVAU_DCCMVAU_MASK                 (0xFFFFFFFFU)
#define SCB_DCCMVAU_DCCMVAU_SHIFT                (0U)
#define SCB_DCCMVAU_DCCMVAU(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_DCCMVAU_DCCMVAU_SHIFT)) & SCB_DCCMVAU_DCCMVAU_MASK)

/*! @name DCCMVAC - Data cache clean by address to PoC */
#define SCB_DCCMVAC_DCCMVAC_MASK                 (0xFFFFFFFFU)
#define SCB_DCCMVAC_DCCMVAC_SHIFT                (0U)
#define SCB_DCCMVAC_DCCMVAC(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_DCCMVAC_DCCMVAC_SHIFT)) & SCB_DCCMVAC_DCCMVAC_MASK)

/*! @name DCCSW - Data cache clean by set/way */
#define SCB_DCCSW_DCCSW_MASK                     (0xFFFFFFFFU)
#define SCB_DCCSW_DCCSW_SHIFT                    (0U)
#define SCB_DCCSW_DCCSW(x)                       (((uint32_t)(((uint32_t)(x)) << SCB_DCCSW_DCCSW_SHIFT)) & SCB_DCCSW_DCCSW_MASK)

/*! @name DCCIMVAC - Data cache clean and invalidate by address to PoC */
#define SCB_DCCIMVAC_DCCIMVAC_MASK               (0xFFFFFFFFU)
#define SCB_DCCIMVAC_DCCIMVAC_SHIFT              (0U)
#define SCB_DCCIMVAC_DCCIMVAC(x)                 (((uint32_t)(((uint32_t)(x)) << SCB_DCCIMVAC_DCCIMVAC_SHIFT)) & SCB_DCCIMVAC_DCCIMVAC_MASK)

/*! @name DCCISW - Data cache clean and invalidate by set/way */
#define SCB_DCCISW_DCCISW_MASK                   (0xFFFFFFFFU)
#define SCB_DCCISW_DCCISW_SHIFT                  (0U)
#define SCB_DCCISW_DCCISW(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_DCCISW_DCCISW_SHIFT)) & SCB_DCCISW_DCCISW_MASK)

/*! @name CM7_ITCMCR - Instruction Tightly-Coupled Memory Control Register */
#define SCB_CM7_ITCMCR_EN_MASK                   (0x1U)
#define SCB_CM7_ITCMCR_EN_SHIFT                  (0U)
#define SCB_CM7_ITCMCR_RMW_MASK                  (0x2U)
#define SCB_CM7_ITCMCR_RMW_SHIFT                 (1U)
#define SCB_CM7_ITCMCR_RETEN_MASK                (0x4U)
#define SCB_CM7_ITCMCR_RETEN_SHIFT               (2U)
#define SCB_CM7_ITCMCR_SZ_MASK                   (0x78U)
#define SCB_CM7_ITCMCR_SZ_SHIFT                  (3U)
#define SCB_CM7_ITCMCR_SZ(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_CM7_ITCMCR_SZ_SHIFT)) & SCB_CM7_ITCMCR_SZ_MASK)

/*! @name CM7_DTCMCR - Data Tightly-Coupled Memory Control Register */
#define SCB_CM7_DTCMCR_EN_MASK                   (0x1U)
#define SCB_CM7_DTCMCR_EN_SHIFT                  (0U)
#define SCB_CM7_DTCMCR_RMW_MASK                  (0x2U)
#define SCB_CM7_DTCMCR_RMW_SHIFT                 (1U)
#define SCB_CM7_DTCMCR_RETEN_MASK                (0x4U)
#define SCB_CM7_DTCMCR_RETEN_SHIFT               (2U)
#define SCB_CM7_DTCMCR_SZ_MASK                   (0x78U)
#define SCB_CM7_DTCMCR_SZ_SHIFT                  (3U)
#define SCB_CM7_DTCMCR_SZ(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_CM7_DTCMCR_SZ_SHIFT)) & SCB_CM7_DTCMCR_SZ_MASK)

/*! @name CM7_AHBPCR - AHBP Control Register */
#define SCB_CM7_AHBPCR_EN_MASK                   (0x1U)
#define SCB_CM7_AHBPCR_EN_SHIFT                  (0U)
#define SCB_CM7_AHBPCR_SZ_MASK                   (0xEU)
#define SCB_CM7_AHBPCR_SZ_SHIFT                  (1U)
#define SCB_CM7_AHBPCR_SZ(x)                     (((uint32_t)(((uint32_t)(x)) << SCB_CM7_AHBPCR_SZ_SHIFT)) & SCB_CM7_AHBPCR_SZ_MASK)

/*! @name CM7_CACR - L1 Cache Control Register */
#define SCB_CM7_CACR_SIWT_MASK                   (0x1U)
#define SCB_CM7_CACR_SIWT_SHIFT                  (0U)
#define SCB_CM7_CACR_ECCDIS_MASK                 (0x2U)
#define SCB_CM7_CACR_ECCDIS_SHIFT                (1U)
#define SCB_CM7_CACR_FORCEWT_MASK                (0x4U)
#define SCB_CM7_CACR_FORCEWT_SHIFT               (2U)

