AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name CM7_AHBSCR - AHB Slave Control Register */
#define SCB_CM7_AHBSCR_CTL_MASK                  (0x3U)
#define SCB_CM7_AHBSCR_CTL_SHIFT                 (0U)
#define SCB_CM7_AHBSCR_CTL(x)                    (((uint32_t)(((uint32_t)(x)) << SCB_CM7_AHBSCR_CTL_SHIFT)) & SCB_CM7_AHBSCR_CTL_MASK)
#define SCB_CM7_AHBSCR_TPRI_MASK                 (0x7FCU)
#define SCB_CM7_AHBSCR_TPRI_SHIFT                (2U)
#define SCB_CM7_AHBSCR_TPRI(x)                   (((uint32_t)(((uint32_t)(x)) << SCB_CM7_AHBSCR_TPRI_SHIFT)) & SCB_CM7_AHBSCR_TPRI_MASK)
#define SCB_CM7_AHBSCR_INITCOUNT_MASK            (0xF800U)
#define SCB_CM7_AHBSCR_INITCOUNT_SHIFT           (11U)
#define SCB_CM7_AHBSCR_INITCOUNT(x)              (((uint32_t)(((uint32_t)(x)) << SCB_CM7_AHBSCR_INITCOUNT_SHIFT)) & SCB_CM7_AHBSCR_INITCOUNT_MASK)

/*! @name CM7_ABFSR - Auxiliary Bus Fault Status Register */
#define SCB_CM7_ABFSR_ITCM_MASK                  (0x1U)
#define SCB_CM7_ABFSR_ITCM_SHIFT                 (0U)
#define SCB_CM7_ABFSR_DTCM_MASK                  (0x2U)
#define SCB_CM7_ABFSR_DTCM_SHIFT                 (1U)
#define SCB_CM7_ABFSR_AHBP_MASK                  (0x4U)
#define SCB_CM7_ABFSR_AHBP_SHIFT                 (2U)
#define SCB_CM7_ABFSR_AXIM_MASK                  (0x8U)
#define SCB_CM7_ABFSR_AXIM_SHIFT                 (3U)
#define SCB_CM7_ABFSR_EPPB_MASK                  (0x10U)
#define SCB_CM7_ABFSR_EPPB_SHIFT                 (4U)
#define SCB_CM7_ABFSR_AXIMTYPE_MASK              (0x300U)
#define SCB_CM7_ABFSR_AXIMTYPE_SHIFT             (8U)
#define SCB_CM7_ABFSR_AXIMTYPE(x)                (((uint32_t)(((uint32_t)(x)) << SCB_CM7_ABFSR_AXIMTYPE_SHIFT)) & SCB_CM7_ABFSR_AXIMTYPE_MASK)


/*!
 * @}
 */ /* end of group SCB_Register_Masks */


/* SCB - Peripheral instance base addresses */
/** Peripheral SystemControl base pointer */
#define SystemControl_BASE_PTR                   ((SCB_MemMapPtr)0xE000E000u)
/** Array initializer of SCB peripheral base pointers */
#define SCB_BASE_PTRS                            { SystemControl_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- SCB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCB_Register_Accessor_Macros SCB - Register accessor macros
 * @{
 */


/* SCB - Register instance definitions */
/* SystemControl */
#define SCB_ACTLR                                SCB_ACTLR_REG(SystemControl_BASE_PTR)
#define SCB_CPUID                                SCB_CPUID_REG(SystemControl_BASE_PTR)
#define SCB_ICSR                                 SCB_ICSR_REG(SystemControl_BASE_PTR)
#define SCB_VTOR                                 SCB_VTOR_REG(SystemControl_BASE_PTR)
#define SCB_AIRCR                                SCB_AIRCR_REG(SystemControl_BASE_PTR)
#define SCB_SCR                                  SCB_SCR_REG(SystemControl_BASE_PTR)
#define SCB_CCR                                  SCB_CCR_REG(SystemControl_BASE_PTR)
#define SCB_SHPR1                                SCB_SHPR1_REG(SystemControl_BASE_PTR)
#define SCB_SHPR2                                SCB_SHPR2_REG(SystemControl_BASE_PTR)
#define SCB_SHPR3                                SCB_SHPR3_REG(SystemControl_BASE_PTR)
#define SCB_SHCSR                                SCB_SHCSR_REG(SystemControl_BASE_PTR)
#define SCB_CFSR                                 SCB_CFSR_REG(SystemControl_BASE_PTR)
#define SCB_HFSR                                 SCB_HFSR_REG(SystemControl_BASE_PTR)
#define SCB_DFSR                                 SCB_DFSR_REG(SystemControl_BASE_PTR)
#define SCB_MMFAR                                SCB_MMFAR_REG(SystemControl_BASE_PTR)
#define SCB_BFAR                                 SCB_BFAR_REG(SystemControl_BASE_PTR)
#define SCB_ID_PFR0                              SCB_ID_PFR0_REG(SystemControl_BASE_PTR)
#define SCB_ID_PFR1                              SCB_ID_PFR1_REG(SystemControl_BASE_PTR)
#define SCB_ID_DFR0                              SCB_ID_DFR0_REG(SystemControl_BASE_PTR)
#define SCB_ID_AFR0                              SCB_ID_AFR0_REG(SystemControl_BASE_PTR)
#define SCB_ID_MMFR0                             SCB_ID_MMFR0_REG(SystemControl_BASE_PTR)
#define SCB_ID_MMFR1                             SCB_ID_MMFR1_REG(SystemControl_BASE_PTR)
#define SCB_ID_MMFR2                             SCB_ID_MMFR2_REG(SystemControl_BASE_PTR)
#define SCB_ID_MMFR3                             SCB_ID_MMFR3_REG(SystemControl_BASE_PTR)
#define SCB_ID_ISAR0                             SCB_ID_ISAR0_REG(SystemControl_BASE_PTR)
#define SCB_ID_ISAR1                             SCB_ID_ISAR1_REG(SystemControl_BASE_PTR)
#define SCB_ID_ISAR2                             SCB_ID_ISAR2_REG(SystemControl_BASE_PTR)
#define SCB_ID_ISAR3                             SCB_ID_ISAR3_REG(SystemControl_BASE_PTR)
#define SCB_ID_ISAR4                             SCB_ID_ISAR4_REG(SystemControl_BASE_PTR)
#define SCB_CLIDR                                SCB_CLIDR_REG(SystemControl_BASE_PTR)
#define SCB_CTR                                  SCB_CTR_REG(SystemControl_BASE_PTR)
#define SCB_CCSIDR                               SCB_CCSIDR_REG(SystemControl_BASE_PTR)
#define SCB_CSSELR                               SCB_CSSELR_REG(SystemControl_BASE_PTR)
#define SCB_CPACR                                SCB_CPACR_REG(SystemControl_BASE_PTR)
#define SCB_STIR                                 SCB_STIR_REG(SystemControl_BASE_PTR)
#define SCB_ICIALLU                              SCB_ICIALLU_REG(SystemControl_BASE_PTR)
#define SCB_ICIMVAU                              SCB_ICIMVAU_REG(SystemControl_BASE_PTR)
#define SCB_DCIMVAC                              SCB_DCIMVAC_REG(SystemControl_BASE_PTR)
#define SCB_DCISW                                SCB_DCISW_REG(SystemControl_BASE_PTR)
#define SCB_DCCMVAU                              SCB_DCCMVAU_REG(SystemControl_BASE_PTR)
#define SCB_DCCMVAC                              SCB_DCCMVAC_REG(SystemControl_BASE_PTR)
#define SCB_DCCSW                                SCB_DCCSW_REG(SystemControl_BASE_PTR)
#define SCB_DCCIMVAC                             SCB_DCCIMVAC_REG(SystemControl_BASE_PTR)
#define SCB_DCCISW                               SCB_DCCISW_REG(SystemControl_BASE_PTR)
#define SCB_CM7_ITCMCR                           SCB_CM7_ITCMCR_REG(SystemControl_BASE_PTR)
#define SCB_CM7_DTCMCR                           SCB_CM7_DTCMCR_REG(SystemControl_BASE_PTR)
#define SCB_CM7_AHBPCR                           SCB_CM7_AHBPCR_REG(SystemControl_BASE_PTR)
#define SCB_CM7_CACR                             SCB_CM7_CACR_REG(SystemControl_BASE_PTR)
#define SCB_CM7_AHBSCR                           SCB_CM7_AHBSCR_REG(SystemControl_BASE_PTR)
#define SCB_CM7_ABFSR                            SCB_CM7_ABFSR_REG(SystemControl_BASE_PTR)

/*!
 * @}
 */ /* end of group SCB_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group SCB_Peripheral */


/* ----------------------------------------------------------------------------
   -- SEMC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMC_Peripheral SEMC
 * @{
 */

/** SEMC - Peripheral register structure */
typedef struct SEMC_MemMap {
  uint32_t MCR;                                    /**< Module Control Register, offset: 0x0 */
  uint32_t IOCR;                                   /**< IO Mux Control Register, offset: 0x4 */
  uint32_t BMCR0;                                  /**< Master Bus (AXI) Control Register 0, offset: 0x8 */
  uint32_t BMCR1;                                  /**< Master Bus (AXI) Control Register 1, offset: 0xC */
  uint32_t BR[9];                                  /**< Base Register 0 (For SDRAM CS0 device)..Base Register 8 (For NAND device), array offset: 0x10, array step: 0x4 */
  uint8_t RESERVED_0[4];
  uint32_t INTEN;                                  /**< Interrupt Enable Register, offset: 0x38 */
  uint32_t INTR;                                   /**< Interrupt Enable Register, offset: 0x3C */
  uint32_t SDRAMCR0;                               /**< SDRAM control register 0, offset: 0x40 */
  uint32_t SDRAMCR1;                               /**< SDRAM control register 1, offset: 0x44 */
  uint32_t SDRAMCR2;                               /**< SDRAM control register 2, offset: 0x48 */
  uint32_t SDRAMCR3;                               /**< SDRAM control register 3, offset: 0x4C */
  uint32_t NANDCR0;                                /**< NAND control register 0, offset: 0x50 */
  uint32_t NANDCR1;                                /**< NAND control register 1, offset: 0x54 */
  uint32_t NANDCR2;                                /**< NAND control register 2, offset: 0x58 */
  uint32_t NANDCR3;                                /**< NAND control register 3, offset: 0x5C */
  uint32_t NORCR0;                                 /**< NOR control register 0, offset: 0x60 */
  uint32_t NORCR1;                                 /**< NOR control register 1, offset: 0x64 */
  uint32_t NORCR2;                                 /**< NOR control register 2, offset: 0x68 */
  uint32_t NORCR3;                                 /**< NOR control register 3, offset: 0x6C */
  uint32_t SRAMCR0;                                /**< SRAM control register 0, offset: 0x70 */
  uint32_t SRAMCR1;                                /**< SRAM control register 1, offset: 0x74 */
  uint32_t SRAMCR2;                                /**< SRAM control register 2, offset: 0x78 */
  uint32_t SRAMCR3;                                /**< SRAM control register 3, offset: 0x7C */
  uint32_t DBICR0;                                 /**< DBI-B control register 0, offset: 0x80 */
  uint32_t DBICR1;                                 /**< DBI-B control register 1, offset: 0x84 */
  uint8_t RESERVED_1[8];
  uint32_t IPCR0;                                  /**< IP Command control register 0, offset: 0x90 */
  uint32_t IPCR1;                                  /**< IP Command control register 1, offset: 0x94 */
  uint32_t IPCR2;                                  /**< IP Command control register 2, offset: 0x98 */
  uint32_t IPCMD;                                  /**< IP Command register, offset: 0x9C */
  uint32_t IPTXDAT;                                /**< TX DATA register (for IP Command), offset: 0xA0 */
  uint8_t RESERVED_2[12];
  uint32_t IPRXDAT;                                /**< RX DATA register (for IP Command), offset: 0xB0 */
  uint8_t RESERVED_3[12];
  uint32_t STS0;                                   /**< Status register 0, offset: 0xC0 */
  uint32_t STS1;                                   /**< Status register 1, offset: 0xC4 */
  uint32_t STS2;                                   /**< Status register 2, offset: 0xC8 */
  uint32_t STS3;                                   /**< Status register 3, offset: 0xCC */
  uint32_t STS4;                                   /**< Status register 4, offset: 0xD0 */
  uint32_t STS5;                                   /**< Status register 5, offset: 0xD4 */
  uint32_t STS6;                                   /**< Status register 6, offset: 0xD8 */
  uint32_t STS7;                                   /**< Status register 7, offset: 0xDC */
  uint32_t STS8;                                   /**< Status register 8, offset: 0xE0 */
  uint32_t STS9;                                   /**< Status register 9, offset: 0xE4 */
  uint32_t STS10;                                  /**< Status register 10, offset: 0xE8 */
  uint32_t STS11;                                  /**< Status register 11, offset: 0xEC */
  uint32_t STS12;                                  /**< Status register 12, offset: 0xF0 */
  uint32_t STS13;                                  /**< Status register 13, offset: 0xF4 */
  uint32_t STS14;                                  /**< Status register 14, offset: 0xF8 */
  uint32_t STS15;                                  /**< Status register 15, offset: 0xFC */
} volatile *SEMC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- SEMC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMC_Register_Accessor_Macros SEMC - Register accessor macros
 * @{
 */


/* SEMC - Register accessors */
#define SEMC_MCR_REG(base)                       ((base)->MCR)
#define SEMC_IOCR_REG(base)                      ((base)->IOCR)
#define SEMC_BMCR0_REG(base)                     ((base)->BMCR0)
#define SEMC_BMCR1_REG(base)                     ((base)->BMCR1)
#define SEMC_BR_REG(base,index)                  ((base)->BR[index])
#define SEMC_INTEN_REG(base)                     ((base)->INTEN)
#define SEMC_INTR_REG(base)                      ((base)->INTR)
#define SEMC_SDRAMCR0_REG(base)                  ((base)->SDRAMCR0)
#define SEMC_SDRAMCR1_REG(base)                  ((base)->SDRAMCR1)
#define SEMC_SDRAMCR2_REG(base)                  ((base)->SDRAMCR2)
#define SEMC_SDRAMCR3_REG(base)                  ((base)->SDRAMCR3)
#define SEMC_NANDCR0_REG(base)                   ((base)->NANDCR0)
#define SEMC_NANDCR1_REG(base)                   ((base)->NANDCR1)
#define SEMC_NANDCR2_REG(base)                   ((base)->NANDCR2)
#define SEMC_NANDCR3_REG(base)                   ((base)->NANDCR3)
#define SEMC_NORCR0_REG(base)                    ((base)->NORCR0)
#define SEMC_NORCR1_REG(base)                    ((base)->NORCR1)
#define SEMC_NORCR2_REG(base)                    ((base)->NORCR2)
#define SEMC_NORCR3_REG(base)                    ((base)->NORCR3)
#define SEMC_SRAMCR0_REG(base)                   ((base)->SRAMCR0)
#define SEMC_SRAMCR1_REG(base)                   ((base)->SRAMCR1)
#define SEMC_SRAMCR2_REG(base)                   ((base)->SRAMCR2)
#define SEMC_SRAMCR3_REG(base)                   ((base)->SRAMCR3)
#define SEMC_DBICR0_REG(base)                    ((base)->DBICR0)
#define SEMC_DBICR1_REG(base)                    ((base)->DBICR1)
#define SEMC_IPCR0_REG(base)                     ((base)->IPCR0)
#define SEMC_IPCR1_REG(base)                     ((base)->IPCR1)
#define SEMC_IPCR2_REG(base)                     ((base)->IPCR2)
#define SEMC_IPCMD_REG(base)                     ((base)->IPCMD)
#define SEMC_IPTXDAT_REG(base)                   ((base)->IPTXDAT)
#define SEMC_IPRXDAT_REG(base)                   ((base)->IPRXDAT)
#define SEMC_STS0_REG(base)                      ((base)->STS0)
#define SEMC_STS1_REG(base)                      ((base)->STS1)
#define SEMC_STS2_REG(base)                      ((base)->STS2)
#define SEMC_STS3_REG(base)                      ((base)->STS3)
#define SEMC_STS4_REG(base)                      ((base)->STS4)
#define SEMC_STS5_REG(base)                      ((base)->STS5)
#define SEMC_STS6_REG(base)                      ((base)->STS6)
#define SEMC_STS7_REG(base)                      ((base)->STS7)
#define SEMC_STS8_REG(base)                      ((base)->STS8)
#define SEMC_STS9_REG(base)                      ((base)->STS9)
#define SEMC_STS10_REG(base)                     ((base)->STS10)
#define SEMC_STS11_REG(base)                     ((base)->STS11)
#define SEMC_STS12_REG(base)                     ((base)->STS12)
#define SEMC_STS13_REG(base)                     ((base)->STS13)
#define SEMC_STS14_REG(base)                     ((base)->STS14)
#define SEMC_STS15_REG(base)                     ((base)->STS15)

/*!
 * @}
 */ /* end of group SEMC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- SEMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMC_Register_Masks SEMC Register Masks
 * @{
 */

