AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SRAMCR2 - SRAM control register 2 */
#define SEMC_SRAMCR2_WDS_MASK                    (0xFU)
#define SEMC_SRAMCR2_WDS_SHIFT                   (0U)
#define SEMC_SRAMCR2_WDS(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_WDS_SHIFT)) & SEMC_SRAMCR2_WDS_MASK)
#define SEMC_SRAMCR2_WDH_MASK                    (0xF0U)
#define SEMC_SRAMCR2_WDH_SHIFT                   (4U)
#define SEMC_SRAMCR2_WDH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_WDH_SHIFT)) & SEMC_SRAMCR2_WDH_MASK)
#define SEMC_SRAMCR2_TA_MASK                     (0xF00U)
#define SEMC_SRAMCR2_TA_SHIFT                    (8U)
#define SEMC_SRAMCR2_TA(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_TA_SHIFT)) & SEMC_SRAMCR2_TA_MASK)
#define SEMC_SRAMCR2_AWDH_MASK                   (0xF000U)
#define SEMC_SRAMCR2_AWDH_SHIFT                  (12U)
#define SEMC_SRAMCR2_AWDH(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_AWDH_SHIFT)) & SEMC_SRAMCR2_AWDH_MASK)
#define SEMC_SRAMCR2_LC_MASK                     (0xF0000U)
#define SEMC_SRAMCR2_LC_SHIFT                    (16U)
#define SEMC_SRAMCR2_LC(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_LC_SHIFT)) & SEMC_SRAMCR2_LC_MASK)
#define SEMC_SRAMCR2_RD_MASK                     (0xF00000U)
#define SEMC_SRAMCR2_RD_SHIFT                    (20U)
#define SEMC_SRAMCR2_RD(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_RD_SHIFT)) & SEMC_SRAMCR2_RD_MASK)
#define SEMC_SRAMCR2_CEITV_MASK                  (0xF000000U)
#define SEMC_SRAMCR2_CEITV_SHIFT                 (24U)
#define SEMC_SRAMCR2_CEITV(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR2_CEITV_SHIFT)) & SEMC_SRAMCR2_CEITV_MASK)

/*! @name DBICR0 - DBI-B control register 0 */
#define SEMC_DBICR0_PS_MASK                      (0x1U)
#define SEMC_DBICR0_PS_SHIFT                     (0U)
#define SEMC_DBICR0_BL_MASK                      (0x70U)
#define SEMC_DBICR0_BL_SHIFT                     (4U)
#define SEMC_DBICR0_BL(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR0_BL_SHIFT)) & SEMC_DBICR0_BL_MASK)
#define SEMC_DBICR0_COL_MASK                     (0xF000U)
#define SEMC_DBICR0_COL_SHIFT                    (12U)
#define SEMC_DBICR0_COL(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR0_COL_SHIFT)) & SEMC_DBICR0_COL_MASK)

/*! @name DBICR1 - DBI-B control register 1 */
#define SEMC_DBICR1_CES_MASK                     (0xFU)
#define SEMC_DBICR1_CES_SHIFT                    (0U)
#define SEMC_DBICR1_CES(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_CES_SHIFT)) & SEMC_DBICR1_CES_MASK)
#define SEMC_DBICR1_CEH_MASK                     (0xF0U)
#define SEMC_DBICR1_CEH_SHIFT                    (4U)
#define SEMC_DBICR1_CEH(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_CEH_SHIFT)) & SEMC_DBICR1_CEH_MASK)
#define SEMC_DBICR1_WEL_MASK                     (0xF00U)
#define SEMC_DBICR1_WEL_SHIFT                    (8U)
#define SEMC_DBICR1_WEL(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_WEL_SHIFT)) & SEMC_DBICR1_WEL_MASK)
#define SEMC_DBICR1_WEH_MASK                     (0xF000U)
#define SEMC_DBICR1_WEH_SHIFT                    (12U)
#define SEMC_DBICR1_WEH(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_WEH_SHIFT)) & SEMC_DBICR1_WEH_MASK)
#define SEMC_DBICR1_REL_MASK                     (0xF0000U)
#define SEMC_DBICR1_REL_SHIFT                    (16U)
#define SEMC_DBICR1_REL(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_REL_SHIFT)) & SEMC_DBICR1_REL_MASK)
#define SEMC_DBICR1_REH_MASK                     (0xF00000U)
#define SEMC_DBICR1_REH_SHIFT                    (20U)
#define SEMC_DBICR1_REH(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_REH_SHIFT)) & SEMC_DBICR1_REH_MASK)
#define SEMC_DBICR1_CEITV_MASK                   (0xF000000U)
#define SEMC_DBICR1_CEITV_SHIFT                  (24U)
#define SEMC_DBICR1_CEITV(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_CEITV_SHIFT)) & SEMC_DBICR1_CEITV_MASK)
#define SEMC_DBICR1_REL2_MASK                    (0x30000000U)
#define SEMC_DBICR1_REL2_SHIFT                   (28U)
#define SEMC_DBICR1_REL2(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_REL2_SHIFT)) & SEMC_DBICR1_REL2_MASK)
#define SEMC_DBICR1_REH2_MASK                    (0xC0000000U)
#define SEMC_DBICR1_REH2_SHIFT                   (30U)
#define SEMC_DBICR1_REH2(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_DBICR1_REH2_SHIFT)) & SEMC_DBICR1_REH2_MASK)

/*! @name IPCR0 - IP Command control register 0 */
#define SEMC_IPCR0_SA_MASK                       (0xFFFFFFFFU)
#define SEMC_IPCR0_SA_SHIFT                      (0U)
#define SEMC_IPCR0_SA(x)                         (((uint32_t)(((uint32_t)(x)) << SEMC_IPCR0_SA_SHIFT)) & SEMC_IPCR0_SA_MASK)

/*! @name IPCR1 - IP Command control register 1 */
#define SEMC_IPCR1_DATSZ_MASK                    (0x7U)
#define SEMC_IPCR1_DATSZ_SHIFT                   (0U)
#define SEMC_IPCR1_DATSZ(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_IPCR1_DATSZ_SHIFT)) & SEMC_IPCR1_DATSZ_MASK)

/*! @name IPCR2 - IP Command control register 2 */
#define SEMC_IPCR2_BM0_MASK                      (0x1U)
#define SEMC_IPCR2_BM0_SHIFT                     (0U)
#define SEMC_IPCR2_BM1_MASK                      (0x2U)
#define SEMC_IPCR2_BM1_SHIFT                     (1U)
#define SEMC_IPCR2_BM2_MASK                      (0x4U)
#define SEMC_IPCR2_BM2_SHIFT                     (2U)
#define SEMC_IPCR2_BM3_MASK                      (0x8U)
#define SEMC_IPCR2_BM3_SHIFT                     (3U)

/*! @name IPCMD - IP Command register */
#define SEMC_IPCMD_CMD_MASK                      (0xFFFFU)
#define SEMC_IPCMD_CMD_SHIFT                     (0U)
#define SEMC_IPCMD_CMD(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_IPCMD_CMD_SHIFT)) & SEMC_IPCMD_CMD_MASK)
#define SEMC_IPCMD_KEY_MASK                      (0xFFFF0000U)
#define SEMC_IPCMD_KEY_SHIFT                     (16U)
#define SEMC_IPCMD_KEY(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_IPCMD_KEY_SHIFT)) & SEMC_IPCMD_KEY_MASK)

/*! @name IPTXDAT - TX DATA register (for IP Command) */
#define SEMC_IPTXDAT_DAT_MASK                    (0xFFFFFFFFU)
#define SEMC_IPTXDAT_DAT_SHIFT                   (0U)
#define SEMC_IPTXDAT_DAT(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_IPTXDAT_DAT_SHIFT)) & SEMC_IPTXDAT_DAT_MASK)

/*! @name IPRXDAT - RX DATA register (for IP Command) */
#define SEMC_IPRXDAT_DAT_MASK                    (0xFFFFFFFFU)
#define SEMC_IPRXDAT_DAT_SHIFT                   (0U)
#define SEMC_IPRXDAT_DAT(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_IPRXDAT_DAT_SHIFT)) & SEMC_IPRXDAT_DAT_MASK)

/*! @name STS0 - Status register 0 */
#define SEMC_STS0_IDLE_MASK                      (0x1U)
#define SEMC_STS0_IDLE_SHIFT                     (0U)
#define SEMC_STS0_NARDY_MASK                     (0x2U)
#define SEMC_STS0_NARDY_SHIFT                    (1U)

/*! @name STS2 - Status register 2 */
#define SEMC_STS2_NDWRPEND_MASK                  (0x8U)
#define SEMC_STS2_NDWRPEND_SHIFT                 (3U)

/*! @name STS12 - Status register 12 */
#define SEMC_STS12_NDADDR_MASK                   (0xFFFFFFFFU)
#define SEMC_STS12_NDADDR_SHIFT                  (0U)
#define SEMC_STS12_NDADDR(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_STS12_NDADDR_SHIFT)) & SEMC_STS12_NDADDR_MASK)


/*!
 * @}
 */ /* end of group SEMC_Register_Masks */


/* SEMC - Peripheral instance base addresses */
/** Peripheral SEMC base pointer */
#define SEMC_BASE_PTR                            ((SEMC_MemMapPtr)0x402F0000u)
/** Array initializer of SEMC peripheral base pointers */
#define SEMC_BASE_PTRS                           { SEMC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- SEMC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMC_Register_Accessor_Macros SEMC - Register accessor macros
 * @{
 */


/* SEMC - Register instance definitions */
/* SEMC */
#define SEMC_MCR                                 SEMC_MCR_REG(SEMC_BASE_PTR)
#define SEMC_IOCR                                SEMC_IOCR_REG(SEMC_BASE_PTR)
#define SEMC_BMCR0                               SEMC_BMCR0_REG(SEMC_BASE_PTR)
#define SEMC_BMCR1                               SEMC_BMCR1_REG(SEMC_BASE_PTR)
#define SEMC_BR0                                 SEMC_BR_REG(SEMC_BASE_PTR,0)
#define SEMC_BR1                                 SEMC_BR_REG(SEMC_BASE_PTR,1)
#define SEMC_BR2                                 SEMC_BR_REG(SEMC_BASE_PTR,2)
#define SEMC_BR3                                 SEMC_BR_REG(SEMC_BASE_PTR,3)
#define SEMC_BR4                                 SEMC_BR_REG(SEMC_BASE_PTR,4)
#define SEMC_BR5                                 SEMC_BR_REG(SEMC_BASE_PTR,5)
#define SEMC_BR6                                 SEMC_BR_REG(SEMC_BASE_PTR,6)
#define SEMC_BR7                                 SEMC_BR_REG(SEMC_BASE_PTR,7)
#define SEMC_BR8                                 SEMC_BR_REG(SEMC_BASE_PTR,8)
#define SEMC_INTEN                               SEMC_INTEN_REG(SEMC_BASE_PTR)
#define SEMC_INTR                                SEMC_INTR_REG(SEMC_BASE_PTR)
#define SEMC_SDRAMCR0                            SEMC_SDRAMCR0_REG(SEMC_BASE_PTR)
#define SEMC_SDRAMCR1                            SEMC_SDRAMCR1_REG(SEMC_BASE_PTR)
#define SEMC_SDRAMCR2                            SEMC_SDRAMCR2_REG(SEMC_BASE_PTR)
#define SEMC_SDRAMCR3                            SEMC_SDRAMCR3_REG(SEMC_BASE_PTR)
#define SEMC_NANDCR0                             SEMC_NANDCR0_REG(SEMC_BASE_PTR)
#define SEMC_NANDCR1                             SEMC_NANDCR1_REG(SEMC_BASE_PTR)
#define SEMC_NANDCR2                             SEMC_NANDCR2_REG(SEMC_BASE_PTR)
#define SEMC_NANDCR3                             SEMC_NANDCR3_REG(SEMC_BASE_PTR)
#define SEMC_NORCR0                              SEMC_NORCR0_REG(SEMC_BASE_PTR)
#define SEMC_NORCR1                              SEMC_NORCR1_REG(SEMC_BASE_PTR)
#define SEMC_NORCR2                              SEMC_NORCR2_REG(SEMC_BASE_PTR)
#define SEMC_NORCR3                              SEMC_NORCR3_REG(SEMC_BASE_PTR)
#define SEMC_SRAMCR0                             SEMC_SRAMCR0_REG(SEMC_BASE_PTR)
#define SEMC_SRAMCR1                             SEMC_SRAMCR1_REG(SEMC_BASE_PTR)
#define SEMC_SRAMCR2                             SEMC_SRAMCR2_REG(SEMC_BASE_PTR)
#define SEMC_SRAMCR3                             SEMC_SRAMCR3_REG(SEMC_BASE_PTR)
#define SEMC_DBICR0                              SEMC_DBICR0_REG(SEMC_BASE_PTR)
#define SEMC_DBICR1                              SEMC_DBICR1_REG(SEMC_BASE_PTR)
#define SEMC_IPCR0                               SEMC_IPCR0_REG(SEMC_BASE_PTR)
#define SEMC_IPCR1                               SEMC_IPCR1_REG(SEMC_BASE_PTR)
#define SEMC_IPCR2                               SEMC_IPCR2_REG(SEMC_BASE_PTR)
#define SEMC_IPCMD                               SEMC_IPCMD_REG(SEMC_BASE_PTR)
#define SEMC_IPTXDAT                             SEMC_IPTXDAT_REG(SEMC_BASE_PTR)
#define SEMC_IPRXDAT                             SEMC_IPRXDAT_REG(SEMC_BASE_PTR)
#define SEMC_STS0                                SEMC_STS0_REG(SEMC_BASE_PTR)
#define SEMC_STS1                                SEMC_STS1_REG(SEMC_BASE_PTR)
#define SEMC_STS2                                SEMC_STS2_REG(SEMC_BASE_PTR)
#define SEMC_STS3                                SEMC_STS3_REG(SEMC_BASE_PTR)
#define SEMC_STS4                                SEMC_STS4_REG(SEMC_BASE_PTR)
#define SEMC_STS5                                SEMC_STS5_REG(SEMC_BASE_PTR)
#define SEMC_STS6                                SEMC_STS6_REG(SEMC_BASE_PTR)
#define SEMC_STS7                                SEMC_STS7_REG(SEMC_BASE_PTR)
#define SEMC_STS8                                SEMC_STS8_REG(SEMC_BASE_PTR)
#define SEMC_STS9                                SEMC_STS9_REG(SEMC_BASE_PTR)
#define SEMC_STS10                               SEMC_STS10_REG(SEMC_BASE_PTR)
#define SEMC_STS11                               SEMC_STS11_REG(SEMC_BASE_PTR)
#define SEMC_STS12                               SEMC_STS12_REG(SEMC_BASE_PTR)
#define SEMC_STS13                               SEMC_STS13_REG(SEMC_BASE_PTR)
#define SEMC_STS14                               SEMC_STS14_REG(SEMC_BASE_PTR)
#define SEMC_STS15                               SEMC_STS15_REG(SEMC_BASE_PTR)

/* SEMC - Register array accessors */
#define SEMC_BR(index)                           SEMC_BR_REG(SEMC_BASE_PTR,index)

/*!
 * @}
 */ /* end of group SEMC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group SEMC_Peripheral */


/* ----------------------------------------------------------------------------
   -- SNVS
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SNVS_Peripheral SNVS
 * @{
 */

