AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/** SNVS - Peripheral register structure */
typedef struct SNVS_MemMap {
  uint32_t HPLR;                                   /**< SNVS_HP Lock Register, offset: 0x0 */
  uint32_t HPCOMR;                                 /**< SNVS_HP Command Register, offset: 0x4 */
  uint32_t HPCR;                                   /**< SNVS_HP Control Register, offset: 0x8 */
  uint32_t HPSICR;                                 /**< SNVS_HP Security Interrupt Control Register, offset: 0xC */
  uint32_t HPSVCR;                                 /**< SNVS_HP Security Violation Control Register, offset: 0x10 */
  uint32_t HPSR;                                   /**< SNVS_HP Status Register, offset: 0x14 */
  uint32_t HPSVSR;                                 /**< SNVS_HP Security Violation Status Register, offset: 0x18 */
  uint32_t HPHACIVR;                               /**< SNVS_HP High Assurance Counter IV Register, offset: 0x1C */
  uint32_t HPHACR;                                 /**< SNVS_HP High Assurance Counter Register, offset: 0x20 */
  uint32_t HPRTCMR;                                /**< SNVS_HP Real Time Counter MSB Register, offset: 0x24 */
  uint32_t HPRTCLR;                                /**< SNVS_HP Real Time Counter LSB Register, offset: 0x28 */
  uint32_t HPTAMR;                                 /**< SNVS_HP Time Alarm MSB Register, offset: 0x2C */
  uint32_t HPTALR;                                 /**< SNVS_HP Time Alarm LSB Register, offset: 0x30 */
  uint32_t LPLR;                                   /**< SNVS_LP Lock Register, offset: 0x34 */
  uint32_t LPCR;                                   /**< SNVS_LP Control Register, offset: 0x38 */
  uint32_t LPMKCR;                                 /**< SNVS_LP Master Key Control Register, offset: 0x3C */
  uint32_t LPSVCR;                                 /**< SNVS_LP Security Violation Control Register, offset: 0x40 */
  uint8_t RESERVED_0[4];
  uint32_t LPTDCR;                                 /**< SNVS_LP Tamper Detectors Configuration Register, offset: 0x48 */
  uint32_t LPSR;                                   /**< SNVS_LP Status Register, offset: 0x4C */
  uint32_t LPSRTCMR;                               /**< SNVS_LP Secure Real Time Counter MSB Register, offset: 0x50 */
  uint32_t LPSRTCLR;                               /**< SNVS_LP Secure Real Time Counter LSB Register, offset: 0x54 */
  uint32_t LPTAR;                                  /**< SNVS_LP Time Alarm Register, offset: 0x58 */
  uint32_t LPSMCMR;                                /**< SNVS_LP Secure Monotonic Counter MSB Register, offset: 0x5C */
  uint32_t LPSMCLR;                                /**< SNVS_LP Secure Monotonic Counter LSB Register, offset: 0x60 */
  uint32_t LPPGDR;                                 /**< SNVS_LP Power Glitch Detector Register, offset: 0x64 */
  uint32_t LPGPR0_LEGACY_ALIAS;                    /**< SNVS_LP General Purpose Register 0 (legacy alias), offset: 0x68 */
  uint32_t LPZMKR[8];                              /**< SNVS_LP Zeroizable Master Key Register, array offset: 0x6C, array step: 0x4 */
  uint8_t RESERVED_1[4];
  uint32_t LPGPR_ALIAS[4];                         /**< SNVS_LP General Purpose Registers 0 .. 3, array offset: 0x90, array step: 0x4 */
  uint8_t RESERVED_2[96];
  uint32_t LPGPR[8];                               /**< SNVS_LP General Purpose Registers 0 .. 7, array offset: 0x100, array step: 0x4 */
  uint8_t RESERVED_3[2776];
  uint32_t HPVIDR1;                                /**< SNVS_HP Version ID Register 1, offset: 0xBF8 */
  uint32_t HPVIDR2;                                /**< SNVS_HP Version ID Register 2, offset: 0xBFC */
} volatile *SNVS_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- SNVS - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SNVS_Register_Accessor_Macros SNVS - Register accessor macros
 * @{
 */


/* SNVS - Register accessors */
#define SNVS_HPLR_REG(base)                      ((base)->HPLR)
#define SNVS_HPCOMR_REG(base)                    ((base)->HPCOMR)
#define SNVS_HPCR_REG(base)                      ((base)->HPCR)
#define SNVS_HPSICR_REG(base)                    ((base)->HPSICR)
#define SNVS_HPSVCR_REG(base)                    ((base)->HPSVCR)
#define SNVS_HPSR_REG(base)                      ((base)->HPSR)
#define SNVS_HPSVSR_REG(base)                    ((base)->HPSVSR)
#define SNVS_HPHACIVR_REG(base)                  ((base)->HPHACIVR)
#define SNVS_HPHACR_REG(base)                    ((base)->HPHACR)
#define SNVS_HPRTCMR_REG(base)                   ((base)->HPRTCMR)
#define SNVS_HPRTCLR_REG(base)                   ((base)->HPRTCLR)
#define SNVS_HPTAMR_REG(base)                    ((base)->HPTAMR)
#define SNVS_HPTALR_REG(base)                    ((base)->HPTALR)
#define SNVS_LPLR_REG(base)                      ((base)->LPLR)
#define SNVS_LPCR_REG(base)                      ((base)->LPCR)
#define SNVS_LPMKCR_REG(base)                    ((base)->LPMKCR)
#define SNVS_LPSVCR_REG(base)                    ((base)->LPSVCR)
#define SNVS_LPTDCR_REG(base)                    ((base)->LPTDCR)
#define SNVS_LPSR_REG(base)                      ((base)->LPSR)
#define SNVS_LPSRTCMR_REG(base)                  ((base)->LPSRTCMR)
#define SNVS_LPSRTCLR_REG(base)                  ((base)->LPSRTCLR)
#define SNVS_LPTAR_REG(base)                     ((base)->LPTAR)
#define SNVS_LPSMCMR_REG(base)                   ((base)->LPSMCMR)
#define SNVS_LPSMCLR_REG(base)                   ((base)->LPSMCLR)
#define SNVS_LPPGDR_REG(base)                    ((base)->LPPGDR)
#define SNVS_LPGPR0_LEGACY_ALIAS_REG(base)       ((base)->LPGPR0_LEGACY_ALIAS)
#define SNVS_LPZMKR_REG(base,index)              ((base)->LPZMKR[index])
#define SNVS_LPGPR_ALIAS_REG(base,index)         ((base)->LPGPR_ALIAS[index])
#define SNVS_LPGPR_REG(base,index)               ((base)->LPGPR[index])
#define SNVS_HPVIDR1_REG(base)                   ((base)->HPVIDR1)
#define SNVS_HPVIDR2_REG(base)                   ((base)->HPVIDR2)

/*!
 * @}
 */ /* end of group SNVS_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- SNVS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SNVS_Register_Masks SNVS Register Masks
 * @{
 */

