AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name TEMPSENSE2_TOG - Tempsensor Control Register 2 */
#define TEMPMON_TEMPSENSE2_TOG_LOW_ALARM_VALUE_MASK (0xFFFU)
#define TEMPMON_TEMPSENSE2_TOG_LOW_ALARM_VALUE_SHIFT (0U)
#define TEMPMON_TEMPSENSE2_TOG_LOW_ALARM_VALUE(x) (((uint32_t)(((uint32_t)(x)) << TEMPMON_TEMPSENSE2_TOG_LOW_ALARM_VALUE_SHIFT)) & TEMPMON_TEMPSENSE2_TOG_LOW_ALARM_VALUE_MASK)
#define TEMPMON_TEMPSENSE2_TOG_PANIC_ALARM_VALUE_MASK (0xFFF0000U)
#define TEMPMON_TEMPSENSE2_TOG_PANIC_ALARM_VALUE_SHIFT (16U)
#define TEMPMON_TEMPSENSE2_TOG_PANIC_ALARM_VALUE(x) (((uint32_t)(((uint32_t)(x)) << TEMPMON_TEMPSENSE2_TOG_PANIC_ALARM_VALUE_SHIFT)) & TEMPMON_TEMPSENSE2_TOG_PANIC_ALARM_VALUE_MASK)


/*!
 * @}
 */ /* end of group TEMPMON_Register_Masks */


/* TEMPMON - Peripheral instance base addresses */
/** Peripheral TEMPMON base pointer */
#define TEMPMON_BASE_PTR                         ((TEMPMON_MemMapPtr)0x400D8000u)
/** Array initializer of TEMPMON peripheral base pointers */
#define TEMPMON_BASE_PTRS                        { TEMPMON_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- TEMPMON - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TEMPMON_Register_Accessor_Macros TEMPMON - Register accessor macros
 * @{
 */


/* TEMPMON - Register instance definitions */
/* TEMPMON */
#define TEMPMON_TEMPSENSE0                       TEMPMON_TEMPSENSE0_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE0_SET                   TEMPMON_TEMPSENSE0_SET_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE0_CLR                   TEMPMON_TEMPSENSE0_CLR_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE0_TOG                   TEMPMON_TEMPSENSE0_TOG_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE1                       TEMPMON_TEMPSENSE1_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE1_SET                   TEMPMON_TEMPSENSE1_SET_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE1_CLR                   TEMPMON_TEMPSENSE1_CLR_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE1_TOG                   TEMPMON_TEMPSENSE1_TOG_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE2                       TEMPMON_TEMPSENSE2_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE2_SET                   TEMPMON_TEMPSENSE2_SET_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE2_CLR                   TEMPMON_TEMPSENSE2_CLR_REG(TEMPMON_BASE_PTR)
#define TEMPMON_TEMPSENSE2_TOG                   TEMPMON_TEMPSENSE2_TOG_REG(TEMPMON_BASE_PTR)

/*!
 * @}
 */ /* end of group TEMPMON_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group TEMPMON_Peripheral */


/* ----------------------------------------------------------------------------
   -- TMR
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMR_Peripheral TMR
 * @{
 */

/** TMR - Peripheral register structure */
typedef struct TMR_MemMap {
  struct {                                         /* offset: 0x0, array step: 0x20 */
    uint16_t COMP1;                                  /**< Timer Channel Compare Register 1, array offset: 0x0, array step: 0x20 */
    uint16_t COMP2;                                  /**< Timer Channel Compare Register 2, array offset: 0x2, array step: 0x20 */
    uint16_t CAPT;                                   /**< Timer Channel Capture Register, array offset: 0x4, array step: 0x20 */
    uint16_t LOAD;                                   /**< Timer Channel Load Register, array offset: 0x6, array step: 0x20 */
    uint16_t HOLD;                                   /**< Timer Channel Hold Register, array offset: 0x8, array step: 0x20 */
    uint16_t CNTR;                                   /**< Timer Channel Counter Register, array offset: 0xA, array step: 0x20 */
    uint16_t CTRL;                                   /**< Timer Channel Control Register, array offset: 0xC, array step: 0x20 */
    uint16_t SCTRL;                                  /**< Timer Channel Status and Control Register, array offset: 0xE, array step: 0x20 */
    uint16_t CMPLD1;                                 /**< Timer Channel Comparator Load Register 1, array offset: 0x10, array step: 0x20 */
    uint16_t CMPLD2;                                 /**< Timer Channel Comparator Load Register 2, array offset: 0x12, array step: 0x20 */
    uint16_t CSCTRL;                                 /**< Timer Channel Comparator Status and Control Register, array offset: 0x14, array step: 0x20 */
    uint16_t FILT;                                   /**< Timer Channel Input Filter Register, array offset: 0x16, array step: 0x20 */
    uint16_t DMA;                                    /**< Timer Channel DMA Enable Register, array offset: 0x18, array step: 0x20 */
    uint8_t RESERVED_0[4];
    uint16_t ENBL;                                   /**< Timer Channel Enable Register, array offset: 0x1E, array step: 0x20, this item is not available for all array instances */
  } CHANNEL[4];
} volatile *TMR_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- TMR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMR_Register_Accessor_Macros TMR - Register accessor macros
 * @{
 */


/* TMR - Register accessors */
#define TMR_COMP1_REG(base,index)                ((base)->CHANNEL[index].COMP1)
#define TMR_COMP2_REG(base,index)                ((base)->CHANNEL[index].COMP2)
#define TMR_CAPT_REG(base,index)                 ((base)->CHANNEL[index].CAPT)
#define TMR_LOAD_REG(base,index)                 ((base)->CHANNEL[index].LOAD)
#define TMR_HOLD_REG(base,index)                 ((base)->CHANNEL[index].HOLD)
#define TMR_CNTR_REG(base,index)                 ((base)->CHANNEL[index].CNTR)
#define TMR_CTRL_REG(base,index)                 ((base)->CHANNEL[index].CTRL)
#define TMR_SCTRL_REG(base,index)                ((base)->CHANNEL[index].SCTRL)
#define TMR_CMPLD1_REG(base,index)               ((base)->CHANNEL[index].CMPLD1)
#define TMR_CMPLD2_REG(base,index)               ((base)->CHANNEL[index].CMPLD2)
#define TMR_CSCTRL_REG(base,index)               ((base)->CHANNEL[index].CSCTRL)
#define TMR_FILT_REG(base,index)                 ((base)->CHANNEL[index].FILT)
#define TMR_DMA_REG(base,index)                  ((base)->CHANNEL[index].DMA)
#define TMR_ENBL_REG(base,index)                 ((base)->CHANNEL[index].ENBL)

/*!
 * @}
 */ /* end of group TMR_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- TMR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMR_Register_Masks TMR Register Masks
 * @{
 */

