AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name CSCTRL - Timer Channel Comparator Status and Control Register */
#define TMR_CSCTRL_CL1_MASK                      (0x3U)
#define TMR_CSCTRL_CL1_SHIFT                     (0U)
#define TMR_CSCTRL_CL1(x)                        (((uint16_t)(((uint16_t)(x)) << TMR_CSCTRL_CL1_SHIFT)) & TMR_CSCTRL_CL1_MASK)
#define TMR_CSCTRL_CL2_MASK                      (0xCU)
#define TMR_CSCTRL_CL2_SHIFT                     (2U)
#define TMR_CSCTRL_CL2(x)                        (((uint16_t)(((uint16_t)(x)) << TMR_CSCTRL_CL2_SHIFT)) & TMR_CSCTRL_CL2_MASK)
#define TMR_CSCTRL_TCF1_MASK                     (0x10U)
#define TMR_CSCTRL_TCF1_SHIFT                    (4U)
#define TMR_CSCTRL_TCF2_MASK                     (0x20U)
#define TMR_CSCTRL_TCF2_SHIFT                    (5U)
#define TMR_CSCTRL_TCF1EN_MASK                   (0x40U)
#define TMR_CSCTRL_TCF1EN_SHIFT                  (6U)
#define TMR_CSCTRL_TCF2EN_MASK                   (0x80U)
#define TMR_CSCTRL_TCF2EN_SHIFT                  (7U)
#define TMR_CSCTRL_UP_MASK                       (0x200U)
#define TMR_CSCTRL_UP_SHIFT                      (9U)
#define TMR_CSCTRL_TCI_MASK                      (0x400U)
#define TMR_CSCTRL_TCI_SHIFT                     (10U)
#define TMR_CSCTRL_ROC_MASK                      (0x800U)
#define TMR_CSCTRL_ROC_SHIFT                     (11U)
#define TMR_CSCTRL_ALT_LOAD_MASK                 (0x1000U)
#define TMR_CSCTRL_ALT_LOAD_SHIFT                (12U)
#define TMR_CSCTRL_FAULT_MASK                    (0x2000U)
#define TMR_CSCTRL_FAULT_SHIFT                   (13U)
#define TMR_CSCTRL_DBG_EN_MASK                   (0xC000U)
#define TMR_CSCTRL_DBG_EN_SHIFT                  (14U)
#define TMR_CSCTRL_DBG_EN(x)                     (((uint16_t)(((uint16_t)(x)) << TMR_CSCTRL_DBG_EN_SHIFT)) & TMR_CSCTRL_DBG_EN_MASK)

/* The count of TMR_CSCTRL */
#define TMR_CSCTRL_COUNT                         (4U)

/*! @name FILT - Timer Channel Input Filter Register */
#define TMR_FILT_FILT_PER_MASK                   (0xFFU)
#define TMR_FILT_FILT_PER_SHIFT                  (0U)
#define TMR_FILT_FILT_PER(x)                     (((uint16_t)(((uint16_t)(x)) << TMR_FILT_FILT_PER_SHIFT)) & TMR_FILT_FILT_PER_MASK)
#define TMR_FILT_FILT_CNT_MASK                   (0x700U)
#define TMR_FILT_FILT_CNT_SHIFT                  (8U)
#define TMR_FILT_FILT_CNT(x)                     (((uint16_t)(((uint16_t)(x)) << TMR_FILT_FILT_CNT_SHIFT)) & TMR_FILT_FILT_CNT_MASK)

/* The count of TMR_FILT */
#define TMR_FILT_COUNT                           (4U)

/*! @name DMA - Timer Channel DMA Enable Register */
#define TMR_DMA_IEFDE_MASK                       (0x1U)
#define TMR_DMA_IEFDE_SHIFT                      (0U)
#define TMR_DMA_CMPLD1DE_MASK                    (0x2U)
#define TMR_DMA_CMPLD1DE_SHIFT                   (1U)
#define TMR_DMA_CMPLD2DE_MASK                    (0x4U)
#define TMR_DMA_CMPLD2DE_SHIFT                   (2U)

/* The count of TMR_DMA */
#define TMR_DMA_COUNT                            (4U)

/*! @name ENBL - Timer Channel Enable Register */
#define TMR_ENBL_ENBL_MASK                       (0xFU)
#define TMR_ENBL_ENBL_SHIFT                      (0U)
#define TMR_ENBL_ENBL(x)                         (((uint16_t)(((uint16_t)(x)) << TMR_ENBL_ENBL_SHIFT)) & TMR_ENBL_ENBL_MASK)

/* The count of TMR_ENBL */
#define TMR_ENBL_COUNT                           (4U)


/*!
 * @}
 */ /* end of group TMR_Register_Masks */


/* TMR - Peripheral instance base addresses */
/** Peripheral TMR1 base pointer */
#define TMR1_BASE_PTR                            ((TMR_MemMapPtr)0x401DC000u)
/** Peripheral TMR2 base pointer */
#define TMR2_BASE_PTR                            ((TMR_MemMapPtr)0x401E0000u)
/** Peripheral TMR3 base pointer */
#define TMR3_BASE_PTR                            ((TMR_MemMapPtr)0x401E4000u)
/** Peripheral TMR4 base pointer */
#define TMR4_BASE_PTR                            ((TMR_MemMapPtr)0x401E8000u)
/** Array initializer of TMR peripheral base pointers */
#define TMR_BASE_PTRS                            { TMR1_BASE_PTR, TMR2_BASE_PTR, TMR3_BASE_PTR, TMR4_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- TMR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMR_Register_Accessor_Macros TMR - Register accessor macros
 * @{
 */


/* TMR - Register instance definitions */
/* TMR1 */
#define TMR1_COMP10                              TMR_COMP1_REG(TMR1_BASE_PTR,0)
#define TMR1_COMP20                              TMR_COMP2_REG(TMR1_BASE_PTR,0)
#define TMR1_CAPT0                               TMR_CAPT_REG(TMR1_BASE_PTR,0)
#define TMR1_LOAD0                               TMR_LOAD_REG(TMR1_BASE_PTR,0)
#define TMR1_HOLD0                               TMR_HOLD_REG(TMR1_BASE_PTR,0)
#define TMR1_CNTR0                               TMR_CNTR_REG(TMR1_BASE_PTR,0)
#define TMR1_CTRL0                               TMR_CTRL_REG(TMR1_BASE_PTR,0)
#define TMR1_SCTRL0                              TMR_SCTRL_REG(TMR1_BASE_PTR,0)
#define TMR1_CMPLD10                             TMR_CMPLD1_REG(TMR1_BASE_PTR,0)
#define TMR1_CMPLD20                             TMR_CMPLD2_REG(TMR1_BASE_PTR,0)
#define TMR1_CSCTRL0                             TMR_CSCTRL_REG(TMR1_BASE_PTR,0)
#define TMR1_FILT0                               TMR_FILT_REG(TMR1_BASE_PTR,0)
#define TMR1_DMA0                                TMR_DMA_REG(TMR1_BASE_PTR,0)
#define TMR1_ENBL                                TMR_ENBL_REG(TMR1_BASE_PTR,0)
#define TMR1_COMP11                              TMR_COMP1_REG(TMR1_BASE_PTR,1)
#define TMR1_COMP21                              TMR_COMP2_REG(TMR1_BASE_PTR,1)
#define TMR1_CAPT1                               TMR_CAPT_REG(TMR1_BASE_PTR,1)
#define TMR1_LOAD1                               TMR_LOAD_REG(TMR1_BASE_PTR,1)
#define TMR1_HOLD1                               TMR_HOLD_REG(TMR1_BASE_PTR,1)
#define TMR1_CNTR1                               TMR_CNTR_REG(TMR1_BASE_PTR,1)
#define TMR1_CTRL1                               TMR_CTRL_REG(TMR1_BASE_PTR,1)
#define TMR1_SCTRL1                              TMR_SCTRL_REG(TMR1_BASE_PTR,1)
#define TMR1_CMPLD11                             TMR_CMPLD1_REG(TMR1_BASE_PTR,1)
#define TMR1_CMPLD21                             TMR_CMPLD2_REG(TMR1_BASE_PTR,1)
#define TMR1_CSCTRL1                             TMR_CSCTRL_REG(TMR1_BASE_PTR,1)
#define TMR1_FILT1                               TMR_FILT_REG(TMR1_BASE_PTR,1)
#define TMR1_DMA1                                TMR_DMA_REG(TMR1_BASE_PTR,1)
#define TMR1_COMP12                              TMR_COMP1_REG(TMR1_BASE_PTR,2)
#define TMR1_COMP22                              TMR_COMP2_REG(TMR1_BASE_PTR,2)
#define TMR1_CAPT2                               TMR_CAPT_REG(TMR1_BASE_PTR,2)
#define TMR1_LOAD2                               TMR_LOAD_REG(TMR1_BASE_PTR,2)
#define TMR1_HOLD2                               TMR_HOLD_REG(TMR1_BASE_PTR,2)
#define TMR1_CNTR2                               TMR_CNTR_REG(TMR1_BASE_PTR,2)
#define TMR1_CTRL2                               TMR_CTRL_REG(TMR1_BASE_PTR,2)
#define TMR1_SCTRL2                              TMR_SCTRL_REG(TMR1_BASE_PTR,2)
#define TMR1_CMPLD12                             TMR_CMPLD1_REG(TMR1_BASE_PTR,2)
#define TMR1_CMPLD22                             TMR_CMPLD2_REG(TMR1_BASE_PTR,2)
#define TMR1_CSCTRL2                             TMR_CSCTRL_REG(TMR1_BASE_PTR,2)
#define TMR1_FILT2                               TMR_FILT_REG(TMR1_BASE_PTR,2)
#define TMR1_DMA2                                TMR_DMA_REG(TMR1_BASE_PTR,2)
#define TMR1_COMP13                              TMR_COMP1_REG(TMR1_BASE_PTR,3)
#define TMR1_COMP23                              TMR_COMP2_REG(TMR1_BASE_PTR,3)
#define TMR1_CAPT3                               TMR_CAPT_REG(TMR1_BASE_PTR,3)
#define TMR1_LOAD3                               TMR_LOAD_REG(TMR1_BASE_PTR,3)
#define TMR1_HOLD3                               TMR_HOLD_REG(TMR1_BASE_PTR,3)
#define TMR1_CNTR3                               TMR_CNTR_REG(TMR1_BASE_PTR,3)
#define TMR1_CTRL3                               TMR_CTRL_REG(TMR1_BASE_PTR,3)
#define TMR1_SCTRL3                              TMR_SCTRL_REG(TMR1_BASE_PTR,3)
#define TMR1_CMPLD13                             TMR_CMPLD1_REG(TMR1_BASE_PTR,3)
#define TMR1_CMPLD23                             TMR_CMPLD2_REG(TMR1_BASE_PTR,3)
#define TMR1_CSCTRL3                             TMR_CSCTRL_REG(TMR1_BASE_PTR,3)
#define TMR1_FILT3                               TMR_FILT_REG(TMR1_BASE_PTR,3)
#define TMR1_DMA3                                TMR_DMA_REG(TMR1_BASE_PTR,3)
/* TMR2 */
#define TMR2_COMP10                              TMR_COMP1_REG(TMR2_BASE_PTR,0)
#define TMR2_COMP20                              TMR_COMP2_REG(TMR2_BASE_PTR,0)
#define TMR2_CAPT0                               TMR_CAPT_REG(TMR2_BASE_PTR,0)
#define TMR2_LOAD0                               TMR_LOAD_REG(TMR2_BASE_PTR,0)
#define TMR2_HOLD0                               TMR_HOLD_REG(TMR2_BASE_PTR,0)
#define TMR2_CNTR0                               TMR_CNTR_REG(TMR2_BASE_PTR,0)
#define TMR2_CTRL0                               TMR_CTRL_REG(TMR2_BASE_PTR,0)
#define TMR2_SCTRL0                              TMR_SCTRL_REG(TMR2_BASE_PTR,0)
#define TMR2_CMPLD10                             TMR_CMPLD1_REG(TMR2_BASE_PTR,0)
#define TMR2_CMPLD20                             TMR_CMPLD2_REG(TMR2_BASE_PTR,0)
#define TMR2_CSCTRL0                             TMR_CSCTRL_REG(TMR2_BASE_PTR,0)
#define TMR2_FILT0                               TMR_FILT_REG(TMR2_BASE_PTR,0)
#define TMR2_DMA0                                TMR_DMA_REG(TMR2_BASE_PTR,0)
#define TMR2_ENBL                                TMR_ENBL_REG(TMR2_BASE_PTR,0)
#define TMR2_COMP11                              TMR_COMP1_REG(TMR2_BASE_PTR,1)
#define TMR2_COMP21                              TMR_COMP2_REG(TMR2_BASE_PTR,1)
#define TMR2_CAPT1                               TMR_CAPT_REG(TMR2_BASE_PTR,1)
#define TMR2_LOAD1                               TMR_LOAD_REG(TMR2_BASE_PTR,1)
#define TMR2_HOLD1                               TMR_HOLD_REG(TMR2_BASE_PTR,1)
#define TMR2_CNTR1                               TMR_CNTR_REG(TMR2_BASE_PTR,1)
#define TMR2_CTRL1                               TMR_CTRL_REG(TMR2_BASE_PTR,1)
#define TMR2_SCTRL1                              TMR_SCTRL_REG(TMR2_BASE_PTR,1)
#define TMR2_CMPLD11                             TMR_CMPLD1_REG(TMR2_BASE_PTR,1)
#define TMR2_CMPLD21                             TMR_CMPLD2_REG(TMR2_BASE_PTR,1)
#define TMR2_CSCTRL1                             TMR_CSCTRL_REG(TMR2_BASE_PTR,1)
#define TMR2_FILT1                               TMR_FILT_REG(TMR2_BASE_PTR,1)
#define TMR2_DMA1                                TMR_DMA_REG(TMR2_BASE_PTR,1)
#define TMR2_COMP12                              TMR_COMP1_REG(TMR2_BASE_PTR,2)
#define TMR2_COMP22                              TMR_COMP2_REG(TMR2_BASE_PTR,2)
#define TMR2_CAPT2                               TMR_CAPT_REG(TMR2_BASE_PTR,2)
#define TMR2_LOAD2                               TMR_LOAD_REG(TMR2_BASE_PTR,2)
#define TMR2_HOLD2                               TMR_HOLD_REG(TMR2_BASE_PTR,2)
#define TMR2_CNTR2                               TMR_CNTR_REG(TMR2_BASE_PTR,2)
#define TMR2_CTRL2                               TMR_CTRL_REG(TMR2_BASE_PTR,2)
#define TMR2_SCTRL2                              TMR_SCTRL_REG(TMR2_BASE_PTR,2)
#define TMR2_CMPLD12                             TMR_CMPLD1_REG(TMR2_BASE_PTR,2)
#define TMR2_CMPLD22                             TMR_CMPLD2_REG(TMR2_BASE_PTR,2)
#define TMR2_CSCTRL2                             TMR_CSCTRL_REG(TMR2_BASE_PTR,2)
#define TMR2_FILT2                               TMR_FILT_REG(TMR2_BASE_PTR,2)
#define TMR2_DMA2                                TMR_DMA_REG(TMR2_BASE_PTR,2)
#define TMR2_COMP13                              TMR_COMP1_REG(TMR2_BASE_PTR,3)
#define TMR2_COMP23                              TMR_COMP2_REG(TMR2_BASE_PTR,3)
#define TMR2_CAPT3                               TMR_CAPT_REG(TMR2_BASE_PTR,3)
#define TMR2_LOAD3                               TMR_LOAD_REG(TMR2_BASE_PTR,3)
#define TMR2_HOLD3                               TMR_HOLD_REG(TMR2_BASE_PTR,3)
#define TMR2_CNTR3                               TMR_CNTR_REG(TMR2_BASE_PTR,3)
#define TMR2_CTRL3                               TMR_CTRL_REG(TMR2_BASE_PTR,3)
#define TMR2_SCTRL3                              TMR_SCTRL_REG(TMR2_BASE_PTR,3)
#define TMR2_CMPLD13                             TMR_CMPLD1_REG(TMR2_BASE_PTR,3)
#define TMR2_CMPLD23                             TMR_CMPLD2_REG(TMR2_BASE_PTR,3)
#define TMR2_CSCTRL3                             TMR_CSCTRL_REG(TMR2_BASE_PTR,3)
#define TMR2_FILT3                               TMR_FILT_REG(TMR2_BASE_PTR,3)
#define TMR2_DMA3                                TMR_DMA_REG(TMR2_BASE_PTR,3)
/* TMR3 */
#define TMR3_COMP10                              TMR_COMP1_REG(TMR3_BASE_PTR,0)
#define TMR3_COMP20                              TMR_COMP2_REG(TMR3_BASE_PTR,0)
#define TMR3_CAPT0                               TMR_CAPT_REG(TMR3_BASE_PTR,0)
#define TMR3_LOAD0                               TMR_LOAD_REG(TMR3_BASE_PTR,0)
#define TMR3_HOLD0                               TMR_HOLD_REG(TMR3_BASE_PTR,0)
#define TMR3_CNTR0                               TMR_CNTR_REG(TMR3_BASE_PTR,0)
#define TMR3_CTRL0                               TMR_CTRL_REG(TMR3_BASE_PTR,0)
#define TMR3_SCTRL0                              TMR_SCTRL_REG(TMR3_BASE_PTR,0)
#define TMR3_CMPLD10                             TMR_CMPLD1_REG(TMR3_BASE_PTR,0)
#define TMR3_CMPLD20                             TMR_CMPLD2_REG(TMR3_BASE_PTR,0)
#define TMR3_CSCTRL0                             TMR_CSCTRL_REG(TMR3_BASE_PTR,0)
#define TMR3_FILT0                               TMR_FILT_REG(TMR3_BASE_PTR,0)
#define TMR3_DMA0                                TMR_DMA_REG(TMR3_BASE_PTR,0)
#define TMR3_ENBL                                TMR_ENBL_REG(TMR3_BASE_PTR,0)
#define TMR3_COMP11                              TMR_COMP1_REG(TMR3_BASE_PTR,1)
#define TMR3_COMP21                              TMR_COMP2_REG(TMR3_BASE_PTR,1)
#define TMR3_CAPT1                               TMR_CAPT_REG(TMR3_BASE_PTR,1)
#define TMR3_LOAD1                               TMR_LOAD_REG(TMR3_BASE_PTR,1)
#define TMR3_HOLD1                               TMR_HOLD_REG(TMR3_BASE_PTR,1)
#define TMR3_CNTR1                               TMR_CNTR_REG(TMR3_BASE_PTR,1)
#define TMR3_CTRL1                               TMR_CTRL_REG(TMR3_BASE_PTR,1)
#define TMR3_SCTRL1                              TMR_SCTRL_REG(TMR3_BASE_PTR,1)
#define TMR3_CMPLD11                             TMR_CMPLD1_REG(TMR3_BASE_PTR,1)
#define TMR3_CMPLD21                             TMR_CMPLD2_REG(TMR3_BASE_PTR,1)
#define TMR3_CSCTRL1                             TMR_CSCTRL_REG(TMR3_BASE_PTR,1)
#define TMR3_FILT1                               TMR_FILT_REG(TMR3_BASE_PTR,1)
#define TMR3_DMA1                                TMR_DMA_REG(TMR3_BASE_PTR,1)
#define TMR3_COMP12                              TMR_COMP1_REG(TMR3_BASE_PTR,2)
#define TMR3_COMP22                              TMR_COMP2_REG(TMR3_BASE_PTR,2)
#define TMR3_CAPT2                               TMR_CAPT_REG(TMR3_BASE_PTR,2)
#define TMR3_LOAD2                               TMR_LOAD_REG(TMR3_BASE_PTR,2)
#define TMR3_HOLD2                               TMR_HOLD_REG(TMR3_BASE_PTR,2)
#define TMR3_CNTR2                               TMR_CNTR_REG(TMR3_BASE_PTR,2)
#define TMR3_CTRL2                               TMR_CTRL_REG(TMR3_BASE_PTR,2)
#define TMR3_SCTRL2                              TMR_SCTRL_REG(TMR3_BASE_PTR,2)
#define TMR3_CMPLD12                             TMR_CMPLD1_REG(TMR3_BASE_PTR,2)
#define TMR3_CMPLD22                             TMR_CMPLD2_REG(TMR3_BASE_PTR,2)
#define TMR3_CSCTRL2                             TMR_CSCTRL_REG(TMR3_BASE_PTR,2)
#define TMR3_FILT2                               TMR_FILT_REG(TMR3_BASE_PTR,2)
#define TMR3_DMA2                                TMR_DMA_REG(TMR3_BASE_PTR,2)
#define TMR3_COMP13                              TMR_COMP1_REG(TMR3_BASE_PTR,3)
#define TMR3_COMP23                              TMR_COMP2_REG(TMR3_BASE_PTR,3)
#define TMR3_CAPT3                               TMR_CAPT_REG(TMR3_BASE_PTR,3)
#define TMR3_LOAD3                               TMR_LOAD_REG(TMR3_BASE_PTR,3)
#define TMR3_HOLD3                               TMR_HOLD_REG(TMR3_BASE_PTR,3)
#define TMR3_CNTR3                               TMR_CNTR_REG(TMR3_BASE_PTR,3)
#define TMR3_CTRL3                               TMR_CTRL_REG(TMR3_BASE_PTR,3)
#define TMR3_SCTRL3                              TMR_SCTRL_REG(TMR3_BASE_PTR,3)
#define TMR3_CMPLD13                             TMR_CMPLD1_REG(TMR3_BASE_PTR,3)
#define TMR3_CMPLD23                             TMR_CMPLD2_REG(TMR3_BASE_PTR,3)
#define TMR3_CSCTRL3                             TMR_CSCTRL_REG(TMR3_BASE_PTR,3)
#define TMR3_FILT3                               TMR_FILT_REG(TMR3_BASE_PTR,3)
#define TMR3_DMA3                                TMR_DMA_REG(TMR3_BASE_PTR,3)
/* TMR4 */
#define TMR4_COMP10                              TMR_COMP1_REG(TMR4_BASE_PTR,0)
#define TMR4_COMP20                              TMR_COMP2_REG(TMR4_BASE_PTR,0)
#define TMR4_CAPT0                               TMR_CAPT_REG(TMR4_BASE_PTR,0)
#define TMR4_LOAD0                               TMR_LOAD_REG(TMR4_BASE_PTR,0)
#define TMR4_HOLD0                               TMR_HOLD_REG(TMR4_BASE_PTR,0)
#define TMR4_CNTR0                               TMR_CNTR_REG(TMR4_BASE_PTR,0)
#define TMR4_CTRL0                               TMR_CTRL_REG(TMR4_BASE_PTR,0)
#define TMR4_SCTRL0                              TMR_SCTRL_REG(TMR4_BASE_PTR,0)
#define TMR4_CMPLD10                             TMR_CMPLD1_REG(TMR4_BASE_PTR,0)
#define TMR4_CMPLD20                             TMR_CMPLD2_REG(TMR4_BASE_PTR,0)
#define TMR4_CSCTRL0                             TMR_CSCTRL_REG(TMR4_BASE_PTR,0)
#define TMR4_FILT0                               TMR_FILT_REG(TMR4_BASE_PTR,0)
#define TMR4_DMA0                                TMR_DMA_REG(TMR4_BASE_PTR,0)
#define TMR4_ENBL                                TMR_ENBL_REG(TMR4_BASE_PTR,0)
#define TMR4_COMP11                              TMR_COMP1_REG(TMR4_BASE_PTR,1)
#define TMR4_COMP21                              TMR_COMP2_REG(TMR4_BASE_PTR,1)
#define TMR4_CAPT1                               TMR_CAPT_REG(TMR4_BASE_PTR,1)
#define TMR4_LOAD1                               TMR_LOAD_REG(TMR4_BASE_PTR,1)
#define TMR4_HOLD1                               TMR_HOLD_REG(TMR4_BASE_PTR,1)
#define TMR4_CNTR1                               TMR_CNTR_REG(TMR4_BASE_PTR,1)
#define TMR4_CTRL1                               TMR_CTRL_REG(TMR4_BASE_PTR,1)
#define TMR4_SCTRL1                              TMR_SCTRL_REG(TMR4_BASE_PTR,1)
#define TMR4_CMPLD11                             TMR_CMPLD1_REG(TMR4_BASE_PTR,1)
#define TMR4_CMPLD21                             TMR_CMPLD2_REG(TMR4_BASE_PTR,1)
#define TMR4_CSCTRL1                             TMR_CSCTRL_REG(TMR4_BASE_PTR,1)
#define TMR4_FILT1                               TMR_FILT_REG(TMR4_BASE_PTR,1)
#define TMR4_DMA1                                TMR_DMA_REG(TMR4_BASE_PTR,1)
#define TMR4_COMP12                              TMR_COMP1_REG(TMR4_BASE_PTR,2)
#define TMR4_COMP22                              TMR_COMP2_REG(TMR4_BASE_PTR,2)
#define TMR4_CAPT2                               TMR_CAPT_REG(TMR4_BASE_PTR,2)
#define TMR4_LOAD2                               TMR_LOAD_REG(TMR4_BASE_PTR,2)
#define TMR4_HOLD2                               TMR_HOLD_REG(TMR4_BASE_PTR,2)
#define TMR4_CNTR2                               TMR_CNTR_REG(TMR4_BASE_PTR,2)
#define TMR4_CTRL2                               TMR_CTRL_REG(TMR4_BASE_PTR,2)
#define TMR4_SCTRL2                              TMR_SCTRL_REG(TMR4_BASE_PTR,2)
#define TMR4_CMPLD12                             TMR_CMPLD1_REG(TMR4_BASE_PTR,2)
#define TMR4_CMPLD22                             TMR_CMPLD2_REG(TMR4_BASE_PTR,2)
#define TMR4_CSCTRL2                             TMR_CSCTRL_REG(TMR4_BASE_PTR,2)
#define TMR4_FILT2                               TMR_FILT_REG(TMR4_BASE_PTR,2)
#define TMR4_DMA2                                TMR_DMA_REG(TMR4_BASE_PTR,2)
#define TMR4_COMP13                              TMR_COMP1_REG(TMR4_BASE_PTR,3)
#define TMR4_COMP23                              TMR_COMP2_REG(TMR4_BASE_PTR,3)
#define TMR4_CAPT3                               TMR_CAPT_REG(TMR4_BASE_PTR,3)
#define TMR4_LOAD3                               TMR_LOAD_REG(TMR4_BASE_PTR,3)
#define TMR4_HOLD3                               TMR_HOLD_REG(TMR4_BASE_PTR,3)
#define TMR4_CNTR3                               TMR_CNTR_REG(TMR4_BASE_PTR,3)
#define TMR4_CTRL3                               TMR_CTRL_REG(TMR4_BASE_PTR,3)
#define TMR4_SCTRL3                              TMR_SCTRL_REG(TMR4_BASE_PTR,3)
#define TMR4_CMPLD13                             TMR_CMPLD1_REG(TMR4_BASE_PTR,3)
#define TMR4_CMPLD23                             TMR_CMPLD2_REG(TMR4_BASE_PTR,3)
#define TMR4_CSCTRL3                             TMR_CSCTRL_REG(TMR4_BASE_PTR,3)
#define TMR4_FILT3                               TMR_FILT_REG(TMR4_BASE_PTR,3)
#define TMR4_DMA3                                TMR_DMA_REG(TMR4_BASE_PTR,3)

