AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* TMR - Register array accessors */
#define TMR1_COMP1(index)                        TMR_COMP1_REG(TMR1_BASE_PTR,index)
#define TMR2_COMP1(index)                        TMR_COMP1_REG(TMR2_BASE_PTR,index)
#define TMR3_COMP1(index)                        TMR_COMP1_REG(TMR3_BASE_PTR,index)
#define TMR4_COMP1(index)                        TMR_COMP1_REG(TMR4_BASE_PTR,index)
#define TMR1_COMP2(index)                        TMR_COMP2_REG(TMR1_BASE_PTR,index)
#define TMR2_COMP2(index)                        TMR_COMP2_REG(TMR2_BASE_PTR,index)
#define TMR3_COMP2(index)                        TMR_COMP2_REG(TMR3_BASE_PTR,index)
#define TMR4_COMP2(index)                        TMR_COMP2_REG(TMR4_BASE_PTR,index)
#define TMR1_CAPT(index)                         TMR_CAPT_REG(TMR1_BASE_PTR,index)
#define TMR2_CAPT(index)                         TMR_CAPT_REG(TMR2_BASE_PTR,index)
#define TMR3_CAPT(index)                         TMR_CAPT_REG(TMR3_BASE_PTR,index)
#define TMR4_CAPT(index)                         TMR_CAPT_REG(TMR4_BASE_PTR,index)
#define TMR1_LOAD(index)                         TMR_LOAD_REG(TMR1_BASE_PTR,index)
#define TMR2_LOAD(index)                         TMR_LOAD_REG(TMR2_BASE_PTR,index)
#define TMR3_LOAD(index)                         TMR_LOAD_REG(TMR3_BASE_PTR,index)
#define TMR4_LOAD(index)                         TMR_LOAD_REG(TMR4_BASE_PTR,index)
#define TMR1_HOLD(index)                         TMR_HOLD_REG(TMR1_BASE_PTR,index)
#define TMR2_HOLD(index)                         TMR_HOLD_REG(TMR2_BASE_PTR,index)
#define TMR3_HOLD(index)                         TMR_HOLD_REG(TMR3_BASE_PTR,index)
#define TMR4_HOLD(index)                         TMR_HOLD_REG(TMR4_BASE_PTR,index)
#define TMR1_CNTR(index)                         TMR_CNTR_REG(TMR1_BASE_PTR,index)
#define TMR2_CNTR(index)                         TMR_CNTR_REG(TMR2_BASE_PTR,index)
#define TMR3_CNTR(index)                         TMR_CNTR_REG(TMR3_BASE_PTR,index)
#define TMR4_CNTR(index)                         TMR_CNTR_REG(TMR4_BASE_PTR,index)
#define TMR1_CTRL(index)                         TMR_CTRL_REG(TMR1_BASE_PTR,index)
#define TMR2_CTRL(index)                         TMR_CTRL_REG(TMR2_BASE_PTR,index)
#define TMR3_CTRL(index)                         TMR_CTRL_REG(TMR3_BASE_PTR,index)
#define TMR4_CTRL(index)                         TMR_CTRL_REG(TMR4_BASE_PTR,index)
#define TMR1_SCTRL(index)                        TMR_SCTRL_REG(TMR1_BASE_PTR,index)
#define TMR2_SCTRL(index)                        TMR_SCTRL_REG(TMR2_BASE_PTR,index)
#define TMR3_SCTRL(index)                        TMR_SCTRL_REG(TMR3_BASE_PTR,index)
#define TMR4_SCTRL(index)                        TMR_SCTRL_REG(TMR4_BASE_PTR,index)
#define TMR1_CMPLD1(index)                       TMR_CMPLD1_REG(TMR1_BASE_PTR,index)
#define TMR2_CMPLD1(index)                       TMR_CMPLD1_REG(TMR2_BASE_PTR,index)
#define TMR3_CMPLD1(index)                       TMR_CMPLD1_REG(TMR3_BASE_PTR,index)
#define TMR4_CMPLD1(index)                       TMR_CMPLD1_REG(TMR4_BASE_PTR,index)
#define TMR1_CMPLD2(index)                       TMR_CMPLD2_REG(TMR1_BASE_PTR,index)
#define TMR2_CMPLD2(index)                       TMR_CMPLD2_REG(TMR2_BASE_PTR,index)
#define TMR3_CMPLD2(index)                       TMR_CMPLD2_REG(TMR3_BASE_PTR,index)
#define TMR4_CMPLD2(index)                       TMR_CMPLD2_REG(TMR4_BASE_PTR,index)
#define TMR1_CSCTRL(index)                       TMR_CSCTRL_REG(TMR1_BASE_PTR,index)
#define TMR2_CSCTRL(index)                       TMR_CSCTRL_REG(TMR2_BASE_PTR,index)
#define TMR3_CSCTRL(index)                       TMR_CSCTRL_REG(TMR3_BASE_PTR,index)
#define TMR4_CSCTRL(index)                       TMR_CSCTRL_REG(TMR4_BASE_PTR,index)
#define TMR1_FILT(index)                         TMR_FILT_REG(TMR1_BASE_PTR,index)
#define TMR2_FILT(index)                         TMR_FILT_REG(TMR2_BASE_PTR,index)
#define TMR3_FILT(index)                         TMR_FILT_REG(TMR3_BASE_PTR,index)
#define TMR4_FILT(index)                         TMR_FILT_REG(TMR4_BASE_PTR,index)
#define TMR1_DMA(index)                          TMR_DMA_REG(TMR1_BASE_PTR,index)
#define TMR2_DMA(index)                          TMR_DMA_REG(TMR2_BASE_PTR,index)
#define TMR3_DMA(index)                          TMR_DMA_REG(TMR3_BASE_PTR,index)
#define TMR4_DMA(index)                          TMR_DMA_REG(TMR4_BASE_PTR,index)

/*!
 * @}
 */ /* end of group TMR_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group TMR_Peripheral */


/* ----------------------------------------------------------------------------
   -- TRNG
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRNG_Peripheral TRNG
 * @{
 */

/** TRNG - Peripheral register structure */
typedef struct TRNG_MemMap {
  uint32_t MCTL;                                   /**< Miscellaneous Control Register, offset: 0x0 */
  uint32_t SCMISC;                                 /**< Statistical Check Miscellaneous Register, offset: 0x4 */
  uint32_t PKRRNG;                                 /**< Poker Range Register, offset: 0x8 */
  union {                                          /* offset: 0xC */
    uint32_t PKRMAX;                                 /**< Poker Maximum Limit Register, offset: 0xC */
    uint32_t PKRSQ;                                  /**< Poker Square Calculation Result Register, offset: 0xC */
  };
  uint32_t SDCTL;                                  /**< Seed Control Register, offset: 0x10 */
  union {                                          /* offset: 0x14 */
    uint32_t SBLIM;                                  /**< Sparse Bit Limit Register, offset: 0x14 */
    uint32_t TOTSAM;                                 /**< Total Samples Register, offset: 0x14 */
  };
  uint32_t FRQMIN;                                 /**< Frequency Count Minimum Limit Register, offset: 0x18 */
  union {                                          /* offset: 0x1C */
    uint32_t FRQCNT;                                 /**< Frequency Count Register, offset: 0x1C */
    uint32_t FRQMAX;                                 /**< Frequency Count Maximum Limit Register, offset: 0x1C */
  };
  union {                                          /* offset: 0x20 */
    uint32_t SCMC;                                   /**< Statistical Check Monobit Count Register, offset: 0x20 */
    uint32_t SCML;                                   /**< Statistical Check Monobit Limit Register, offset: 0x20 */
  };
  union {                                          /* offset: 0x24 */
    uint32_t SCR1C;                                  /**< Statistical Check Run Length 1 Count Register, offset: 0x24 */
    uint32_t SCR1L;                                  /**< Statistical Check Run Length 1 Limit Register, offset: 0x24 */
  };
  union {                                          /* offset: 0x28 */
    uint32_t SCR2C;                                  /**< Statistical Check Run Length 2 Count Register, offset: 0x28 */
    uint32_t SCR2L;                                  /**< Statistical Check Run Length 2 Limit Register, offset: 0x28 */
  };
  union {                                          /* offset: 0x2C */
    uint32_t SCR3C;                                  /**< Statistical Check Run Length 3 Count Register, offset: 0x2C */
    uint32_t SCR3L;                                  /**< Statistical Check Run Length 3 Limit Register, offset: 0x2C */
  };
  union {                                          /* offset: 0x30 */
    uint32_t SCR4C;                                  /**< Statistical Check Run Length 4 Count Register, offset: 0x30 */
    uint32_t SCR4L;                                  /**< Statistical Check Run Length 4 Limit Register, offset: 0x30 */
  };
  union {                                          /* offset: 0x34 */
    uint32_t SCR5C;                                  /**< Statistical Check Run Length 5 Count Register, offset: 0x34 */
    uint32_t SCR5L;                                  /**< Statistical Check Run Length 5 Limit Register, offset: 0x34 */
  };
  union {                                          /* offset: 0x38 */
    uint32_t SCR6PC;                                 /**< Statistical Check Run Length 6+ Count Register, offset: 0x38 */
    uint32_t SCR6PL;                                 /**< Statistical Check Run Length 6+ Limit Register, offset: 0x38 */
  };
  uint32_t STATUS;                                 /**< Status Register, offset: 0x3C */
  uint32_t ENT[16];                                /**< Entropy Read Register, array offset: 0x40, array step: 0x4 */
  uint32_t PKRCNT10;                               /**< Statistical Check Poker Count 1 and 0 Register, offset: 0x80 */
  uint32_t PKRCNT32;                               /**< Statistical Check Poker Count 3 and 2 Register, offset: 0x84 */
  uint32_t PKRCNT54;                               /**< Statistical Check Poker Count 5 and 4 Register, offset: 0x88 */
  uint32_t PKRCNT76;                               /**< Statistical Check Poker Count 7 and 6 Register, offset: 0x8C */
  uint32_t PKRCNT98;                               /**< Statistical Check Poker Count 9 and 8 Register, offset: 0x90 */
  uint32_t PKRCNTBA;                               /**< Statistical Check Poker Count B and A Register, offset: 0x94 */
  uint32_t PKRCNTDC;                               /**< Statistical Check Poker Count D and C Register, offset: 0x98 */
  uint32_t PKRCNTFE;                               /**< Statistical Check Poker Count F and E Register, offset: 0x9C */
  uint32_t SEC_CFG;                                /**< Security Configuration Register, offset: 0xA0 */
  uint32_t INT_CTRL;                               /**< Interrupt Control Register, offset: 0xA4 */
  uint32_t INT_MASK;                               /**< Mask Register, offset: 0xA8 */
  uint32_t INT_STATUS;                             /**< Interrupt Status Register, offset: 0xAC */
  uint8_t RESERVED_0[64];
  uint32_t VID1;                                   /**< Version ID Register (MS), offset: 0xF0 */
  uint32_t VID2;                                   /**< Version ID Register (LS), offset: 0xF4 */
} volatile *TRNG_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- TRNG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRNG_Register_Accessor_Macros TRNG - Register accessor macros
 * @{
 */


/* TRNG - Register accessors */
#define TRNG_MCTL_REG(base)                      ((base)->MCTL)
#define TRNG_SCMISC_REG(base)                    ((base)->SCMISC)
#define TRNG_PKRRNG_REG(base)                    ((base)->PKRRNG)
#define TRNG_PKRMAX_REG(base)                    ((base)->PKRMAX)
#define TRNG_PKRSQ_REG(base)                     ((base)->PKRSQ)
#define TRNG_SDCTL_REG(base)                     ((base)->SDCTL)
#define TRNG_SBLIM_REG(base)                     ((base)->SBLIM)
#define TRNG_TOTSAM_REG(base)                    ((base)->TOTSAM)
#define TRNG_FRQMIN_REG(base)                    ((base)->FRQMIN)
#define TRNG_FRQCNT_REG(base)                    ((base)->FRQCNT)
#define TRNG_FRQMAX_REG(base)                    ((base)->FRQMAX)
#define TRNG_SCMC_REG(base)                      ((base)->SCMC)
#define TRNG_SCML_REG(base)                      ((base)->SCML)
#define TRNG_SCR1C_REG(base)                     ((base)->SCR1C)
#define TRNG_SCR1L_REG(base)                     ((base)->SCR1L)
#define TRNG_SCR2C_REG(base)                     ((base)->SCR2C)
#define TRNG_SCR2L_REG(base)                     ((base)->SCR2L)
#define TRNG_SCR3C_REG(base)                     ((base)->SCR3C)
#define TRNG_SCR3L_REG(base)                     ((base)->SCR3L)
#define TRNG_SCR4C_REG(base)                     ((base)->SCR4C)
#define TRNG_SCR4L_REG(base)                     ((base)->SCR4L)
#define TRNG_SCR5C_REG(base)                     ((base)->SCR5C)
#define TRNG_SCR5L_REG(base)                     ((base)->SCR5L)
#define TRNG_SCR6PC_REG(base)                    ((base)->SCR6PC)
#define TRNG_SCR6PL_REG(base)                    ((base)->SCR6PL)
#define TRNG_STATUS_REG(base)                    ((base)->STATUS)
#define TRNG_ENT_REG(base,index)                 ((base)->ENT[index])
#define TRNG_PKRCNT10_REG(base)                  ((base)->PKRCNT10)
#define TRNG_PKRCNT32_REG(base)                  ((base)->PKRCNT32)
#define TRNG_PKRCNT54_REG(base)                  ((base)->PKRCNT54)
#define TRNG_PKRCNT76_REG(base)                  ((base)->PKRCNT76)
#define TRNG_PKRCNT98_REG(base)                  ((base)->PKRCNT98)
#define TRNG_PKRCNTBA_REG(base)                  ((base)->PKRCNTBA)
#define TRNG_PKRCNTDC_REG(base)                  ((base)->PKRCNTDC)
#define TRNG_PKRCNTFE_REG(base)                  ((base)->PKRCNTFE)
#define TRNG_SEC_CFG_REG(base)                   ((base)->SEC_CFG)
#define TRNG_INT_CTRL_REG(base)                  ((base)->INT_CTRL)
#define TRNG_INT_MASK_REG(base)                  ((base)->INT_MASK)
#define TRNG_INT_STATUS_REG(base)                ((base)->INT_STATUS)
#define TRNG_VID1_REG(base)                      ((base)->VID1)
#define TRNG_VID2_REG(base)                      ((base)->VID2)

/*!
 * @}
 */ /* end of group TRNG_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- TRNG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRNG_Register_Masks TRNG Register Masks
 * @{
 */

/*! @name MCTL - Miscellaneous Control Register */
#define TRNG_MCTL_SAMP_MODE_MASK                 (0x3U)
#define TRNG_MCTL_SAMP_MODE_SHIFT                (0U)
#define TRNG_MCTL_SAMP_MODE(x)                   (((uint32_t)(((uint32_t)(x)) << TRNG_MCTL_SAMP_MODE_SHIFT)) & TRNG_MCTL_SAMP_MODE_MASK)
#define TRNG_MCTL_OSC_DIV_MASK                   (0xCU)
#define TRNG_MCTL_OSC_DIV_SHIFT                  (2U)
#define TRNG_MCTL_OSC_DIV(x)                     (((uint32_t)(((uint32_t)(x)) << TRNG_MCTL_OSC_DIV_SHIFT)) & TRNG_MCTL_OSC_DIV_MASK)
#define TRNG_MCTL_UNUSED4_MASK                   (0x10U)
#define TRNG_MCTL_UNUSED4_SHIFT                  (4U)
#define TRNG_MCTL_UNUSED5_MASK                   (0x20U)
#define TRNG_MCTL_UNUSED5_SHIFT                  (5U)
#define TRNG_MCTL_RST_DEF_MASK                   (0x40U)
#define TRNG_MCTL_RST_DEF_SHIFT                  (6U)
#define TRNG_MCTL_FOR_SCLK_MASK                  (0x80U)
#define TRNG_MCTL_FOR_SCLK_SHIFT                 (7U)
#define TRNG_MCTL_FCT_FAIL_MASK                  (0x100U)
#define TRNG_MCTL_FCT_FAIL_SHIFT                 (8U)
#define TRNG_MCTL_FCT_VAL_MASK                   (0x200U)
#define TRNG_MCTL_FCT_VAL_SHIFT                  (9U)
#define TRNG_MCTL_ENT_VAL_MASK                   (0x400U)
#define TRNG_MCTL_ENT_VAL_SHIFT                  (10U)
#define TRNG_MCTL_TST_OUT_MASK                   (0x800U)
#define TRNG_MCTL_TST_OUT_SHIFT                  (11U)
#define TRNG_MCTL_ERR_MASK                       (0x1000U)
#define TRNG_MCTL_ERR_SHIFT                      (12U)
#define TRNG_MCTL_TSTOP_OK_MASK                  (0x2000U)
#define TRNG_MCTL_TSTOP_OK_SHIFT                 (13U)
#define TRNG_MCTL_LRUN_CONT_MASK                 (0x4000U)
#define TRNG_MCTL_LRUN_CONT_SHIFT                (14U)
#define TRNG_MCTL_PRGM_MASK                      (0x10000U)
#define TRNG_MCTL_PRGM_SHIFT                     (16U)

/*! @name SCMISC - Statistical Check Miscellaneous Register */
#define TRNG_SCMISC_LRUN_MAX_MASK                (0xFFU)
#define TRNG_SCMISC_LRUN_MAX_SHIFT               (0U)
#define TRNG_SCMISC_LRUN_MAX(x)                  (((uint32_t)(((uint32_t)(x)) << TRNG_SCMISC_LRUN_MAX_SHIFT)) & TRNG_SCMISC_LRUN_MAX_MASK)
#define TRNG_SCMISC_RTY_CT_MASK                  (0xF0000U)
#define TRNG_SCMISC_RTY_CT_SHIFT                 (16U)
#define TRNG_SCMISC_RTY_CT(x)                    (((uint32_t)(((uint32_t)(x)) << TRNG_SCMISC_RTY_CT_SHIFT)) & TRNG_SCMISC_RTY_CT_MASK)

