AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name PKRCNTBA - Statistical Check Poker Count B and A Register */
#define TRNG_PKRCNTBA_PKR_A_CT_MASK              (0xFFFFU)
#define TRNG_PKRCNTBA_PKR_A_CT_SHIFT             (0U)
#define TRNG_PKRCNTBA_PKR_A_CT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_PKRCNTBA_PKR_A_CT_SHIFT)) & TRNG_PKRCNTBA_PKR_A_CT_MASK)
#define TRNG_PKRCNTBA_PKR_B_CT_MASK              (0xFFFF0000U)
#define TRNG_PKRCNTBA_PKR_B_CT_SHIFT             (16U)
#define TRNG_PKRCNTBA_PKR_B_CT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_PKRCNTBA_PKR_B_CT_SHIFT)) & TRNG_PKRCNTBA_PKR_B_CT_MASK)

/*! @name PKRCNTDC - Statistical Check Poker Count D and C Register */
#define TRNG_PKRCNTDC_PKR_C_CT_MASK              (0xFFFFU)
#define TRNG_PKRCNTDC_PKR_C_CT_SHIFT             (0U)
#define TRNG_PKRCNTDC_PKR_C_CT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_PKRCNTDC_PKR_C_CT_SHIFT)) & TRNG_PKRCNTDC_PKR_C_CT_MASK)
#define TRNG_PKRCNTDC_PKR_D_CT_MASK              (0xFFFF0000U)
#define TRNG_PKRCNTDC_PKR_D_CT_SHIFT             (16U)
#define TRNG_PKRCNTDC_PKR_D_CT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_PKRCNTDC_PKR_D_CT_SHIFT)) & TRNG_PKRCNTDC_PKR_D_CT_MASK)

/*! @name PKRCNTFE - Statistical Check Poker Count F and E Register */
#define TRNG_PKRCNTFE_PKR_E_CT_MASK              (0xFFFFU)
#define TRNG_PKRCNTFE_PKR_E_CT_SHIFT             (0U)
#define TRNG_PKRCNTFE_PKR_E_CT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_PKRCNTFE_PKR_E_CT_SHIFT)) & TRNG_PKRCNTFE_PKR_E_CT_MASK)
#define TRNG_PKRCNTFE_PKR_F_CT_MASK              (0xFFFF0000U)
#define TRNG_PKRCNTFE_PKR_F_CT_SHIFT             (16U)
#define TRNG_PKRCNTFE_PKR_F_CT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_PKRCNTFE_PKR_F_CT_SHIFT)) & TRNG_PKRCNTFE_PKR_F_CT_MASK)

/*! @name SEC_CFG - Security Configuration Register */
#define TRNG_SEC_CFG_UNUSED0_MASK                (0x1U)
#define TRNG_SEC_CFG_UNUSED0_SHIFT               (0U)
#define TRNG_SEC_CFG_NO_PRGM_MASK                (0x2U)
#define TRNG_SEC_CFG_NO_PRGM_SHIFT               (1U)
#define TRNG_SEC_CFG_UNUSED2_MASK                (0x4U)
#define TRNG_SEC_CFG_UNUSED2_SHIFT               (2U)

/*! @name INT_CTRL - Interrupt Control Register */
#define TRNG_INT_CTRL_HW_ERR_MASK                (0x1U)
#define TRNG_INT_CTRL_HW_ERR_SHIFT               (0U)
#define TRNG_INT_CTRL_ENT_VAL_MASK               (0x2U)
#define TRNG_INT_CTRL_ENT_VAL_SHIFT              (1U)
#define TRNG_INT_CTRL_FRQ_CT_FAIL_MASK           (0x4U)
#define TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT          (2U)
#define TRNG_INT_CTRL_UNUSED_MASK                (0xFFFFFFF8U)
#define TRNG_INT_CTRL_UNUSED_SHIFT               (3U)
#define TRNG_INT_CTRL_UNUSED(x)                  (((uint32_t)(((uint32_t)(x)) << TRNG_INT_CTRL_UNUSED_SHIFT)) & TRNG_INT_CTRL_UNUSED_MASK)

/*! @name INT_MASK - Mask Register */
#define TRNG_INT_MASK_HW_ERR_MASK                (0x1U)
#define TRNG_INT_MASK_HW_ERR_SHIFT               (0U)
#define TRNG_INT_MASK_ENT_VAL_MASK               (0x2U)
#define TRNG_INT_MASK_ENT_VAL_SHIFT              (1U)
#define TRNG_INT_MASK_FRQ_CT_FAIL_MASK           (0x4U)
#define TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT          (2U)

/*! @name INT_STATUS - Interrupt Status Register */
#define TRNG_INT_STATUS_HW_ERR_MASK              (0x1U)
#define TRNG_INT_STATUS_HW_ERR_SHIFT             (0U)
#define TRNG_INT_STATUS_ENT_VAL_MASK             (0x2U)
#define TRNG_INT_STATUS_ENT_VAL_SHIFT            (1U)
#define TRNG_INT_STATUS_FRQ_CT_FAIL_MASK         (0x4U)
#define TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT        (2U)

/*! @name VID1 - Version ID Register (MS) */
#define TRNG_VID1_MIN_REV_MASK                   (0xFFU)
#define TRNG_VID1_MIN_REV_SHIFT                  (0U)
#define TRNG_VID1_MIN_REV(x)                     (((uint32_t)(((uint32_t)(x)) << TRNG_VID1_MIN_REV_SHIFT)) & TRNG_VID1_MIN_REV_MASK)
#define TRNG_VID1_MAJ_REV_MASK                   (0xFF00U)
#define TRNG_VID1_MAJ_REV_SHIFT                  (8U)
#define TRNG_VID1_MAJ_REV(x)                     (((uint32_t)(((uint32_t)(x)) << TRNG_VID1_MAJ_REV_SHIFT)) & TRNG_VID1_MAJ_REV_MASK)
#define TRNG_VID1_IP_ID_MASK                     (0xFFFF0000U)
#define TRNG_VID1_IP_ID_SHIFT                    (16U)
#define TRNG_VID1_IP_ID(x)                       (((uint32_t)(((uint32_t)(x)) << TRNG_VID1_IP_ID_SHIFT)) & TRNG_VID1_IP_ID_MASK)

/*! @name VID2 - Version ID Register (LS) */
#define TRNG_VID2_CONFIG_OPT_MASK                (0xFFU)
#define TRNG_VID2_CONFIG_OPT_SHIFT               (0U)
#define TRNG_VID2_CONFIG_OPT(x)                  (((uint32_t)(((uint32_t)(x)) << TRNG_VID2_CONFIG_OPT_SHIFT)) & TRNG_VID2_CONFIG_OPT_MASK)
#define TRNG_VID2_ECO_REV_MASK                   (0xFF00U)
#define TRNG_VID2_ECO_REV_SHIFT                  (8U)
#define TRNG_VID2_ECO_REV(x)                     (((uint32_t)(((uint32_t)(x)) << TRNG_VID2_ECO_REV_SHIFT)) & TRNG_VID2_ECO_REV_MASK)
#define TRNG_VID2_INTG_OPT_MASK                  (0xFF0000U)
#define TRNG_VID2_INTG_OPT_SHIFT                 (16U)
#define TRNG_VID2_INTG_OPT(x)                    (((uint32_t)(((uint32_t)(x)) << TRNG_VID2_INTG_OPT_SHIFT)) & TRNG_VID2_INTG_OPT_MASK)
#define TRNG_VID2_ERA_MASK                       (0xFF000000U)
#define TRNG_VID2_ERA_SHIFT                      (24U)
#define TRNG_VID2_ERA(x)                         (((uint32_t)(((uint32_t)(x)) << TRNG_VID2_ERA_SHIFT)) & TRNG_VID2_ERA_MASK)


/*!
 * @}
 */ /* end of group TRNG_Register_Masks */


/* TRNG - Peripheral instance base addresses */
/** Peripheral TRNG base pointer */
#define TRNG_BASE_PTR                            ((TRNG_MemMapPtr)0x400CC000u)
/** Array initializer of TRNG peripheral base pointers */
#define TRNG_BASE_PTRS                           { TRNG_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- TRNG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRNG_Register_Accessor_Macros TRNG - Register accessor macros
 * @{
 */


/* TRNG - Register instance definitions */
/* TRNG */
#define TRNG_MCTL                                TRNG_MCTL_REG(TRNG_BASE_PTR)
#define TRNG_SCMISC                              TRNG_SCMISC_REG(TRNG_BASE_PTR)
#define TRNG_PKRRNG                              TRNG_PKRRNG_REG(TRNG_BASE_PTR)
#define TRNG_PKRMAX                              TRNG_PKRMAX_REG(TRNG_BASE_PTR)
#define TRNG_PKRSQ                               TRNG_PKRSQ_REG(TRNG_BASE_PTR)
#define TRNG_SDCTL                               TRNG_SDCTL_REG(TRNG_BASE_PTR)
#define TRNG_SBLIM                               TRNG_SBLIM_REG(TRNG_BASE_PTR)
#define TRNG_TOTSAM                              TRNG_TOTSAM_REG(TRNG_BASE_PTR)
#define TRNG_FRQMIN                              TRNG_FRQMIN_REG(TRNG_BASE_PTR)
#define TRNG_FRQCNT                              TRNG_FRQCNT_REG(TRNG_BASE_PTR)
#define TRNG_FRQMAX                              TRNG_FRQMAX_REG(TRNG_BASE_PTR)
#define TRNG_SCMC                                TRNG_SCMC_REG(TRNG_BASE_PTR)
#define TRNG_SCML                                TRNG_SCML_REG(TRNG_BASE_PTR)
#define TRNG_SCR1C                               TRNG_SCR1C_REG(TRNG_BASE_PTR)
#define TRNG_SCR1L                               TRNG_SCR1L_REG(TRNG_BASE_PTR)
#define TRNG_SCR2C                               TRNG_SCR2C_REG(TRNG_BASE_PTR)
#define TRNG_SCR2L                               TRNG_SCR2L_REG(TRNG_BASE_PTR)
#define TRNG_SCR3C                               TRNG_SCR3C_REG(TRNG_BASE_PTR)
#define TRNG_SCR3L                               TRNG_SCR3L_REG(TRNG_BASE_PTR)
#define TRNG_SCR4C                               TRNG_SCR4C_REG(TRNG_BASE_PTR)
#define TRNG_SCR4L                               TRNG_SCR4L_REG(TRNG_BASE_PTR)
#define TRNG_SCR5C                               TRNG_SCR5C_REG(TRNG_BASE_PTR)
#define TRNG_SCR5L                               TRNG_SCR5L_REG(TRNG_BASE_PTR)
#define TRNG_SCR6PC                              TRNG_SCR6PC_REG(TRNG_BASE_PTR)
#define TRNG_SCR6PL                              TRNG_SCR6PL_REG(TRNG_BASE_PTR)
#define TRNG_STATUS                              TRNG_STATUS_REG(TRNG_BASE_PTR)
#define TRNG_ENT0                                TRNG_ENT_REG(TRNG_BASE_PTR,0)
#define TRNG_ENT1                                TRNG_ENT_REG(TRNG_BASE_PTR,1)
#define TRNG_ENT2                                TRNG_ENT_REG(TRNG_BASE_PTR,2)
#define TRNG_ENT3                                TRNG_ENT_REG(TRNG_BASE_PTR,3)
#define TRNG_ENT4                                TRNG_ENT_REG(TRNG_BASE_PTR,4)
#define TRNG_ENT5                                TRNG_ENT_REG(TRNG_BASE_PTR,5)
#define TRNG_ENT6                                TRNG_ENT_REG(TRNG_BASE_PTR,6)
#define TRNG_ENT7                                TRNG_ENT_REG(TRNG_BASE_PTR,7)
#define TRNG_ENT8                                TRNG_ENT_REG(TRNG_BASE_PTR,8)
#define TRNG_ENT9                                TRNG_ENT_REG(TRNG_BASE_PTR,9)
#define TRNG_ENT10                               TRNG_ENT_REG(TRNG_BASE_PTR,10)
#define TRNG_ENT11                               TRNG_ENT_REG(TRNG_BASE_PTR,11)
#define TRNG_ENT12                               TRNG_ENT_REG(TRNG_BASE_PTR,12)
#define TRNG_ENT13                               TRNG_ENT_REG(TRNG_BASE_PTR,13)
#define TRNG_ENT14                               TRNG_ENT_REG(TRNG_BASE_PTR,14)
#define TRNG_ENT15                               TRNG_ENT_REG(TRNG_BASE_PTR,15)
#define TRNG_PKRCNT10                            TRNG_PKRCNT10_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNT32                            TRNG_PKRCNT32_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNT54                            TRNG_PKRCNT54_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNT76                            TRNG_PKRCNT76_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNT98                            TRNG_PKRCNT98_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNTBA                            TRNG_PKRCNTBA_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNTDC                            TRNG_PKRCNTDC_REG(TRNG_BASE_PTR)
#define TRNG_PKRCNTFE                            TRNG_PKRCNTFE_REG(TRNG_BASE_PTR)
#define TRNG_SEC_CFG                             TRNG_SEC_CFG_REG(TRNG_BASE_PTR)
#define TRNG_INT_CTRL                            TRNG_INT_CTRL_REG(TRNG_BASE_PTR)
#define TRNG_INT_MASK                            TRNG_INT_MASK_REG(TRNG_BASE_PTR)
#define TRNG_INT_STATUS                          TRNG_INT_STATUS_REG(TRNG_BASE_PTR)
#define TRNG_VID1                                TRNG_VID1_REG(TRNG_BASE_PTR)
#define TRNG_VID2                                TRNG_VID2_REG(TRNG_BASE_PTR)

