AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name ENDPTPRIME - Endpoint Prime */
#define USB_ENDPTPRIME_PERB_MASK                 (0xFFU)
#define USB_ENDPTPRIME_PERB_SHIFT                (0U)
#define USB_ENDPTPRIME_PERB(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ENDPTPRIME_PERB_SHIFT)) & USB_ENDPTPRIME_PERB_MASK)
#define USB_ENDPTPRIME_PETB_MASK                 (0xFF0000U)
#define USB_ENDPTPRIME_PETB_SHIFT                (16U)
#define USB_ENDPTPRIME_PETB(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ENDPTPRIME_PETB_SHIFT)) & USB_ENDPTPRIME_PETB_MASK)

/*! @name ENDPTFLUSH - Endpoint Flush */
#define USB_ENDPTFLUSH_FERB_MASK                 (0xFFU)
#define USB_ENDPTFLUSH_FERB_SHIFT                (0U)
#define USB_ENDPTFLUSH_FERB(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ENDPTFLUSH_FERB_SHIFT)) & USB_ENDPTFLUSH_FERB_MASK)
#define USB_ENDPTFLUSH_FETB_MASK                 (0xFF0000U)
#define USB_ENDPTFLUSH_FETB_SHIFT                (16U)
#define USB_ENDPTFLUSH_FETB(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ENDPTFLUSH_FETB_SHIFT)) & USB_ENDPTFLUSH_FETB_MASK)

/*! @name ENDPTSTAT - Endpoint Status */
#define USB_ENDPTSTAT_ERBR_MASK                  (0xFFU)
#define USB_ENDPTSTAT_ERBR_SHIFT                 (0U)
#define USB_ENDPTSTAT_ERBR(x)                    (((uint32_t)(((uint32_t)(x)) << USB_ENDPTSTAT_ERBR_SHIFT)) & USB_ENDPTSTAT_ERBR_MASK)
#define USB_ENDPTSTAT_ETBR_MASK                  (0xFF0000U)
#define USB_ENDPTSTAT_ETBR_SHIFT                 (16U)
#define USB_ENDPTSTAT_ETBR(x)                    (((uint32_t)(((uint32_t)(x)) << USB_ENDPTSTAT_ETBR_SHIFT)) & USB_ENDPTSTAT_ETBR_MASK)

/*! @name ENDPTCOMPLETE - Endpoint Complete */
#define USB_ENDPTCOMPLETE_ERCE_MASK              (0xFFU)
#define USB_ENDPTCOMPLETE_ERCE_SHIFT             (0U)
#define USB_ENDPTCOMPLETE_ERCE(x)                (((uint32_t)(((uint32_t)(x)) << USB_ENDPTCOMPLETE_ERCE_SHIFT)) & USB_ENDPTCOMPLETE_ERCE_MASK)
#define USB_ENDPTCOMPLETE_ETCE_MASK              (0xFF0000U)
#define USB_ENDPTCOMPLETE_ETCE_SHIFT             (16U)
#define USB_ENDPTCOMPLETE_ETCE(x)                (((uint32_t)(((uint32_t)(x)) << USB_ENDPTCOMPLETE_ETCE_SHIFT)) & USB_ENDPTCOMPLETE_ETCE_MASK)

/*! @name ENDPTCTRL0 - Endpoint Control0 */
#define USB_ENDPTCTRL0_RXS_MASK                  (0x1U)
#define USB_ENDPTCTRL0_RXS_SHIFT                 (0U)
#define USB_ENDPTCTRL0_RXT_MASK                  (0xCU)
#define USB_ENDPTCTRL0_RXT_SHIFT                 (2U)
#define USB_ENDPTCTRL0_RXT(x)                    (((uint32_t)(((uint32_t)(x)) << USB_ENDPTCTRL0_RXT_SHIFT)) & USB_ENDPTCTRL0_RXT_MASK)
#define USB_ENDPTCTRL0_RXE_MASK                  (0x80U)
#define USB_ENDPTCTRL0_RXE_SHIFT                 (7U)
#define USB_ENDPTCTRL0_TXS_MASK                  (0x10000U)
#define USB_ENDPTCTRL0_TXS_SHIFT                 (16U)
#define USB_ENDPTCTRL0_TXT_MASK                  (0xC0000U)
#define USB_ENDPTCTRL0_TXT_SHIFT                 (18U)
#define USB_ENDPTCTRL0_TXT(x)                    (((uint32_t)(((uint32_t)(x)) << USB_ENDPTCTRL0_TXT_SHIFT)) & USB_ENDPTCTRL0_TXT_MASK)
#define USB_ENDPTCTRL0_TXE_MASK                  (0x800000U)
#define USB_ENDPTCTRL0_TXE_SHIFT                 (23U)

/*! @name ENDPTCTRL - Endpoint Control 1..Endpoint Control 7 */
#define USB_ENDPTCTRL_RXS_MASK                   (0x1U)
#define USB_ENDPTCTRL_RXS_SHIFT                  (0U)
#define USB_ENDPTCTRL_RXD_MASK                   (0x2U)
#define USB_ENDPTCTRL_RXD_SHIFT                  (1U)
#define USB_ENDPTCTRL_RXT_MASK                   (0xCU)
#define USB_ENDPTCTRL_RXT_SHIFT                  (2U)
#define USB_ENDPTCTRL_RXT(x)                     (((uint32_t)(((uint32_t)(x)) << USB_ENDPTCTRL_RXT_SHIFT)) & USB_ENDPTCTRL_RXT_MASK)
#define USB_ENDPTCTRL_RXI_MASK                   (0x20U)
#define USB_ENDPTCTRL_RXI_SHIFT                  (5U)
#define USB_ENDPTCTRL_RXR_MASK                   (0x40U)
#define USB_ENDPTCTRL_RXR_SHIFT                  (6U)
#define USB_ENDPTCTRL_RXE_MASK                   (0x80U)
#define USB_ENDPTCTRL_RXE_SHIFT                  (7U)
#define USB_ENDPTCTRL_TXS_MASK                   (0x10000U)
#define USB_ENDPTCTRL_TXS_SHIFT                  (16U)
#define USB_ENDPTCTRL_TXD_MASK                   (0x20000U)
#define USB_ENDPTCTRL_TXD_SHIFT                  (17U)
#define USB_ENDPTCTRL_TXT_MASK                   (0xC0000U)
#define USB_ENDPTCTRL_TXT_SHIFT                  (18U)
#define USB_ENDPTCTRL_TXT(x)                     (((uint32_t)(((uint32_t)(x)) << USB_ENDPTCTRL_TXT_SHIFT)) & USB_ENDPTCTRL_TXT_MASK)
#define USB_ENDPTCTRL_TXI_MASK                   (0x200000U)
#define USB_ENDPTCTRL_TXI_SHIFT                  (21U)
#define USB_ENDPTCTRL_TXR_MASK                   (0x400000U)
#define USB_ENDPTCTRL_TXR_SHIFT                  (22U)
#define USB_ENDPTCTRL_TXE_MASK                   (0x800000U)
#define USB_ENDPTCTRL_TXE_SHIFT                  (23U)

/* The count of USB_ENDPTCTRL */
#define USB_ENDPTCTRL_COUNT                      (7U)


/*!
 * @}
 */ /* end of group USB_Register_Masks */


/* USB - Peripheral instance base addresses */
/** Peripheral USB1 base pointer */
#define USB1_BASE_PTR                            ((USB_MemMapPtr)0x402E0000u)
/** Peripheral USB2 base pointer */
#define USB2_BASE_PTR                            ((USB_MemMapPtr)0x402E0200u)
/** Array initializer of USB peripheral base pointers */
#define USB_BASE_PTRS                            { USB1_BASE_PTR, USB2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USB_Register_Accessor_Macros USB - Register accessor macros
 * @{
 */


/* USB - Register instance definitions */
/* USB1 */
#define USB_UOG1_ID                              USB_ID_REG(USB1_BASE_PTR)
#define USB_UOG1_HWGENERAL                       USB_HWGENERAL_REG(USB1_BASE_PTR)
#define USB_UOG1_HWHOST                          USB_HWHOST_REG(USB1_BASE_PTR)
#define USB_UOG1_HWDEVICE                        USB_HWDEVICE_REG(USB1_BASE_PTR)
#define USB_UOG1_HWTXBUF                         USB_HWTXBUF_REG(USB1_BASE_PTR)
#define USB_UOG1_HWRXBUF                         USB_HWRXBUF_REG(USB1_BASE_PTR)
#define USB_UOG1_GPTIMER0LD                      USB_GPTIMER0LD_REG(USB1_BASE_PTR)
#define USB_UOG1_GPTIMER0CTRL                    USB_GPTIMER0CTRL_REG(USB1_BASE_PTR)
#define USB_UOG1_GPTIMER1LD                      USB_GPTIMER1LD_REG(USB1_BASE_PTR)
#define USB_UOG1_GPTIMER1CTRL                    USB_GPTIMER1CTRL_REG(USB1_BASE_PTR)
#define USB_UOG1_SBUSCFG                         USB_SBUSCFG_REG(USB1_BASE_PTR)
#define USB_UOG1_CAPLENGTH                       USB_CAPLENGTH_REG(USB1_BASE_PTR)
#define USB_UOG1_HCIVERSION                      USB_HCIVERSION_REG(USB1_BASE_PTR)
#define USB_UOG1_HCSPARAMS                       USB_HCSPARAMS_REG(USB1_BASE_PTR)
#define USB_UOG1_HCCPARAMS                       USB_HCCPARAMS_REG(USB1_BASE_PTR)
#define USB_UOG1_DCIVERSION                      USB_DCIVERSION_REG(USB1_BASE_PTR)
#define USB_UOG1_DCCPARAMS                       USB_DCCPARAMS_REG(USB1_BASE_PTR)
#define USB_UOG1_USBCMD                          USB_USBCMD_REG(USB1_BASE_PTR)
#define USB_UOG1_USBSTS                          USB_USBSTS_REG(USB1_BASE_PTR)
#define USB_UOG1_USBINTR                         USB_USBINTR_REG(USB1_BASE_PTR)
#define USB_UOG1_FRINDEX                         USB_FRINDEX_REG(USB1_BASE_PTR)
#define USB_UOG1_DEVICEADDR                      USB_DEVICEADDR_REG(USB1_BASE_PTR)
#define USB_UOG1_PERIODICLISTBASE                USB_PERIODICLISTBASE_REG(USB1_BASE_PTR)
#define USB_UOG1_ASYNCLISTADDR                   USB_ASYNCLISTADDR_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTLISTADDR                   USB_ENDPTLISTADDR_REG(USB1_BASE_PTR)
#define USB_UOG1_BURSTSIZE                       USB_BURSTSIZE_REG(USB1_BASE_PTR)
#define USB_UOG1_TXFILLTUNING                    USB_TXFILLTUNING_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTNAK                        USB_ENDPTNAK_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTNAKEN                      USB_ENDPTNAKEN_REG(USB1_BASE_PTR)
#define USB_UOG1_CONFIGFLAG                      USB_CONFIGFLAG_REG(USB1_BASE_PTR)
#define USB_UOG1_PORTSC1                         USB_PORTSC1_REG(USB1_BASE_PTR)
#define USB_UOG1_OTGSC                           USB_OTGSC_REG(USB1_BASE_PTR)
#define USB_UOG1_USBMODE                         USB_USBMODE_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTSETUPSTAT                  USB_ENDPTSETUPSTAT_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTPRIME                      USB_ENDPTPRIME_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTFLUSH                      USB_ENDPTFLUSH_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTSTAT                       USB_ENDPTSTAT_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTCOMPLETE                   USB_ENDPTCOMPLETE_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTCTRL0                      USB_ENDPTCTRL0_REG(USB1_BASE_PTR)
#define USB_UOG1_ENDPTCTRL1                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,0)
#define USB_UOG1_ENDPTCTRL2                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,1)
#define USB_UOG1_ENDPTCTRL3                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,2)
#define USB_UOG1_ENDPTCTRL4                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,3)
#define USB_UOG1_ENDPTCTRL5                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,4)
#define USB_UOG1_ENDPTCTRL6                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,5)
#define USB_UOG1_ENDPTCTRL7                      USB_ENDPTCTRL_REG(USB1_BASE_PTR,6)
/* USB2 */
#define USB_UOG2_ID                              USB_ID_REG(USB2_BASE_PTR)
#define USB_UOG2_HWGENERAL                       USB_HWGENERAL_REG(USB2_BASE_PTR)
#define USB_UOG2_HWHOST                          USB_HWHOST_REG(USB2_BASE_PTR)
#define USB_UOG2_HWDEVICE                        USB_HWDEVICE_REG(USB2_BASE_PTR)
#define USB_UOG2_HWTXBUF                         USB_HWTXBUF_REG(USB2_BASE_PTR)
#define USB_UOG2_HWRXBUF                         USB_HWRXBUF_REG(USB2_BASE_PTR)
#define USB_UOG2_GPTIMER0LD                      USB_GPTIMER0LD_REG(USB2_BASE_PTR)
#define USB_UOG2_GPTIMER0CTRL                    USB_GPTIMER0CTRL_REG(USB2_BASE_PTR)
#define USB_UOG2_GPTIMER1LD                      USB_GPTIMER1LD_REG(USB2_BASE_PTR)
#define USB_UOG2_GPTIMER1CTRL                    USB_GPTIMER1CTRL_REG(USB2_BASE_PTR)
#define USB_UOG2_SBUSCFG                         USB_SBUSCFG_REG(USB2_BASE_PTR)
#define USB_UOG2_CAPLENGTH                       USB_CAPLENGTH_REG(USB2_BASE_PTR)
#define USB_UOG2_HCIVERSION                      USB_HCIVERSION_REG(USB2_BASE_PTR)
#define USB_UOG2_HCSPARAMS                       USB_HCSPARAMS_REG(USB2_BASE_PTR)
#define USB_UOG2_HCCPARAMS                       USB_HCCPARAMS_REG(USB2_BASE_PTR)
#define USB_UOG2_DCIVERSION                      USB_DCIVERSION_REG(USB2_BASE_PTR)
#define USB_UOG2_DCCPARAMS                       USB_DCCPARAMS_REG(USB2_BASE_PTR)
#define USB_UOG2_USBCMD                          USB_USBCMD_REG(USB2_BASE_PTR)
#define USB_UOG2_USBSTS                          USB_USBSTS_REG(USB2_BASE_PTR)
#define USB_UOG2_USBINTR                         USB_USBINTR_REG(USB2_BASE_PTR)
#define USB_UOG2_FRINDEX                         USB_FRINDEX_REG(USB2_BASE_PTR)
#define USB_UOG2_DEVICEADDR                      USB_DEVICEADDR_REG(USB2_BASE_PTR)
#define USB_UOG2_PERIODICLISTBASE                USB_PERIODICLISTBASE_REG(USB2_BASE_PTR)
#define USB_UOG2_ASYNCLISTADDR                   USB_ASYNCLISTADDR_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTLISTADDR                   USB_ENDPTLISTADDR_REG(USB2_BASE_PTR)
#define USB_UOG2_BURSTSIZE                       USB_BURSTSIZE_REG(USB2_BASE_PTR)
#define USB_UOG2_TXFILLTUNING                    USB_TXFILLTUNING_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTNAK                        USB_ENDPTNAK_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTNAKEN                      USB_ENDPTNAKEN_REG(USB2_BASE_PTR)
#define USB_UOG2_CONFIGFLAG                      USB_CONFIGFLAG_REG(USB2_BASE_PTR)
#define USB_UOG2_PORTSC1                         USB_PORTSC1_REG(USB2_BASE_PTR)
#define USB_UOG2_OTGSC                           USB_OTGSC_REG(USB2_BASE_PTR)
#define USB_UOG2_USBMODE                         USB_USBMODE_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTSETUPSTAT                  USB_ENDPTSETUPSTAT_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTPRIME                      USB_ENDPTPRIME_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTFLUSH                      USB_ENDPTFLUSH_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTSTAT                       USB_ENDPTSTAT_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTCOMPLETE                   USB_ENDPTCOMPLETE_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTCTRL0                      USB_ENDPTCTRL0_REG(USB2_BASE_PTR)
#define USB_UOG2_ENDPTCTRL1                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,0)
#define USB_UOG2_ENDPTCTRL2                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,1)
#define USB_UOG2_ENDPTCTRL3                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,2)
#define USB_UOG2_ENDPTCTRL4                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,3)
#define USB_UOG2_ENDPTCTRL5                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,4)
#define USB_UOG2_ENDPTCTRL6                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,5)
#define USB_UOG2_ENDPTCTRL7                      USB_ENDPTCTRL_REG(USB2_BASE_PTR,6)

