AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* USB - Register array accessors */
#define USB1_ENDPTCTRL(index)                    USB_ENDPTCTRL_REG(USB1_BASE_PTR,index)
#define USB2_ENDPTCTRL(index)                    USB_ENDPTCTRL_REG(USB2_BASE_PTR,index)

/*!
 * @}
 */ /* end of group USB_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USB_Peripheral */


/* ----------------------------------------------------------------------------
   -- USBNC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBNC_Peripheral USBNC
 * @{
 */

/** USBNC - Peripheral register structure */
typedef struct USBNC_MemMap {
  uint8_t RESERVED_0[2048];
  uint32_t USB_OTGn_CTRL;                          /**< USB OTG1 Control Register..USB OTG2 Control Register, offset: 0x800 */
  uint8_t RESERVED_1[20];
  uint32_t USB_OTGn_PHY_CTRL_0;                    /**< OTG1 UTMI PHY Control 0 Register..OTG2 UTMI PHY Control 0 Register, offset: 0x818 */
} volatile *USBNC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBNC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBNC_Register_Accessor_Macros USBNC - Register accessor macros
 * @{
 */


/* USBNC - Register accessors */
#define USBNC_USB_OTGn_CTRL_REG(base)            ((base)->USB_OTGn_CTRL)
#define USBNC_USB_OTGn_PHY_CTRL_0_REG(base)      ((base)->USB_OTGn_PHY_CTRL_0)

/*!
 * @}
 */ /* end of group USBNC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- USBNC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBNC_Register_Masks USBNC Register Masks
 * @{
 */

/*! @name USB_OTGn_CTRL - USB OTG1 Control Register..USB OTG2 Control Register */
#define USBNC_USB_OTGn_CTRL_OVER_CUR_DIS_MASK    (0x80U)
#define USBNC_USB_OTGn_CTRL_OVER_CUR_DIS_SHIFT   (7U)
#define USBNC_USB_OTGn_CTRL_OVER_CUR_POL_MASK    (0x100U)
#define USBNC_USB_OTGn_CTRL_OVER_CUR_POL_SHIFT   (8U)
#define USBNC_USB_OTGn_CTRL_PWR_POL_MASK         (0x200U)
#define USBNC_USB_OTGn_CTRL_PWR_POL_SHIFT        (9U)
#define USBNC_USB_OTGn_CTRL_WIE_MASK             (0x400U)
#define USBNC_USB_OTGn_CTRL_WIE_SHIFT            (10U)
#define USBNC_USB_OTGn_CTRL_WKUP_SW_EN_MASK      (0x4000U)
#define USBNC_USB_OTGn_CTRL_WKUP_SW_EN_SHIFT     (14U)
#define USBNC_USB_OTGn_CTRL_WKUP_SW_MASK         (0x8000U)
#define USBNC_USB_OTGn_CTRL_WKUP_SW_SHIFT        (15U)
#define USBNC_USB_OTGn_CTRL_WKUP_ID_EN_MASK      (0x10000U)
#define USBNC_USB_OTGn_CTRL_WKUP_ID_EN_SHIFT     (16U)
#define USBNC_USB_OTGn_CTRL_WKUP_VBUS_EN_MASK    (0x20000U)
#define USBNC_USB_OTGn_CTRL_WKUP_VBUS_EN_SHIFT   (17U)
#define USBNC_USB_OTGn_CTRL_WKUP_DPDM_EN_MASK    (0x20000000U)
#define USBNC_USB_OTGn_CTRL_WKUP_DPDM_EN_SHIFT   (29U)
#define USBNC_USB_OTGn_CTRL_WIR_MASK             (0x80000000U)
#define USBNC_USB_OTGn_CTRL_WIR_SHIFT            (31U)

/*! @name USB_OTGn_PHY_CTRL_0 - OTG1 UTMI PHY Control 0 Register..OTG2 UTMI PHY Control 0 Register */
#define USBNC_USB_OTGn_PHY_CTRL_0_UTMI_CLK_VLD_MASK (0x80000000U)
#define USBNC_USB_OTGn_PHY_CTRL_0_UTMI_CLK_VLD_SHIFT (31U)


/*!
 * @}
 */ /* end of group USBNC_Register_Masks */


/* USBNC - Peripheral instance base addresses */
/** Peripheral USBNC1 base pointer */
#define USBNC1_BASE_PTR                          ((USBNC_MemMapPtr)0x402E0000u)
/** Peripheral USBNC2 base pointer */
#define USBNC2_BASE_PTR                          ((USBNC_MemMapPtr)0x402E0004u)
/** Array initializer of USBNC peripheral base pointers */
#define USBNC_BASE_PTRS                          { USBNC1_BASE_PTR, USBNC2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USBNC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBNC_Register_Accessor_Macros USBNC - Register accessor macros
 * @{
 */


/* USBNC - Register instance definitions */
/* USBNC1 */
#define USBNC_USB_OTG1_CTRL                      USBNC_USB_OTGn_CTRL_REG(USBNC1_BASE_PTR)
#define USBNC_USB_OTG1_PHY_CTRL_0                USBNC_USB_OTGn_PHY_CTRL_0_REG(USBNC1_BASE_PTR)
/* USBNC2 */
#define USBNC_USB_OTG2_CTRL                      USBNC_USB_OTGn_CTRL_REG(USBNC2_BASE_PTR)
#define USBNC_USB_OTG2_PHY_CTRL_0                USBNC_USB_OTGn_PHY_CTRL_0_REG(USBNC2_BASE_PTR)

/*!
 * @}
 */ /* end of group USBNC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBNC_Peripheral */


/* ----------------------------------------------------------------------------
   -- USBPHY
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Peripheral USBPHY
 * @{
 */

/** USBPHY - Peripheral register structure */
typedef struct USBPHY_MemMap {
  uint32_t PWD;                                    /**< USB PHY Power-Down Register, offset: 0x0 */
  uint32_t PWD_SET;                                /**< USB PHY Power-Down Register, offset: 0x4 */
  uint32_t PWD_CLR;                                /**< USB PHY Power-Down Register, offset: 0x8 */
  uint32_t PWD_TOG;                                /**< USB PHY Power-Down Register, offset: 0xC */
  uint32_t TX;                                     /**< USB PHY Transmitter Control Register, offset: 0x10 */
  uint32_t TX_SET;                                 /**< USB PHY Transmitter Control Register, offset: 0x14 */
  uint32_t TX_CLR;                                 /**< USB PHY Transmitter Control Register, offset: 0x18 */
  uint32_t TX_TOG;                                 /**< USB PHY Transmitter Control Register, offset: 0x1C */
  uint32_t RX;                                     /**< USB PHY Receiver Control Register, offset: 0x20 */
  uint32_t RX_SET;                                 /**< USB PHY Receiver Control Register, offset: 0x24 */
  uint32_t RX_CLR;                                 /**< USB PHY Receiver Control Register, offset: 0x28 */
  uint32_t RX_TOG;                                 /**< USB PHY Receiver Control Register, offset: 0x2C */
  uint32_t CTRL;                                   /**< USB PHY General Control Register, offset: 0x30 */
  uint32_t CTRL_SET;                               /**< USB PHY General Control Register, offset: 0x34 */
  uint32_t CTRL_CLR;                               /**< USB PHY General Control Register, offset: 0x38 */
  uint32_t CTRL_TOG;                               /**< USB PHY General Control Register, offset: 0x3C */
  uint32_t STATUS;                                 /**< USB PHY Status Register, offset: 0x40 */
  uint8_t RESERVED_0[12];
  uint32_t DEBUG;                                  /**< USB PHY Debug Register, offset: 0x50 */
  uint32_t DEBUG_SET;                              /**< USB PHY Debug Register, offset: 0x54 */
  uint32_t DEBUG_CLR;                              /**< USB PHY Debug Register, offset: 0x58 */
  uint32_t DEBUG_TOG;                              /**< USB PHY Debug Register, offset: 0x5C */
  uint32_t DEBUG0_STATUS;                          /**< UTMI Debug Status Register 0, offset: 0x60 */
  uint8_t RESERVED_1[12];
  uint32_t DEBUG1;                                 /**< UTMI Debug Status Register 1, offset: 0x70 */
  uint32_t DEBUG1_SET;                             /**< UTMI Debug Status Register 1, offset: 0x74 */
  uint32_t DEBUG1_CLR;                             /**< UTMI Debug Status Register 1, offset: 0x78 */
  uint32_t DEBUG1_TOG;                             /**< UTMI Debug Status Register 1, offset: 0x7C */
  uint32_t VERSION;                                /**< UTMI RTL Version, offset: 0x80 */
} volatile *USBPHY_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBPHY - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Register_Accessor_Macros USBPHY - Register accessor macros
 * @{
 */


