AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name VERSION - UTMI RTL Version */
#define USBPHY_VERSION_STEP_MASK                 (0xFFFFU)
#define USBPHY_VERSION_STEP_SHIFT                (0U)
#define USBPHY_VERSION_STEP(x)                   (((uint32_t)(((uint32_t)(x)) << USBPHY_VERSION_STEP_SHIFT)) & USBPHY_VERSION_STEP_MASK)
#define USBPHY_VERSION_MINOR_MASK                (0xFF0000U)
#define USBPHY_VERSION_MINOR_SHIFT               (16U)
#define USBPHY_VERSION_MINOR(x)                  (((uint32_t)(((uint32_t)(x)) << USBPHY_VERSION_MINOR_SHIFT)) & USBPHY_VERSION_MINOR_MASK)
#define USBPHY_VERSION_MAJOR_MASK                (0xFF000000U)
#define USBPHY_VERSION_MAJOR_SHIFT               (24U)
#define USBPHY_VERSION_MAJOR(x)                  (((uint32_t)(((uint32_t)(x)) << USBPHY_VERSION_MAJOR_SHIFT)) & USBPHY_VERSION_MAJOR_MASK)


/*!
 * @}
 */ /* end of group USBPHY_Register_Masks */


/* USBPHY - Peripheral instance base addresses */
/** Peripheral USBPHY1 base pointer */
#define USBPHY1_BASE_PTR                         ((USBPHY_MemMapPtr)0x400D9000u)
/** Peripheral USBPHY2 base pointer */
#define USBPHY2_BASE_PTR                         ((USBPHY_MemMapPtr)0x400DA000u)
/** Array initializer of USBPHY peripheral base pointers */
#define USBPHY_BASE_PTRS                         { USBPHY1_BASE_PTR, USBPHY2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USBPHY - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Register_Accessor_Macros USBPHY - Register accessor macros
 * @{
 */


/* USBPHY - Register instance definitions */
/* USBPHY1 */
#define USBPHY1_PWD                              USBPHY_PWD_REG(USBPHY1_BASE_PTR)
#define USBPHY1_PWD_SET                          USBPHY_PWD_SET_REG(USBPHY1_BASE_PTR)
#define USBPHY1_PWD_CLR                          USBPHY_PWD_CLR_REG(USBPHY1_BASE_PTR)
#define USBPHY1_PWD_TOG                          USBPHY_PWD_TOG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_TX                               USBPHY_TX_REG(USBPHY1_BASE_PTR)
#define USBPHY1_TX_SET                           USBPHY_TX_SET_REG(USBPHY1_BASE_PTR)
#define USBPHY1_TX_CLR                           USBPHY_TX_CLR_REG(USBPHY1_BASE_PTR)
#define USBPHY1_TX_TOG                           USBPHY_TX_TOG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_RX                               USBPHY_RX_REG(USBPHY1_BASE_PTR)
#define USBPHY1_RX_SET                           USBPHY_RX_SET_REG(USBPHY1_BASE_PTR)
#define USBPHY1_RX_CLR                           USBPHY_RX_CLR_REG(USBPHY1_BASE_PTR)
#define USBPHY1_RX_TOG                           USBPHY_RX_TOG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_CTRL                             USBPHY_CTRL_REG(USBPHY1_BASE_PTR)
#define USBPHY1_CTRL_SET                         USBPHY_CTRL_SET_REG(USBPHY1_BASE_PTR)
#define USBPHY1_CTRL_CLR                         USBPHY_CTRL_CLR_REG(USBPHY1_BASE_PTR)
#define USBPHY1_CTRL_TOG                         USBPHY_CTRL_TOG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_STATUS                           USBPHY_STATUS_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG                            USBPHY_DEBUG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG_SET                        USBPHY_DEBUG_SET_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG_CLR                        USBPHY_DEBUG_CLR_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG_TOG                        USBPHY_DEBUG_TOG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG0_STATUS                    USBPHY_DEBUG0_STATUS_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG1                           USBPHY_DEBUG1_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG1_SET                       USBPHY_DEBUG1_SET_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG1_CLR                       USBPHY_DEBUG1_CLR_REG(USBPHY1_BASE_PTR)
#define USBPHY1_DEBUG1_TOG                       USBPHY_DEBUG1_TOG_REG(USBPHY1_BASE_PTR)
#define USBPHY1_VERSION                          USBPHY_VERSION_REG(USBPHY1_BASE_PTR)
/* USBPHY2 */
#define USBPHY2_PWD                              USBPHY_PWD_REG(USBPHY2_BASE_PTR)
#define USBPHY2_PWD_SET                          USBPHY_PWD_SET_REG(USBPHY2_BASE_PTR)
#define USBPHY2_PWD_CLR                          USBPHY_PWD_CLR_REG(USBPHY2_BASE_PTR)
#define USBPHY2_PWD_TOG                          USBPHY_PWD_TOG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_TX                               USBPHY_TX_REG(USBPHY2_BASE_PTR)
#define USBPHY2_TX_SET                           USBPHY_TX_SET_REG(USBPHY2_BASE_PTR)
#define USBPHY2_TX_CLR                           USBPHY_TX_CLR_REG(USBPHY2_BASE_PTR)
#define USBPHY2_TX_TOG                           USBPHY_TX_TOG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_RX                               USBPHY_RX_REG(USBPHY2_BASE_PTR)
#define USBPHY2_RX_SET                           USBPHY_RX_SET_REG(USBPHY2_BASE_PTR)
#define USBPHY2_RX_CLR                           USBPHY_RX_CLR_REG(USBPHY2_BASE_PTR)
#define USBPHY2_RX_TOG                           USBPHY_RX_TOG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_CTRL                             USBPHY_CTRL_REG(USBPHY2_BASE_PTR)
#define USBPHY2_CTRL_SET                         USBPHY_CTRL_SET_REG(USBPHY2_BASE_PTR)
#define USBPHY2_CTRL_CLR                         USBPHY_CTRL_CLR_REG(USBPHY2_BASE_PTR)
#define USBPHY2_CTRL_TOG                         USBPHY_CTRL_TOG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_STATUS                           USBPHY_STATUS_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG                            USBPHY_DEBUG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG_SET                        USBPHY_DEBUG_SET_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG_CLR                        USBPHY_DEBUG_CLR_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG_TOG                        USBPHY_DEBUG_TOG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG0_STATUS                    USBPHY_DEBUG0_STATUS_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG1                           USBPHY_DEBUG1_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG1_SET                       USBPHY_DEBUG1_SET_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG1_CLR                       USBPHY_DEBUG1_CLR_REG(USBPHY2_BASE_PTR)
#define USBPHY2_DEBUG1_TOG                       USBPHY_DEBUG1_TOG_REG(USBPHY2_BASE_PTR)
#define USBPHY2_VERSION                          USBPHY_VERSION_REG(USBPHY2_BASE_PTR)

/*!
 * @}
 */ /* end of group USBPHY_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBPHY_Peripheral */


/* ----------------------------------------------------------------------------
   -- USB_ANALOG
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USB_ANALOG_Peripheral USB_ANALOG
 * @{
 */

/** USB_ANALOG - Peripheral register structure */
typedef struct USB_ANALOG_MemMap {
  uint8_t RESERVED_0[416];
  struct {                                         /* offset: 0x1A0, array step: 0x60 */
    uint32_t VBUS_DETECT;                            /**< USB VBUS Detect Register, array offset: 0x1A0, array step: 0x60 */
    uint32_t VBUS_DETECT_SET;                        /**< USB VBUS Detect Register, array offset: 0x1A4, array step: 0x60 */
    uint32_t VBUS_DETECT_CLR;                        /**< USB VBUS Detect Register, array offset: 0x1A8, array step: 0x60 */
    uint32_t VBUS_DETECT_TOG;                        /**< USB VBUS Detect Register, array offset: 0x1AC, array step: 0x60 */
    uint32_t CHRG_DETECT;                            /**< USB Charger Detect Register, array offset: 0x1B0, array step: 0x60 */
    uint32_t CHRG_DETECT_SET;                        /**< USB Charger Detect Register, array offset: 0x1B4, array step: 0x60 */
    uint32_t CHRG_DETECT_CLR;                        /**< USB Charger Detect Register, array offset: 0x1B8, array step: 0x60 */
    uint32_t CHRG_DETECT_TOG;                        /**< USB Charger Detect Register, array offset: 0x1BC, array step: 0x60 */
    uint32_t VBUS_DETECT_STAT;                       /**< USB VBUS Detect Status Register, array offset: 0x1C0, array step: 0x60 */
    uint8_t RESERVED_0[12];
    uint32_t CHRG_DETECT_STAT;                       /**< USB Charger Detect Status Register, array offset: 0x1D0, array step: 0x60 */
    uint8_t RESERVED_1[28];
    uint32_t MISC;                                   /**< USB Misc Register, array offset: 0x1F0, array step: 0x60 */
    uint32_t MISC_SET;                               /**< USB Misc Register, array offset: 0x1F4, array step: 0x60 */
    uint32_t MISC_CLR;                               /**< USB Misc Register, array offset: 0x1F8, array step: 0x60 */
    uint32_t MISC_TOG;                               /**< USB Misc Register, array offset: 0x1FC, array step: 0x60 */
  } INSTANCE[2];
  uint32_t DIGPROG;                                /**< Chip Silicon Version, offset: 0x260 */
} volatile *USB_ANALOG_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USB_ANALOG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USB_ANALOG_Register_Accessor_Macros USB_ANALOG - Register accessor macros
 * @{
 */


/* USB_ANALOG - Register accessors */
#define USB_ANALOG_VBUS_DETECT_REG(base,index)   ((base)->INSTANCE[index].VBUS_DETECT)
#define USB_ANALOG_VBUS_DETECT_SET_REG(base,index) ((base)->INSTANCE[index].VBUS_DETECT_SET)
#define USB_ANALOG_VBUS_DETECT_CLR_REG(base,index) ((base)->INSTANCE[index].VBUS_DETECT_CLR)
#define USB_ANALOG_VBUS_DETECT_TOG_REG(base,index) ((base)->INSTANCE[index].VBUS_DETECT_TOG)
#define USB_ANALOG_CHRG_DETECT_REG(base,index)   ((base)->INSTANCE[index].CHRG_DETECT)
#define USB_ANALOG_CHRG_DETECT_SET_REG(base,index) ((base)->INSTANCE[index].CHRG_DETECT_SET)
#define USB_ANALOG_CHRG_DETECT_CLR_REG(base,index) ((base)->INSTANCE[index].CHRG_DETECT_CLR)
#define USB_ANALOG_CHRG_DETECT_TOG_REG(base,index) ((base)->INSTANCE[index].CHRG_DETECT_TOG)
#define USB_ANALOG_VBUS_DETECT_STAT_REG(base,index) ((base)->INSTANCE[index].VBUS_DETECT_STAT)
#define USB_ANALOG_CHRG_DETECT_STAT_REG(base,index) ((base)->INSTANCE[index].CHRG_DETECT_STAT)
#define USB_ANALOG_MISC_REG(base,index)          ((base)->INSTANCE[index].MISC)
#define USB_ANALOG_MISC_SET_REG(base,index)      ((base)->INSTANCE[index].MISC_SET)
#define USB_ANALOG_MISC_CLR_REG(base,index)      ((base)->INSTANCE[index].MISC_CLR)
#define USB_ANALOG_MISC_TOG_REG(base,index)      ((base)->INSTANCE[index].MISC_TOG)
#define USB_ANALOG_DIGPROG_REG(base)             ((base)->DIGPROG)

/*!
 * @}
 */ /* end of group USB_ANALOG_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- USB_ANALOG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USB_ANALOG_Register_Masks USB_ANALOG Register Masks
 * @{
 */

/*! @name VBUS_DETECT - USB VBUS Detect Register */
#define USB_ANALOG_VBUS_DETECT_VBUSVALID_THRESH_MASK (0x7U)
#define USB_ANALOG_VBUS_DETECT_VBUSVALID_THRESH_SHIFT (0U)
#define USB_ANALOG_VBUS_DETECT_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x)) << USB_ANALOG_VBUS_DETECT_VBUSVALID_THRESH_SHIFT)) & USB_ANALOG_VBUS_DETECT_VBUSVALID_THRESH_MASK)
#define USB_ANALOG_VBUS_DETECT_VBUSVALID_PWRUP_CMPS_MASK (0x100000U)
#define USB_ANALOG_VBUS_DETECT_VBUSVALID_PWRUP_CMPS_SHIFT (20U)
#define USB_ANALOG_VBUS_DETECT_DISCHARGE_VBUS_MASK (0x4000000U)
#define USB_ANALOG_VBUS_DETECT_DISCHARGE_VBUS_SHIFT (26U)
#define USB_ANALOG_VBUS_DETECT_CHARGE_VBUS_MASK  (0x8000000U)
#define USB_ANALOG_VBUS_DETECT_CHARGE_VBUS_SHIFT (27U)

