AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name MISC_CLR - USB Misc Register */
#define USB_ANALOG_MISC_CLR_HS_USE_EXTERNAL_R_MASK (0x1U)
#define USB_ANALOG_MISC_CLR_HS_USE_EXTERNAL_R_SHIFT (0U)
#define USB_ANALOG_MISC_CLR_EN_DEGLITCH_MASK     (0x2U)
#define USB_ANALOG_MISC_CLR_EN_DEGLITCH_SHIFT    (1U)
#define USB_ANALOG_MISC_CLR_EN_CLK_UTMI_MASK     (0x40000000U)
#define USB_ANALOG_MISC_CLR_EN_CLK_UTMI_SHIFT    (30U)

/* The count of USB_ANALOG_MISC_CLR */
#define USB_ANALOG_MISC_CLR_COUNT                (2U)

/*! @name MISC_TOG - USB Misc Register */
#define USB_ANALOG_MISC_TOG_HS_USE_EXTERNAL_R_MASK (0x1U)
#define USB_ANALOG_MISC_TOG_HS_USE_EXTERNAL_R_SHIFT (0U)
#define USB_ANALOG_MISC_TOG_EN_DEGLITCH_MASK     (0x2U)
#define USB_ANALOG_MISC_TOG_EN_DEGLITCH_SHIFT    (1U)
#define USB_ANALOG_MISC_TOG_EN_CLK_UTMI_MASK     (0x40000000U)
#define USB_ANALOG_MISC_TOG_EN_CLK_UTMI_SHIFT    (30U)

/* The count of USB_ANALOG_MISC_TOG */
#define USB_ANALOG_MISC_TOG_COUNT                (2U)

/*! @name DIGPROG - Chip Silicon Version */
#define USB_ANALOG_DIGPROG_MINOR_MASK            (0xFFU)
#define USB_ANALOG_DIGPROG_MINOR_SHIFT           (0U)
#define USB_ANALOG_DIGPROG_MINOR(x)              (((uint32_t)(((uint32_t)(x)) << USB_ANALOG_DIGPROG_MINOR_SHIFT)) & USB_ANALOG_DIGPROG_MINOR_MASK)
#define USB_ANALOG_DIGPROG_MAJOR_LOWER_MASK      (0xFF00U)
#define USB_ANALOG_DIGPROG_MAJOR_LOWER_SHIFT     (8U)
#define USB_ANALOG_DIGPROG_MAJOR_LOWER(x)        (((uint32_t)(((uint32_t)(x)) << USB_ANALOG_DIGPROG_MAJOR_LOWER_SHIFT)) & USB_ANALOG_DIGPROG_MAJOR_LOWER_MASK)
#define USB_ANALOG_DIGPROG_MAJOR_UPPER_MASK      (0xFF0000U)
#define USB_ANALOG_DIGPROG_MAJOR_UPPER_SHIFT     (16U)
#define USB_ANALOG_DIGPROG_MAJOR_UPPER(x)        (((uint32_t)(((uint32_t)(x)) << USB_ANALOG_DIGPROG_MAJOR_UPPER_SHIFT)) & USB_ANALOG_DIGPROG_MAJOR_UPPER_MASK)


/*!
 * @}
 */ /* end of group USB_ANALOG_Register_Masks */


/* USB_ANALOG - Peripheral instance base addresses */
/** Peripheral USB_ANALOG base pointer */
#define USB_ANALOG_BASE_PTR                      ((USB_ANALOG_MemMapPtr)0x400D8000u)
/** Array initializer of USB_ANALOG peripheral base pointers */
#define USB_ANALOG_BASE_PTRS                     { USB_ANALOG_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USB_ANALOG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USB_ANALOG_Register_Accessor_Macros USB_ANALOG - Register accessor macros
 * @{
 */


/* USB_ANALOG - Register instance definitions */
/* USB_ANALOG */
#define USB_ANALOG_USB1_VBUS_DETECT              USB_ANALOG_VBUS_DETECT_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_VBUS_DETECT_SET          USB_ANALOG_VBUS_DETECT_SET_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_VBUS_DETECT_CLR          USB_ANALOG_VBUS_DETECT_CLR_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_VBUS_DETECT_TOG          USB_ANALOG_VBUS_DETECT_TOG_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_CHRG_DETECT              USB_ANALOG_CHRG_DETECT_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_CHRG_DETECT_SET          USB_ANALOG_CHRG_DETECT_SET_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_CHRG_DETECT_CLR          USB_ANALOG_CHRG_DETECT_CLR_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_CHRG_DETECT_TOG          USB_ANALOG_CHRG_DETECT_TOG_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_VBUS_DETECT_STAT         USB_ANALOG_VBUS_DETECT_STAT_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_CHRG_DETECT_STAT         USB_ANALOG_CHRG_DETECT_STAT_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_MISC                     USB_ANALOG_MISC_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_MISC_SET                 USB_ANALOG_MISC_SET_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_MISC_CLR                 USB_ANALOG_MISC_CLR_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB1_MISC_TOG                 USB_ANALOG_MISC_TOG_REG(USB_ANALOG_BASE_PTR,0)
#define USB_ANALOG_USB2_VBUS_DETECT              USB_ANALOG_VBUS_DETECT_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_VBUS_DETECT_SET          USB_ANALOG_VBUS_DETECT_SET_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_VBUS_DETECT_CLR          USB_ANALOG_VBUS_DETECT_CLR_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_VBUS_DETECT_TOG          USB_ANALOG_VBUS_DETECT_TOG_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_CHRG_DETECT              USB_ANALOG_CHRG_DETECT_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_CHRG_DETECT_SET          USB_ANALOG_CHRG_DETECT_SET_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_CHRG_DETECT_CLR          USB_ANALOG_CHRG_DETECT_CLR_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_CHRG_DETECT_TOG          USB_ANALOG_CHRG_DETECT_TOG_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_VBUS_DETECT_STAT         USB_ANALOG_VBUS_DETECT_STAT_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_CHRG_DETECT_STAT         USB_ANALOG_CHRG_DETECT_STAT_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_MISC                     USB_ANALOG_MISC_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_MISC_SET                 USB_ANALOG_MISC_SET_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_MISC_CLR                 USB_ANALOG_MISC_CLR_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_USB2_MISC_TOG                 USB_ANALOG_MISC_TOG_REG(USB_ANALOG_BASE_PTR,1)
#define USB_ANALOG_DIGPROG                       USB_ANALOG_DIGPROG_REG(USB_ANALOG_BASE_PTR)

/* USB_ANALOG - Register array accessors */
#define USB_ANALOG_VBUS_DETECT(index)            USB_ANALOG_VBUS_DETECT_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_VBUS_DETECT_SET(index)        USB_ANALOG_VBUS_DETECT_SET_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_VBUS_DETECT_CLR(index)        USB_ANALOG_VBUS_DETECT_CLR_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_VBUS_DETECT_TOG(index)        USB_ANALOG_VBUS_DETECT_TOG_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_CHRG_DETECT(index)            USB_ANALOG_CHRG_DETECT_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_CHRG_DETECT_SET(index)        USB_ANALOG_CHRG_DETECT_SET_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_CHRG_DETECT_CLR(index)        USB_ANALOG_CHRG_DETECT_CLR_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_CHRG_DETECT_TOG(index)        USB_ANALOG_CHRG_DETECT_TOG_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_VBUS_DETECT_STAT(index)       USB_ANALOG_VBUS_DETECT_STAT_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_CHRG_DETECT_STAT(index)       USB_ANALOG_CHRG_DETECT_STAT_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_MISC(index)                   USB_ANALOG_MISC_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_MISC_SET(index)               USB_ANALOG_MISC_SET_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_MISC_CLR(index)               USB_ANALOG_MISC_CLR_REG(USB_ANALOG_BASE_PTR,index)
#define USB_ANALOG_MISC_TOG(index)               USB_ANALOG_MISC_TOG_REG(USB_ANALOG_BASE_PTR,index)

/*!
 * @}
 */ /* end of group USB_ANALOG_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USB_ANALOG_Peripheral */


/* ----------------------------------------------------------------------------
   -- USDHC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USDHC_Peripheral USDHC
 * @{
 */

/** USDHC - Peripheral register structure */
typedef struct USDHC_MemMap {
  uint32_t DS_ADDR;                                /**< DMA System Address, offset: 0x0 */
  uint32_t BLK_ATT;                                /**< Block Attributes, offset: 0x4 */
  uint32_t CMD_ARG;                                /**< Command Argument, offset: 0x8 */
  uint32_t CMD_XFR_TYP;                            /**< Command Transfer Type, offset: 0xC */
  uint32_t CMD_RSP0;                               /**< Command Response0, offset: 0x10 */
  uint32_t CMD_RSP1;                               /**< Command Response1, offset: 0x14 */
  uint32_t CMD_RSP2;                               /**< Command Response2, offset: 0x18 */
  uint32_t CMD_RSP3;                               /**< Command Response3, offset: 0x1C */
  uint32_t DATA_BUFF_ACC_PORT;                     /**< Data Buffer Access Port, offset: 0x20 */
  uint32_t PRES_STATE;                             /**< Present State, offset: 0x24 */
  uint32_t PROT_CTRL;                              /**< Protocol Control, offset: 0x28 */
  uint32_t SYS_CTRL;                               /**< System Control, offset: 0x2C */
  uint32_t INT_STATUS;                             /**< Interrupt Status, offset: 0x30 */
  uint32_t INT_STATUS_EN;                          /**< Interrupt Status Enable, offset: 0x34 */
  uint32_t INT_SIGNAL_EN;                          /**< Interrupt Signal Enable, offset: 0x38 */
  uint32_t AUTOCMD12_ERR_STATUS;                   /**< Auto CMD12 Error Status, offset: 0x3C */
  uint32_t HOST_CTRL_CAP;                          /**< Host Controller Capabilities, offset: 0x40 */
  uint32_t WTMK_LVL;                               /**< Watermark Level, offset: 0x44 */
  uint32_t MIX_CTRL;                               /**< Mixer Control, offset: 0x48 */
  uint8_t RESERVED_0[4];
  uint32_t FORCE_EVENT;                            /**< Force Event, offset: 0x50 */
  uint32_t ADMA_ERR_STATUS;                        /**< ADMA Error Status Register, offset: 0x54 */
  uint32_t ADMA_SYS_ADDR;                          /**< ADMA System Address, offset: 0x58 */
  uint8_t RESERVED_1[4];
  uint32_t DLL_CTRL;                               /**< DLL (Delay Line) Control, offset: 0x60 */
  uint32_t DLL_STATUS;                             /**< DLL Status, offset: 0x64 */
  uint32_t CLK_TUNE_CTRL_STATUS;                   /**< CLK Tuning Control and Status, offset: 0x68 */
  uint8_t RESERVED_2[84];
  uint32_t VEND_SPEC;                              /**< Vendor Specific Register, offset: 0xC0 */
  uint32_t MMC_BOOT;                               /**< MMC Boot Register, offset: 0xC4 */
  uint32_t VEND_SPEC2;                             /**< Vendor Specific 2 Register, offset: 0xC8 */
  uint32_t TUNING_CTRL;                            /**< Tuning Control Register, offset: 0xCC */
} volatile *USDHC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USDHC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USDHC_Register_Accessor_Macros USDHC - Register accessor macros
 * @{
 */


