AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name VEND_SPEC2 - Vendor Specific 2 Register */
#define USDHC_VEND_SPEC2_CARD_INT_D3_TEST_MASK   (0x8U)
#define USDHC_VEND_SPEC2_CARD_INT_D3_TEST_SHIFT  (3U)
#define USDHC_VEND_SPEC2_TUNING_8bit_EN_MASK     (0x10U)
#define USDHC_VEND_SPEC2_TUNING_8bit_EN_SHIFT    (4U)
#define USDHC_VEND_SPEC2_TUNING_1bit_EN_MASK     (0x20U)
#define USDHC_VEND_SPEC2_TUNING_1bit_EN_SHIFT    (5U)
#define USDHC_VEND_SPEC2_TUNING_CMD_EN_MASK      (0x40U)
#define USDHC_VEND_SPEC2_TUNING_CMD_EN_SHIFT     (6U)
#define USDHC_VEND_SPEC2_ACMD23_ARGU2_EN_MASK    (0x1000U)
#define USDHC_VEND_SPEC2_ACMD23_ARGU2_EN_SHIFT   (12U)
#define USDHC_VEND_SPEC2_PART_DLL_DEBUG_MASK     (0x2000U)
#define USDHC_VEND_SPEC2_PART_DLL_DEBUG_SHIFT    (13U)
#define USDHC_VEND_SPEC2_BUS_RST_MASK            (0x4000U)
#define USDHC_VEND_SPEC2_BUS_RST_SHIFT           (14U)

/*! @name TUNING_CTRL - Tuning Control Register */
#define USDHC_TUNING_CTRL_TUNING_START_TAP_MASK  (0xFFU)
#define USDHC_TUNING_CTRL_TUNING_START_TAP_SHIFT (0U)
#define USDHC_TUNING_CTRL_TUNING_START_TAP(x)    (((uint32_t)(((uint32_t)(x)) << USDHC_TUNING_CTRL_TUNING_START_TAP_SHIFT)) & USDHC_TUNING_CTRL_TUNING_START_TAP_MASK)
#define USDHC_TUNING_CTRL_TUNING_COUNTER_MASK    (0xFF00U)
#define USDHC_TUNING_CTRL_TUNING_COUNTER_SHIFT   (8U)
#define USDHC_TUNING_CTRL_TUNING_COUNTER(x)      (((uint32_t)(((uint32_t)(x)) << USDHC_TUNING_CTRL_TUNING_COUNTER_SHIFT)) & USDHC_TUNING_CTRL_TUNING_COUNTER_MASK)
#define USDHC_TUNING_CTRL_TUNING_STEP_MASK       (0x70000U)
#define USDHC_TUNING_CTRL_TUNING_STEP_SHIFT      (16U)
#define USDHC_TUNING_CTRL_TUNING_STEP(x)         (((uint32_t)(((uint32_t)(x)) << USDHC_TUNING_CTRL_TUNING_STEP_SHIFT)) & USDHC_TUNING_CTRL_TUNING_STEP_MASK)
#define USDHC_TUNING_CTRL_TUNING_WINDOW_MASK     (0x700000U)
#define USDHC_TUNING_CTRL_TUNING_WINDOW_SHIFT    (20U)
#define USDHC_TUNING_CTRL_TUNING_WINDOW(x)       (((uint32_t)(((uint32_t)(x)) << USDHC_TUNING_CTRL_TUNING_WINDOW_SHIFT)) & USDHC_TUNING_CTRL_TUNING_WINDOW_MASK)
#define USDHC_TUNING_CTRL_STD_TUNING_EN_MASK     (0x1000000U)
#define USDHC_TUNING_CTRL_STD_TUNING_EN_SHIFT    (24U)


/*!
 * @}
 */ /* end of group USDHC_Register_Masks */


/* USDHC - Peripheral instance base addresses */
/** Peripheral USDHC1 base pointer */
#define USDHC1_BASE_PTR                          ((USDHC_MemMapPtr)0x402C0000u)
/** Peripheral USDHC2 base pointer */
#define USDHC2_BASE_PTR                          ((USDHC_MemMapPtr)0x402C4000u)
/** Array initializer of USDHC peripheral base pointers */
#define USDHC_BASE_PTRS                          { USDHC1_BASE_PTR, USDHC2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USDHC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USDHC_Register_Accessor_Macros USDHC - Register accessor macros
 * @{
 */


/* USDHC - Register instance definitions */
/* USDHC1 */
#define USDHC1_DS_ADDR                           USDHC_DS_ADDR_REG(USDHC1_BASE_PTR)
#define USDHC1_BLK_ATT                           USDHC_BLK_ATT_REG(USDHC1_BASE_PTR)
#define USDHC1_CMD_ARG                           USDHC_CMD_ARG_REG(USDHC1_BASE_PTR)
#define USDHC1_CMD_XFR_TYP                       USDHC_CMD_XFR_TYP_REG(USDHC1_BASE_PTR)
#define USDHC1_CMD_RSP0                          USDHC_CMD_RSP0_REG(USDHC1_BASE_PTR)
#define USDHC1_CMD_RSP1                          USDHC_CMD_RSP1_REG(USDHC1_BASE_PTR)
#define USDHC1_CMD_RSP2                          USDHC_CMD_RSP2_REG(USDHC1_BASE_PTR)
#define USDHC1_CMD_RSP3                          USDHC_CMD_RSP3_REG(USDHC1_BASE_PTR)
#define USDHC1_DATA_BUFF_ACC_PORT                USDHC_DATA_BUFF_ACC_PORT_REG(USDHC1_BASE_PTR)
#define USDHC1_PRES_STATE                        USDHC_PRES_STATE_REG(USDHC1_BASE_PTR)
#define USDHC1_PROT_CTRL                         USDHC_PROT_CTRL_REG(USDHC1_BASE_PTR)
#define USDHC1_SYS_CTRL                          USDHC_SYS_CTRL_REG(USDHC1_BASE_PTR)
#define USDHC1_INT_STATUS                        USDHC_INT_STATUS_REG(USDHC1_BASE_PTR)
#define USDHC1_INT_STATUS_EN                     USDHC_INT_STATUS_EN_REG(USDHC1_BASE_PTR)
#define USDHC1_INT_SIGNAL_EN                     USDHC_INT_SIGNAL_EN_REG(USDHC1_BASE_PTR)
#define USDHC1_AUTOCMD12_ERR_STATUS              USDHC_AUTOCMD12_ERR_STATUS_REG(USDHC1_BASE_PTR)
#define USDHC1_HOST_CTRL_CAP                     USDHC_HOST_CTRL_CAP_REG(USDHC1_BASE_PTR)
#define USDHC1_WTMK_LVL                          USDHC_WTMK_LVL_REG(USDHC1_BASE_PTR)
#define USDHC1_MIX_CTRL                          USDHC_MIX_CTRL_REG(USDHC1_BASE_PTR)
#define USDHC1_FORCE_EVENT                       USDHC_FORCE_EVENT_REG(USDHC1_BASE_PTR)
#define USDHC1_ADMA_ERR_STATUS                   USDHC_ADMA_ERR_STATUS_REG(USDHC1_BASE_PTR)
#define USDHC1_ADMA_SYS_ADDR                     USDHC_ADMA_SYS_ADDR_REG(USDHC1_BASE_PTR)
#define USDHC1_DLL_CTRL                          USDHC_DLL_CTRL_REG(USDHC1_BASE_PTR)
#define USDHC1_DLL_STATUS                        USDHC_DLL_STATUS_REG(USDHC1_BASE_PTR)
#define USDHC1_CLK_TUNE_CTRL_STATUS              USDHC_CLK_TUNE_CTRL_STATUS_REG(USDHC1_BASE_PTR)
#define USDHC1_VEND_SPEC                         USDHC_VEND_SPEC_REG(USDHC1_BASE_PTR)
#define USDHC1_MMC_BOOT                          USDHC_MMC_BOOT_REG(USDHC1_BASE_PTR)
#define USDHC1_VEND_SPEC2                        USDHC_VEND_SPEC2_REG(USDHC1_BASE_PTR)
#define USDHC1_TUNING_CTRL                       USDHC_TUNING_CTRL_REG(USDHC1_BASE_PTR)
/* USDHC2 */
#define USDHC2_DS_ADDR                           USDHC_DS_ADDR_REG(USDHC2_BASE_PTR)
#define USDHC2_BLK_ATT                           USDHC_BLK_ATT_REG(USDHC2_BASE_PTR)
#define USDHC2_CMD_ARG                           USDHC_CMD_ARG_REG(USDHC2_BASE_PTR)
#define USDHC2_CMD_XFR_TYP                       USDHC_CMD_XFR_TYP_REG(USDHC2_BASE_PTR)
#define USDHC2_CMD_RSP0                          USDHC_CMD_RSP0_REG(USDHC2_BASE_PTR)
#define USDHC2_CMD_RSP1                          USDHC_CMD_RSP1_REG(USDHC2_BASE_PTR)
#define USDHC2_CMD_RSP2                          USDHC_CMD_RSP2_REG(USDHC2_BASE_PTR)
#define USDHC2_CMD_RSP3                          USDHC_CMD_RSP3_REG(USDHC2_BASE_PTR)
#define USDHC2_DATA_BUFF_ACC_PORT                USDHC_DATA_BUFF_ACC_PORT_REG(USDHC2_BASE_PTR)
#define USDHC2_PRES_STATE                        USDHC_PRES_STATE_REG(USDHC2_BASE_PTR)
#define USDHC2_PROT_CTRL                         USDHC_PROT_CTRL_REG(USDHC2_BASE_PTR)
#define USDHC2_SYS_CTRL                          USDHC_SYS_CTRL_REG(USDHC2_BASE_PTR)
#define USDHC2_INT_STATUS                        USDHC_INT_STATUS_REG(USDHC2_BASE_PTR)
#define USDHC2_INT_STATUS_EN                     USDHC_INT_STATUS_EN_REG(USDHC2_BASE_PTR)
#define USDHC2_INT_SIGNAL_EN                     USDHC_INT_SIGNAL_EN_REG(USDHC2_BASE_PTR)
#define USDHC2_AUTOCMD12_ERR_STATUS              USDHC_AUTOCMD12_ERR_STATUS_REG(USDHC2_BASE_PTR)
#define USDHC2_HOST_CTRL_CAP                     USDHC_HOST_CTRL_CAP_REG(USDHC2_BASE_PTR)
#define USDHC2_WTMK_LVL                          USDHC_WTMK_LVL_REG(USDHC2_BASE_PTR)
#define USDHC2_MIX_CTRL                          USDHC_MIX_CTRL_REG(USDHC2_BASE_PTR)
#define USDHC2_FORCE_EVENT                       USDHC_FORCE_EVENT_REG(USDHC2_BASE_PTR)
#define USDHC2_ADMA_ERR_STATUS                   USDHC_ADMA_ERR_STATUS_REG(USDHC2_BASE_PTR)
#define USDHC2_ADMA_SYS_ADDR                     USDHC_ADMA_SYS_ADDR_REG(USDHC2_BASE_PTR)
#define USDHC2_DLL_CTRL                          USDHC_DLL_CTRL_REG(USDHC2_BASE_PTR)
#define USDHC2_DLL_STATUS                        USDHC_DLL_STATUS_REG(USDHC2_BASE_PTR)
#define USDHC2_CLK_TUNE_CTRL_STATUS              USDHC_CLK_TUNE_CTRL_STATUS_REG(USDHC2_BASE_PTR)
#define USDHC2_VEND_SPEC                         USDHC_VEND_SPEC_REG(USDHC2_BASE_PTR)
#define USDHC2_MMC_BOOT                          USDHC_MMC_BOOT_REG(USDHC2_BASE_PTR)
#define USDHC2_VEND_SPEC2                        USDHC_VEND_SPEC2_REG(USDHC2_BASE_PTR)
#define USDHC2_TUNING_CTRL                       USDHC_TUNING_CTRL_REG(USDHC2_BASE_PTR)

/*!
 * @}
 */ /* end of group USDHC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USDHC_Peripheral */


/* ----------------------------------------------------------------------------
   -- WDOG
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Peripheral WDOG
 * @{
 */

/** WDOG - Peripheral register structure */
typedef struct WDOG_MemMap {
  uint16_t WCR;                                    /**< Watchdog Control Register, offset: 0x0 */
  uint16_t WSR;                                    /**< Watchdog Service Register, offset: 0x2 */
  uint16_t WRSR;                                   /**< Watchdog Reset Status Register, offset: 0x4 */
  uint16_t WICR;                                   /**< Watchdog Interrupt Control Register, offset: 0x6 */
  uint16_t WMCR;                                   /**< Watchdog Miscellaneous Control Register, offset: 0x8 */
} volatile *WDOG_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- WDOG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Register_Accessor_Macros WDOG - Register accessor macros
 * @{
 */


/* WDOG - Register accessors */
#define WDOG_WCR_REG(base)                       ((base)->WCR)
#define WDOG_WSR_REG(base)                       ((base)->WSR)
#define WDOG_WRSR_REG(base)                      ((base)->WRSR)
#define WDOG_WICR_REG(base)                      ((base)->WICR)
#define WDOG_WMCR_REG(base)                      ((base)->WMCR)

/*!
 * @}
 */ /* end of group WDOG_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- WDOG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Register_Masks WDOG Register Masks
 * @{
 */

