AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name WCR - Watchdog Control Register */
#define WDOG_WCR_WDZST_MASK                      (0x1U)
#define WDOG_WCR_WDZST_SHIFT                     (0U)
#define WDOG_WCR_WDBG_MASK                       (0x2U)
#define WDOG_WCR_WDBG_SHIFT                      (1U)
#define WDOG_WCR_WDE_MASK                        (0x4U)
#define WDOG_WCR_WDE_SHIFT                       (2U)
#define WDOG_WCR_WDT_MASK                        (0x8U)
#define WDOG_WCR_WDT_SHIFT                       (3U)
#define WDOG_WCR_SRS_MASK                        (0x10U)
#define WDOG_WCR_SRS_SHIFT                       (4U)
#define WDOG_WCR_WDA_MASK                        (0x20U)
#define WDOG_WCR_WDA_SHIFT                       (5U)
#define WDOG_WCR_SRE_MASK                        (0x40U)
#define WDOG_WCR_SRE_SHIFT                       (6U)
#define WDOG_WCR_WDW_MASK                        (0x80U)
#define WDOG_WCR_WDW_SHIFT                       (7U)
#define WDOG_WCR_WT_MASK                         (0xFF00U)
#define WDOG_WCR_WT_SHIFT                        (8U)
#define WDOG_WCR_WT(x)                           (((uint16_t)(((uint16_t)(x)) << WDOG_WCR_WT_SHIFT)) & WDOG_WCR_WT_MASK)

/*! @name WSR - Watchdog Service Register */
#define WDOG_WSR_WSR_MASK                        (0xFFFFU)
#define WDOG_WSR_WSR_SHIFT                       (0U)
#define WDOG_WSR_WSR(x)                          (((uint16_t)(((uint16_t)(x)) << WDOG_WSR_WSR_SHIFT)) & WDOG_WSR_WSR_MASK)

/*! @name WRSR - Watchdog Reset Status Register */
#define WDOG_WRSR_SFTW_MASK                      (0x1U)
#define WDOG_WRSR_SFTW_SHIFT                     (0U)
#define WDOG_WRSR_TOUT_MASK                      (0x2U)
#define WDOG_WRSR_TOUT_SHIFT                     (1U)
#define WDOG_WRSR_POR_MASK                       (0x10U)
#define WDOG_WRSR_POR_SHIFT                      (4U)

/*! @name WICR - Watchdog Interrupt Control Register */
#define WDOG_WICR_WICT_MASK                      (0xFFU)
#define WDOG_WICR_WICT_SHIFT                     (0U)
#define WDOG_WICR_WICT(x)                        (((uint16_t)(((uint16_t)(x)) << WDOG_WICR_WICT_SHIFT)) & WDOG_WICR_WICT_MASK)
#define WDOG_WICR_WTIS_MASK                      (0x4000U)
#define WDOG_WICR_WTIS_SHIFT                     (14U)
#define WDOG_WICR_WIE_MASK                       (0x8000U)
#define WDOG_WICR_WIE_SHIFT                      (15U)

/*! @name WMCR - Watchdog Miscellaneous Control Register */
#define WDOG_WMCR_PDE_MASK                       (0x1U)
#define WDOG_WMCR_PDE_SHIFT                      (0U)


/*!
 * @}
 */ /* end of group WDOG_Register_Masks */


/* WDOG - Peripheral instance base addresses */
/** Peripheral WDOG1 base pointer */
#define WDOG1_BASE_PTR                           ((WDOG_MemMapPtr)0x400B8000u)
/** Peripheral WDOG2 base pointer */
#define WDOG2_BASE_PTR                           ((WDOG_MemMapPtr)0x400D0000u)
/** Array initializer of WDOG peripheral base pointers */
#define WDOG_BASE_PTRS                           { WDOG1_BASE_PTR, WDOG2_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- WDOG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Register_Accessor_Macros WDOG - Register accessor macros
 * @{
 */


/* WDOG - Register instance definitions */
/* WDOG1 */
#define WDOG1_WCR                                WDOG_WCR_REG(WDOG1_BASE_PTR)
#define WDOG1_WSR                                WDOG_WSR_REG(WDOG1_BASE_PTR)
#define WDOG1_WRSR                               WDOG_WRSR_REG(WDOG1_BASE_PTR)
#define WDOG1_WICR                               WDOG_WICR_REG(WDOG1_BASE_PTR)
#define WDOG1_WMCR                               WDOG_WMCR_REG(WDOG1_BASE_PTR)
/* WDOG2 */
#define WDOG2_WCR                                WDOG_WCR_REG(WDOG2_BASE_PTR)
#define WDOG2_WSR                                WDOG_WSR_REG(WDOG2_BASE_PTR)
#define WDOG2_WRSR                               WDOG_WRSR_REG(WDOG2_BASE_PTR)
#define WDOG2_WICR                               WDOG_WICR_REG(WDOG2_BASE_PTR)
#define WDOG2_WMCR                               WDOG_WMCR_REG(WDOG2_BASE_PTR)

/*!
 * @}
 */ /* end of group WDOG_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group WDOG_Peripheral */


/* ----------------------------------------------------------------------------
   -- XBARA
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARA_Peripheral XBARA
 * @{
 */

/** XBARA - Peripheral register structure */
typedef struct XBARA_MemMap {
  uint16_t SEL0;                                   /**< Crossbar A Select Register 0, offset: 0x0 */
  uint16_t SEL1;                                   /**< Crossbar A Select Register 1, offset: 0x2 */
  uint16_t SEL2;                                   /**< Crossbar A Select Register 2, offset: 0x4 */
  uint16_t SEL3;                                   /**< Crossbar A Select Register 3, offset: 0x6 */
  uint16_t SEL4;                                   /**< Crossbar A Select Register 4, offset: 0x8 */
  uint16_t SEL5;                                   /**< Crossbar A Select Register 5, offset: 0xA */
  uint16_t SEL6;                                   /**< Crossbar A Select Register 6, offset: 0xC */
  uint16_t SEL7;                                   /**< Crossbar A Select Register 7, offset: 0xE */
  uint16_t SEL8;                                   /**< Crossbar A Select Register 8, offset: 0x10 */
  uint16_t SEL9;                                   /**< Crossbar A Select Register 9, offset: 0x12 */
  uint16_t SEL10;                                  /**< Crossbar A Select Register 10, offset: 0x14 */
  uint16_t SEL11;                                  /**< Crossbar A Select Register 11, offset: 0x16 */
  uint16_t SEL12;                                  /**< Crossbar A Select Register 12, offset: 0x18 */
  uint16_t SEL13;                                  /**< Crossbar A Select Register 13, offset: 0x1A */
  uint16_t SEL14;                                  /**< Crossbar A Select Register 14, offset: 0x1C */
  uint16_t SEL15;                                  /**< Crossbar A Select Register 15, offset: 0x1E */
  uint16_t SEL16;                                  /**< Crossbar A Select Register 16, offset: 0x20 */
  uint16_t SEL17;                                  /**< Crossbar A Select Register 17, offset: 0x22 */
  uint16_t SEL18;                                  /**< Crossbar A Select Register 18, offset: 0x24 */
  uint16_t SEL19;                                  /**< Crossbar A Select Register 19, offset: 0x26 */
  uint16_t SEL20;                                  /**< Crossbar A Select Register 20, offset: 0x28 */
  uint16_t SEL21;                                  /**< Crossbar A Select Register 21, offset: 0x2A */
  uint16_t SEL22;                                  /**< Crossbar A Select Register 22, offset: 0x2C */
  uint16_t SEL23;                                  /**< Crossbar A Select Register 23, offset: 0x2E */
  uint16_t SEL24;                                  /**< Crossbar A Select Register 24, offset: 0x30 */
  uint16_t SEL25;                                  /**< Crossbar A Select Register 25, offset: 0x32 */
  uint16_t SEL26;                                  /**< Crossbar A Select Register 26, offset: 0x34 */
  uint16_t SEL27;                                  /**< Crossbar A Select Register 27, offset: 0x36 */
  uint16_t SEL28;                                  /**< Crossbar A Select Register 28, offset: 0x38 */
  uint16_t SEL29;                                  /**< Crossbar A Select Register 29, offset: 0x3A */
  uint16_t SEL30;                                  /**< Crossbar A Select Register 30, offset: 0x3C */
  uint16_t SEL31;                                  /**< Crossbar A Select Register 31, offset: 0x3E */
  uint16_t SEL32;                                  /**< Crossbar A Select Register 32, offset: 0x40 */
  uint16_t SEL33;                                  /**< Crossbar A Select Register 33, offset: 0x42 */
  uint16_t SEL34;                                  /**< Crossbar A Select Register 34, offset: 0x44 */
  uint16_t SEL35;                                  /**< Crossbar A Select Register 35, offset: 0x46 */
  uint16_t SEL36;                                  /**< Crossbar A Select Register 36, offset: 0x48 */
  uint16_t SEL37;                                  /**< Crossbar A Select Register 37, offset: 0x4A */
  uint16_t SEL38;                                  /**< Crossbar A Select Register 38, offset: 0x4C */
  uint16_t SEL39;                                  /**< Crossbar A Select Register 39, offset: 0x4E */
  uint16_t SEL40;                                  /**< Crossbar A Select Register 40, offset: 0x50 */
  uint16_t SEL41;                                  /**< Crossbar A Select Register 41, offset: 0x52 */
  uint16_t SEL42;                                  /**< Crossbar A Select Register 42, offset: 0x54 */
  uint16_t SEL43;                                  /**< Crossbar A Select Register 43, offset: 0x56 */
  uint16_t SEL44;                                  /**< Crossbar A Select Register 44, offset: 0x58 */
  uint16_t SEL45;                                  /**< Crossbar A Select Register 45, offset: 0x5A */
  uint16_t SEL46;                                  /**< Crossbar A Select Register 46, offset: 0x5C */
  uint16_t SEL47;                                  /**< Crossbar A Select Register 47, offset: 0x5E */
  uint16_t SEL48;                                  /**< Crossbar A Select Register 48, offset: 0x60 */
  uint16_t SEL49;                                  /**< Crossbar A Select Register 49, offset: 0x62 */
  uint16_t SEL50;                                  /**< Crossbar A Select Register 50, offset: 0x64 */
  uint16_t SEL51;                                  /**< Crossbar A Select Register 51, offset: 0x66 */
  uint16_t SEL52;                                  /**< Crossbar A Select Register 52, offset: 0x68 */
  uint16_t SEL53;                                  /**< Crossbar A Select Register 53, offset: 0x6A */
  uint16_t SEL54;                                  /**< Crossbar A Select Register 54, offset: 0x6C */
  uint16_t SEL55;                                  /**< Crossbar A Select Register 55, offset: 0x6E */
  uint16_t SEL56;                                  /**< Crossbar A Select Register 56, offset: 0x70 */
  uint16_t SEL57;                                  /**< Crossbar A Select Register 57, offset: 0x72 */
  uint16_t SEL58;                                  /**< Crossbar A Select Register 58, offset: 0x74 */
  uint16_t SEL59;                                  /**< Crossbar A Select Register 59, offset: 0x76 */
  uint16_t SEL60;                                  /**< Crossbar A Select Register 60, offset: 0x78 */
  uint16_t SEL61;                                  /**< Crossbar A Select Register 61, offset: 0x7A */
  uint16_t SEL62;                                  /**< Crossbar A Select Register 62, offset: 0x7C */
  uint16_t SEL63;                                  /**< Crossbar A Select Register 63, offset: 0x7E */
  uint16_t SEL64;                                  /**< Crossbar A Select Register 64, offset: 0x80 */
  uint16_t SEL65;                                  /**< Crossbar A Select Register 65, offset: 0x82 */
  uint16_t CTRL0;                                  /**< Crossbar A Control Register 0, offset: 0x84 */
  uint16_t CTRL1;                                  /**< Crossbar A Control Register 1, offset: 0x86 */
} volatile *XBARA_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- XBARA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARA_Register_Accessor_Macros XBARA - Register accessor macros
 * @{
 */


