AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* XBARA - Register accessors */
#define XBARA_SEL0_REG(base)                     ((base)->SEL0)
#define XBARA_SEL1_REG(base)                     ((base)->SEL1)
#define XBARA_SEL2_REG(base)                     ((base)->SEL2)
#define XBARA_SEL3_REG(base)                     ((base)->SEL3)
#define XBARA_SEL4_REG(base)                     ((base)->SEL4)
#define XBARA_SEL5_REG(base)                     ((base)->SEL5)
#define XBARA_SEL6_REG(base)                     ((base)->SEL6)
#define XBARA_SEL7_REG(base)                     ((base)->SEL7)
#define XBARA_SEL8_REG(base)                     ((base)->SEL8)
#define XBARA_SEL9_REG(base)                     ((base)->SEL9)
#define XBARA_SEL10_REG(base)                    ((base)->SEL10)
#define XBARA_SEL11_REG(base)                    ((base)->SEL11)
#define XBARA_SEL12_REG(base)                    ((base)->SEL12)
#define XBARA_SEL13_REG(base)                    ((base)->SEL13)
#define XBARA_SEL14_REG(base)                    ((base)->SEL14)
#define XBARA_SEL15_REG(base)                    ((base)->SEL15)
#define XBARA_SEL16_REG(base)                    ((base)->SEL16)
#define XBARA_SEL17_REG(base)                    ((base)->SEL17)
#define XBARA_SEL18_REG(base)                    ((base)->SEL18)
#define XBARA_SEL19_REG(base)                    ((base)->SEL19)
#define XBARA_SEL20_REG(base)                    ((base)->SEL20)
#define XBARA_SEL21_REG(base)                    ((base)->SEL21)
#define XBARA_SEL22_REG(base)                    ((base)->SEL22)
#define XBARA_SEL23_REG(base)                    ((base)->SEL23)
#define XBARA_SEL24_REG(base)                    ((base)->SEL24)
#define XBARA_SEL25_REG(base)                    ((base)->SEL25)
#define XBARA_SEL26_REG(base)                    ((base)->SEL26)
#define XBARA_SEL27_REG(base)                    ((base)->SEL27)
#define XBARA_SEL28_REG(base)                    ((base)->SEL28)
#define XBARA_SEL29_REG(base)                    ((base)->SEL29)
#define XBARA_SEL30_REG(base)                    ((base)->SEL30)
#define XBARA_SEL31_REG(base)                    ((base)->SEL31)
#define XBARA_SEL32_REG(base)                    ((base)->SEL32)
#define XBARA_SEL33_REG(base)                    ((base)->SEL33)
#define XBARA_SEL34_REG(base)                    ((base)->SEL34)
#define XBARA_SEL35_REG(base)                    ((base)->SEL35)
#define XBARA_SEL36_REG(base)                    ((base)->SEL36)
#define XBARA_SEL37_REG(base)                    ((base)->SEL37)
#define XBARA_SEL38_REG(base)                    ((base)->SEL38)
#define XBARA_SEL39_REG(base)                    ((base)->SEL39)
#define XBARA_SEL40_REG(base)                    ((base)->SEL40)
#define XBARA_SEL41_REG(base)                    ((base)->SEL41)
#define XBARA_SEL42_REG(base)                    ((base)->SEL42)
#define XBARA_SEL43_REG(base)                    ((base)->SEL43)
#define XBARA_SEL44_REG(base)                    ((base)->SEL44)
#define XBARA_SEL45_REG(base)                    ((base)->SEL45)
#define XBARA_SEL46_REG(base)                    ((base)->SEL46)
#define XBARA_SEL47_REG(base)                    ((base)->SEL47)
#define XBARA_SEL48_REG(base)                    ((base)->SEL48)
#define XBARA_SEL49_REG(base)                    ((base)->SEL49)
#define XBARA_SEL50_REG(base)                    ((base)->SEL50)
#define XBARA_SEL51_REG(base)                    ((base)->SEL51)
#define XBARA_SEL52_REG(base)                    ((base)->SEL52)
#define XBARA_SEL53_REG(base)                    ((base)->SEL53)
#define XBARA_SEL54_REG(base)                    ((base)->SEL54)
#define XBARA_SEL55_REG(base)                    ((base)->SEL55)
#define XBARA_SEL56_REG(base)                    ((base)->SEL56)
#define XBARA_SEL57_REG(base)                    ((base)->SEL57)
#define XBARA_SEL58_REG(base)                    ((base)->SEL58)
#define XBARA_SEL59_REG(base)                    ((base)->SEL59)
#define XBARA_SEL60_REG(base)                    ((base)->SEL60)
#define XBARA_SEL61_REG(base)                    ((base)->SEL61)
#define XBARA_SEL62_REG(base)                    ((base)->SEL62)
#define XBARA_SEL63_REG(base)                    ((base)->SEL63)
#define XBARA_SEL64_REG(base)                    ((base)->SEL64)
#define XBARA_SEL65_REG(base)                    ((base)->SEL65)
#define XBARA_CTRL0_REG(base)                    ((base)->CTRL0)
#define XBARA_CTRL1_REG(base)                    ((base)->CTRL1)

/*!
 * @}
 */ /* end of group XBARA_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- XBARA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARA_Register_Masks XBARA Register Masks
 * @{
 */

/*! @name SEL0 - Crossbar A Select Register 0 */
#define XBARA_SEL0_SEL0_MASK                     (0x7FU)
#define XBARA_SEL0_SEL0_SHIFT                    (0U)
#define XBARA_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL0_SEL0_SHIFT)) & XBARA_SEL0_SEL0_MASK)
#define XBARA_SEL0_SEL1_MASK                     (0x7F00U)
#define XBARA_SEL0_SEL1_SHIFT                    (8U)
#define XBARA_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL0_SEL1_SHIFT)) & XBARA_SEL0_SEL1_MASK)

/*! @name SEL1 - Crossbar A Select Register 1 */
#define XBARA_SEL1_SEL2_MASK                     (0x7FU)
#define XBARA_SEL1_SEL2_SHIFT                    (0U)
#define XBARA_SEL1_SEL2(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL1_SEL2_SHIFT)) & XBARA_SEL1_SEL2_MASK)
#define XBARA_SEL1_SEL3_MASK                     (0x7F00U)
#define XBARA_SEL1_SEL3_SHIFT                    (8U)
#define XBARA_SEL1_SEL3(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL1_SEL3_SHIFT)) & XBARA_SEL1_SEL3_MASK)

/*! @name SEL2 - Crossbar A Select Register 2 */
#define XBARA_SEL2_SEL4_MASK                     (0x7FU)
#define XBARA_SEL2_SEL4_SHIFT                    (0U)
#define XBARA_SEL2_SEL4(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL2_SEL4_SHIFT)) & XBARA_SEL2_SEL4_MASK)
#define XBARA_SEL2_SEL5_MASK                     (0x7F00U)
#define XBARA_SEL2_SEL5_SHIFT                    (8U)
#define XBARA_SEL2_SEL5(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL2_SEL5_SHIFT)) & XBARA_SEL2_SEL5_MASK)

/*! @name SEL3 - Crossbar A Select Register 3 */
#define XBARA_SEL3_SEL6_MASK                     (0x7FU)
#define XBARA_SEL3_SEL6_SHIFT                    (0U)
#define XBARA_SEL3_SEL6(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL3_SEL6_SHIFT)) & XBARA_SEL3_SEL6_MASK)
#define XBARA_SEL3_SEL7_MASK                     (0x7F00U)
#define XBARA_SEL3_SEL7_SHIFT                    (8U)
#define XBARA_SEL3_SEL7(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL3_SEL7_SHIFT)) & XBARA_SEL3_SEL7_MASK)

