AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/* XBARA - Peripheral instance base addresses */
/** Peripheral XBARA1 base pointer */
#define XBARA1_BASE_PTR                          ((XBARA_MemMapPtr)0x403BC000u)
/** Array initializer of XBARA peripheral base pointers */
#define XBARA_BASE_PTRS                          { XBARA1_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- XBARA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARA_Register_Accessor_Macros XBARA - Register accessor macros
 * @{
 */


/* XBARA - Register instance definitions */
/* XBARA1 */
#define XBARA1_SEL0                              XBARA_SEL0_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL1                              XBARA_SEL1_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL2                              XBARA_SEL2_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL3                              XBARA_SEL3_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL4                              XBARA_SEL4_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL5                              XBARA_SEL5_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL6                              XBARA_SEL6_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL7                              XBARA_SEL7_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL8                              XBARA_SEL8_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL9                              XBARA_SEL9_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL10                             XBARA_SEL10_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL11                             XBARA_SEL11_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL12                             XBARA_SEL12_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL13                             XBARA_SEL13_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL14                             XBARA_SEL14_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL15                             XBARA_SEL15_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL16                             XBARA_SEL16_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL17                             XBARA_SEL17_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL18                             XBARA_SEL18_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL19                             XBARA_SEL19_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL20                             XBARA_SEL20_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL21                             XBARA_SEL21_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL22                             XBARA_SEL22_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL23                             XBARA_SEL23_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL24                             XBARA_SEL24_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL25                             XBARA_SEL25_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL26                             XBARA_SEL26_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL27                             XBARA_SEL27_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL28                             XBARA_SEL28_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL29                             XBARA_SEL29_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL30                             XBARA_SEL30_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL31                             XBARA_SEL31_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL32                             XBARA_SEL32_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL33                             XBARA_SEL33_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL34                             XBARA_SEL34_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL35                             XBARA_SEL35_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL36                             XBARA_SEL36_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL37                             XBARA_SEL37_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL38                             XBARA_SEL38_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL39                             XBARA_SEL39_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL40                             XBARA_SEL40_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL41                             XBARA_SEL41_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL42                             XBARA_SEL42_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL43                             XBARA_SEL43_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL44                             XBARA_SEL44_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL45                             XBARA_SEL45_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL46                             XBARA_SEL46_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL47                             XBARA_SEL47_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL48                             XBARA_SEL48_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL49                             XBARA_SEL49_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL50                             XBARA_SEL50_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL51                             XBARA_SEL51_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL52                             XBARA_SEL52_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL53                             XBARA_SEL53_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL54                             XBARA_SEL54_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL55                             XBARA_SEL55_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL56                             XBARA_SEL56_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL57                             XBARA_SEL57_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL58                             XBARA_SEL58_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL59                             XBARA_SEL59_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL60                             XBARA_SEL60_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL61                             XBARA_SEL61_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL62                             XBARA_SEL62_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL63                             XBARA_SEL63_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL64                             XBARA_SEL64_REG(XBARA1_BASE_PTR)
#define XBARA1_SEL65                             XBARA_SEL65_REG(XBARA1_BASE_PTR)
#define XBARA1_CTRL0                             XBARA_CTRL0_REG(XBARA1_BASE_PTR)
#define XBARA1_CTRL1                             XBARA_CTRL1_REG(XBARA1_BASE_PTR)

/*!
 * @}
 */ /* end of group XBARA_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group XBARA_Peripheral */


/* ----------------------------------------------------------------------------
   -- XBARB
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Peripheral XBARB
 * @{
 */

/** XBARB - Peripheral register structure */
typedef struct XBARB_MemMap {
  uint16_t SEL0;                                   /**< Crossbar B Select Register 0, offset: 0x0 */
  uint16_t SEL1;                                   /**< Crossbar B Select Register 1, offset: 0x2 */
  uint16_t SEL2;                                   /**< Crossbar B Select Register 2, offset: 0x4 */
  uint16_t SEL3;                                   /**< Crossbar B Select Register 3, offset: 0x6 */
  uint16_t SEL4;                                   /**< Crossbar B Select Register 4, offset: 0x8 */
  uint16_t SEL5;                                   /**< Crossbar B Select Register 5, offset: 0xA */
  uint16_t SEL6;                                   /**< Crossbar B Select Register 6, offset: 0xC */
  uint16_t SEL7;                                   /**< Crossbar B Select Register 7, offset: 0xE */
} volatile *XBARB_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- XBARB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Accessor_Macros XBARB - Register accessor macros
 * @{
 */


/* XBARB - Register accessors */
#define XBARB_SEL0_REG(base)                     ((base)->SEL0)
#define XBARB_SEL1_REG(base)                     ((base)->SEL1)
#define XBARB_SEL2_REG(base)                     ((base)->SEL2)
#define XBARB_SEL3_REG(base)                     ((base)->SEL3)
#define XBARB_SEL4_REG(base)                     ((base)->SEL4)
#define XBARB_SEL5_REG(base)                     ((base)->SEL5)
#define XBARB_SEL6_REG(base)                     ((base)->SEL6)
#define XBARB_SEL7_REG(base)                     ((base)->SEL7)

/*!
 * @}
 */ /* end of group XBARB_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- XBARB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Masks XBARB Register Masks
 * @{
 */

/*! @name SEL0 - Crossbar B Select Register 0 */
#define XBARB_SEL0_SEL0_MASK                     (0x3FU)
#define XBARB_SEL0_SEL0_SHIFT                    (0U)
#define XBARB_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL0_SEL0_SHIFT)) & XBARB_SEL0_SEL0_MASK)
#define XBARB_SEL0_SEL1_MASK                     (0x3F00U)
#define XBARB_SEL0_SEL1_SHIFT                    (8U)
#define XBARB_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL0_SEL1_SHIFT)) & XBARB_SEL0_SEL1_MASK)

