AlexYzhov/IMXRT_IARFlashloader/Drivers/MIMXRT1052_old.h
/*! @name SEL1 - Crossbar B Select Register 1 */
#define XBARB_SEL1_SEL2_MASK                     (0x3FU)
#define XBARB_SEL1_SEL2_SHIFT                    (0U)
#define XBARB_SEL1_SEL2(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL1_SEL2_SHIFT)) & XBARB_SEL1_SEL2_MASK)
#define XBARB_SEL1_SEL3_MASK                     (0x3F00U)
#define XBARB_SEL1_SEL3_SHIFT                    (8U)
#define XBARB_SEL1_SEL3(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL1_SEL3_SHIFT)) & XBARB_SEL1_SEL3_MASK)

/*! @name SEL2 - Crossbar B Select Register 2 */
#define XBARB_SEL2_SEL4_MASK                     (0x3FU)
#define XBARB_SEL2_SEL4_SHIFT                    (0U)
#define XBARB_SEL2_SEL4(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL2_SEL4_SHIFT)) & XBARB_SEL2_SEL4_MASK)
#define XBARB_SEL2_SEL5_MASK                     (0x3F00U)
#define XBARB_SEL2_SEL5_SHIFT                    (8U)
#define XBARB_SEL2_SEL5(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL2_SEL5_SHIFT)) & XBARB_SEL2_SEL5_MASK)

/*! @name SEL3 - Crossbar B Select Register 3 */
#define XBARB_SEL3_SEL6_MASK                     (0x3FU)
#define XBARB_SEL3_SEL6_SHIFT                    (0U)
#define XBARB_SEL3_SEL6(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL3_SEL6_SHIFT)) & XBARB_SEL3_SEL6_MASK)
#define XBARB_SEL3_SEL7_MASK                     (0x3F00U)
#define XBARB_SEL3_SEL7_SHIFT                    (8U)
#define XBARB_SEL3_SEL7(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL3_SEL7_SHIFT)) & XBARB_SEL3_SEL7_MASK)

/*! @name SEL4 - Crossbar B Select Register 4 */
#define XBARB_SEL4_SEL8_MASK                     (0x3FU)
#define XBARB_SEL4_SEL8_SHIFT                    (0U)
#define XBARB_SEL4_SEL8(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL4_SEL8_SHIFT)) & XBARB_SEL4_SEL8_MASK)
#define XBARB_SEL4_SEL9_MASK                     (0x3F00U)
#define XBARB_SEL4_SEL9_SHIFT                    (8U)
#define XBARB_SEL4_SEL9(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL4_SEL9_SHIFT)) & XBARB_SEL4_SEL9_MASK)

/*! @name SEL5 - Crossbar B Select Register 5 */
#define XBARB_SEL5_SEL10_MASK                    (0x3FU)
#define XBARB_SEL5_SEL10_SHIFT                   (0U)
#define XBARB_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL5_SEL10_SHIFT)) & XBARB_SEL5_SEL10_MASK)
#define XBARB_SEL5_SEL11_MASK                    (0x3F00U)
#define XBARB_SEL5_SEL11_SHIFT                   (8U)
#define XBARB_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL5_SEL11_SHIFT)) & XBARB_SEL5_SEL11_MASK)

/*! @name SEL6 - Crossbar B Select Register 6 */
#define XBARB_SEL6_SEL12_MASK                    (0x3FU)
#define XBARB_SEL6_SEL12_SHIFT                   (0U)
#define XBARB_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL6_SEL12_SHIFT)) & XBARB_SEL6_SEL12_MASK)
#define XBARB_SEL6_SEL13_MASK                    (0x3F00U)
#define XBARB_SEL6_SEL13_SHIFT                   (8U)
#define XBARB_SEL6_SEL13(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL6_SEL13_SHIFT)) & XBARB_SEL6_SEL13_MASK)

/*! @name SEL7 - Crossbar B Select Register 7 */
#define XBARB_SEL7_SEL14_MASK                    (0x3FU)
#define XBARB_SEL7_SEL14_SHIFT                   (0U)
#define XBARB_SEL7_SEL14(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL7_SEL14_SHIFT)) & XBARB_SEL7_SEL14_MASK)
#define XBARB_SEL7_SEL15_MASK                    (0x3F00U)
#define XBARB_SEL7_SEL15_SHIFT                   (8U)
#define XBARB_SEL7_SEL15(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL7_SEL15_SHIFT)) & XBARB_SEL7_SEL15_MASK)


/*!
 * @}
 */ /* end of group XBARB_Register_Masks */


/* XBARB - Peripheral instance base addresses */
/** Peripheral XBARB2 base pointer */
#define XBARB2_BASE_PTR                          ((XBARB_MemMapPtr)0x403C0000u)
/** Peripheral XBARB3 base pointer */
#define XBARB3_BASE_PTR                          ((XBARB_MemMapPtr)0x403C4000u)
/** Array initializer of XBARB peripheral base pointers */
#define XBARB_BASE_PTRS                          { XBARB2_BASE_PTR, XBARB3_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- XBARB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Accessor_Macros XBARB - Register accessor macros
 * @{
 */


/* XBARB - Register instance definitions */
/* XBARB2 */
#define XBARB2_SEL0                              XBARB_SEL0_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL1                              XBARB_SEL1_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL2                              XBARB_SEL2_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL3                              XBARB_SEL3_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL4                              XBARB_SEL4_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL5                              XBARB_SEL5_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL6                              XBARB_SEL6_REG(XBARB2_BASE_PTR)
#define XBARB2_SEL7                              XBARB_SEL7_REG(XBARB2_BASE_PTR)
/* XBARB3 */
#define XBARB3_SEL0                              XBARB_SEL0_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL1                              XBARB_SEL1_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL2                              XBARB_SEL2_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL3                              XBARB_SEL3_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL4                              XBARB_SEL4_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL5                              XBARB_SEL5_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL6                              XBARB_SEL6_REG(XBARB3_BASE_PTR)
#define XBARB3_SEL7                              XBARB_SEL7_REG(XBARB3_BASE_PTR)

/*!
 * @}
 */ /* end of group XBARB_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group XBARB_Peripheral */


/* ----------------------------------------------------------------------------
   -- XTALOSC24M
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XTALOSC24M_Peripheral XTALOSC24M
 * @{
 */

/** XTALOSC24M - Peripheral register structure */
typedef struct XTALOSC24M_MemMap {
  uint8_t RESERVED_0[336];
  uint32_t MISC0;                                  /**< Miscellaneous Register 0, offset: 0x150 */
  uint32_t MISC0_SET;                              /**< Miscellaneous Register 0, offset: 0x154 */
  uint32_t MISC0_CLR;                              /**< Miscellaneous Register 0, offset: 0x158 */
  uint32_t MISC0_TOG;                              /**< Miscellaneous Register 0, offset: 0x15C */
  uint8_t RESERVED_1[272];
  uint32_t LOWPWR_CTRL;                            /**< XTAL OSC (LP) Control Register, offset: 0x270 */
  uint32_t LOWPWR_CTRL_SET;                        /**< XTAL OSC (LP) Control Register, offset: 0x274 */
  uint32_t LOWPWR_CTRL_CLR;                        /**< XTAL OSC (LP) Control Register, offset: 0x278 */
  uint32_t LOWPWR_CTRL_TOG;                        /**< XTAL OSC (LP) Control Register, offset: 0x27C */
  uint8_t RESERVED_2[32];
  uint32_t OSC_CONFIG0;                            /**< XTAL OSC Configuration 0 Register, offset: 0x2A0 */
  uint32_t OSC_CONFIG0_SET;                        /**< XTAL OSC Configuration 0 Register, offset: 0x2A4 */
  uint32_t OSC_CONFIG0_CLR;                        /**< XTAL OSC Configuration 0 Register, offset: 0x2A8 */
  uint32_t OSC_CONFIG0_TOG;                        /**< XTAL OSC Configuration 0 Register, offset: 0x2AC */
  uint32_t OSC_CONFIG1;                            /**< XTAL OSC Configuration 1 Register, offset: 0x2B0 */
  uint32_t OSC_CONFIG1_SET;                        /**< XTAL OSC Configuration 1 Register, offset: 0x2B4 */
  uint32_t OSC_CONFIG1_CLR;                        /**< XTAL OSC Configuration 1 Register, offset: 0x2B8 */
  uint32_t OSC_CONFIG1_TOG;                        /**< XTAL OSC Configuration 1 Register, offset: 0x2BC */
  uint32_t OSC_CONFIG2;                            /**< XTAL OSC Configuration 2 Register, offset: 0x2C0 */
  uint32_t OSC_CONFIG2_SET;                        /**< XTAL OSC Configuration 2 Register, offset: 0x2C4 */
  uint32_t OSC_CONFIG2_CLR;                        /**< XTAL OSC Configuration 2 Register, offset: 0x2C8 */
  uint32_t OSC_CONFIG2_TOG;                        /**< XTAL OSC Configuration 2 Register, offset: 0x2CC */
} volatile *XTALOSC24M_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- XTALOSC24M - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XTALOSC24M_Register_Accessor_Macros XTALOSC24M - Register accessor macros
 * @{
 */


/* XTALOSC24M - Register accessors */
#define XTALOSC24M_MISC0_REG(base)               ((base)->MISC0)
#define XTALOSC24M_MISC0_SET_REG(base)           ((base)->MISC0_SET)
#define XTALOSC24M_MISC0_CLR_REG(base)           ((base)->MISC0_CLR)
#define XTALOSC24M_MISC0_TOG_REG(base)           ((base)->MISC0_TOG)
#define XTALOSC24M_LOWPWR_CTRL_REG(base)         ((base)->LOWPWR_CTRL)
#define XTALOSC24M_LOWPWR_CTRL_SET_REG(base)     ((base)->LOWPWR_CTRL_SET)
#define XTALOSC24M_LOWPWR_CTRL_CLR_REG(base)     ((base)->LOWPWR_CTRL_CLR)
#define XTALOSC24M_LOWPWR_CTRL_TOG_REG(base)     ((base)->LOWPWR_CTRL_TOG)
#define XTALOSC24M_OSC_CONFIG0_REG(base)         ((base)->OSC_CONFIG0)
#define XTALOSC24M_OSC_CONFIG0_SET_REG(base)     ((base)->OSC_CONFIG0_SET)
#define XTALOSC24M_OSC_CONFIG0_CLR_REG(base)     ((base)->OSC_CONFIG0_CLR)
#define XTALOSC24M_OSC_CONFIG0_TOG_REG(base)     ((base)->OSC_CONFIG0_TOG)
#define XTALOSC24M_OSC_CONFIG1_REG(base)         ((base)->OSC_CONFIG1)
#define XTALOSC24M_OSC_CONFIG1_SET_REG(base)     ((base)->OSC_CONFIG1_SET)
#define XTALOSC24M_OSC_CONFIG1_CLR_REG(base)     ((base)->OSC_CONFIG1_CLR)
#define XTALOSC24M_OSC_CONFIG1_TOG_REG(base)     ((base)->OSC_CONFIG1_TOG)
#define XTALOSC24M_OSC_CONFIG2_REG(base)         ((base)->OSC_CONFIG2)
#define XTALOSC24M_OSC_CONFIG2_SET_REG(base)     ((base)->OSC_CONFIG2_SET)
#define XTALOSC24M_OSC_CONFIG2_CLR_REG(base)     ((base)->OSC_CONFIG2_CLR)
#define XTALOSC24M_OSC_CONFIG2_TOG_REG(base)     ((base)->OSC_CONFIG2_TOG)

/*!
 * @}
 */ /* end of group XTALOSC24M_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- XTALOSC24M Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XTALOSC24M_Register_Masks XTALOSC24M Register Masks
 * @{
 */

/*! @name MISC0 - Miscellaneous Register 0 */
#define XTALOSC24M_MISC0_REFTOP_PWD_MASK         (0x1U)
#define XTALOSC24M_MISC0_REFTOP_PWD_SHIFT        (0U)
#define XTALOSC24M_MISC0_REFTOP_SELFBIASOFF_MASK (0x8U)
#define XTALOSC24M_MISC0_REFTOP_SELFBIASOFF_SHIFT (3U)
#define XTALOSC24M_MISC0_REFTOP_VBGADJ_MASK      (0x70U)
#define XTALOSC24M_MISC0_REFTOP_VBGADJ_SHIFT     (4U)
#define XTALOSC24M_MISC0_REFTOP_VBGADJ(x)        (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_REFTOP_VBGADJ_SHIFT)) & XTALOSC24M_MISC0_REFTOP_VBGADJ_MASK)
#define XTALOSC24M_MISC0_REFTOP_VBGUP_MASK       (0x80U)
#define XTALOSC24M_MISC0_REFTOP_VBGUP_SHIFT      (7U)
#define XTALOSC24M_MISC0_STOP_MODE_CONFIG_MASK   (0xC00U)
#define XTALOSC24M_MISC0_STOP_MODE_CONFIG_SHIFT  (10U)
#define XTALOSC24M_MISC0_STOP_MODE_CONFIG(x)     (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_STOP_MODE_CONFIG_SHIFT)) & XTALOSC24M_MISC0_STOP_MODE_CONFIG_MASK)
#define XTALOSC24M_MISC0_DISCON_HIGH_SNVS_MASK   (0x1000U)
#define XTALOSC24M_MISC0_DISCON_HIGH_SNVS_SHIFT  (12U)
#define XTALOSC24M_MISC0_OSC_I_MASK              (0x6000U)
#define XTALOSC24M_MISC0_OSC_I_SHIFT             (13U)
#define XTALOSC24M_MISC0_OSC_I(x)                (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_OSC_I_SHIFT)) & XTALOSC24M_MISC0_OSC_I_MASK)
#define XTALOSC24M_MISC0_OSC_XTALOK_MASK         (0x8000U)
#define XTALOSC24M_MISC0_OSC_XTALOK_SHIFT        (15U)
#define XTALOSC24M_MISC0_OSC_XTALOK_EN_MASK      (0x10000U)
#define XTALOSC24M_MISC0_OSC_XTALOK_EN_SHIFT     (16U)
#define XTALOSC24M_MISC0_CLKGATE_CTRL_MASK       (0x2000000U)
#define XTALOSC24M_MISC0_CLKGATE_CTRL_SHIFT      (25U)
#define XTALOSC24M_MISC0_CLKGATE_DELAY_MASK      (0x1C000000U)
#define XTALOSC24M_MISC0_CLKGATE_DELAY_SHIFT     (26U)
#define XTALOSC24M_MISC0_CLKGATE_DELAY(x)        (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_CLKGATE_DELAY_SHIFT)) & XTALOSC24M_MISC0_CLKGATE_DELAY_MASK)
#define XTALOSC24M_MISC0_RTC_XTAL_SOURCE_MASK    (0x20000000U)
#define XTALOSC24M_MISC0_RTC_XTAL_SOURCE_SHIFT   (29U)
#define XTALOSC24M_MISC0_XTAL_24M_PWD_MASK       (0x40000000U)
#define XTALOSC24M_MISC0_XTAL_24M_PWD_SHIFT      (30U)
#define XTALOSC24M_MISC0_VID_PLL_PREDIV_MASK     (0x80000000U)
#define XTALOSC24M_MISC0_VID_PLL_PREDIV_SHIFT    (31U)

/*! @name MISC0_SET - Miscellaneous Register 0 */
#define XTALOSC24M_MISC0_SET_REFTOP_PWD_MASK     (0x1U)
#define XTALOSC24M_MISC0_SET_REFTOP_PWD_SHIFT    (0U)
#define XTALOSC24M_MISC0_SET_REFTOP_SELFBIASOFF_MASK (0x8U)
#define XTALOSC24M_MISC0_SET_REFTOP_SELFBIASOFF_SHIFT (3U)
#define XTALOSC24M_MISC0_SET_REFTOP_VBGADJ_MASK  (0x70U)
#define XTALOSC24M_MISC0_SET_REFTOP_VBGADJ_SHIFT (4U)
#define XTALOSC24M_MISC0_SET_REFTOP_VBGADJ(x)    (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_SET_REFTOP_VBGADJ_SHIFT)) & XTALOSC24M_MISC0_SET_REFTOP_VBGADJ_MASK)
#define XTALOSC24M_MISC0_SET_REFTOP_VBGUP_MASK   (0x80U)
#define XTALOSC24M_MISC0_SET_REFTOP_VBGUP_SHIFT  (7U)
#define XTALOSC24M_MISC0_SET_STOP_MODE_CONFIG_MASK (0xC00U)
#define XTALOSC24M_MISC0_SET_STOP_MODE_CONFIG_SHIFT (10U)
#define XTALOSC24M_MISC0_SET_STOP_MODE_CONFIG(x) (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_SET_STOP_MODE_CONFIG_SHIFT)) & XTALOSC24M_MISC0_SET_STOP_MODE_CONFIG_MASK)
#define XTALOSC24M_MISC0_SET_DISCON_HIGH_SNVS_MASK (0x1000U)
#define XTALOSC24M_MISC0_SET_DISCON_HIGH_SNVS_SHIFT (12U)
#define XTALOSC24M_MISC0_SET_OSC_I_MASK          (0x6000U)
#define XTALOSC24M_MISC0_SET_OSC_I_SHIFT         (13U)
#define XTALOSC24M_MISC0_SET_OSC_I(x)            (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_SET_OSC_I_SHIFT)) & XTALOSC24M_MISC0_SET_OSC_I_MASK)
#define XTALOSC24M_MISC0_SET_OSC_XTALOK_MASK     (0x8000U)
#define XTALOSC24M_MISC0_SET_OSC_XTALOK_SHIFT    (15U)
#define XTALOSC24M_MISC0_SET_OSC_XTALOK_EN_MASK  (0x10000U)
#define XTALOSC24M_MISC0_SET_OSC_XTALOK_EN_SHIFT (16U)
#define XTALOSC24M_MISC0_SET_CLKGATE_CTRL_MASK   (0x2000000U)
#define XTALOSC24M_MISC0_SET_CLKGATE_CTRL_SHIFT  (25U)
#define XTALOSC24M_MISC0_SET_CLKGATE_DELAY_MASK  (0x1C000000U)
#define XTALOSC24M_MISC0_SET_CLKGATE_DELAY_SHIFT (26U)
#define XTALOSC24M_MISC0_SET_CLKGATE_DELAY(x)    (((uint32_t)(((uint32_t)(x)) << XTALOSC24M_MISC0_SET_CLKGATE_DELAY_SHIFT)) & XTALOSC24M_MISC0_SET_CLKGATE_DELAY_MASK)
#define XTALOSC24M_MISC0_SET_RTC_XTAL_SOURCE_MASK (0x20000000U)
#define XTALOSC24M_MISC0_SET_RTC_XTAL_SOURCE_SHIFT (29U)
#define XTALOSC24M_MISC0_SET_XTAL_24M_PWD_MASK   (0x40000000U)
#define XTALOSC24M_MISC0_SET_XTAL_24M_PWD_SHIFT  (30U)
#define XTALOSC24M_MISC0_SET_VID_PLL_PREDIV_MASK (0x80000000U)
#define XTALOSC24M_MISC0_SET_VID_PLL_PREDIV_SHIFT (31U)

